Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: Find Your Way Around
fr: Trouvez votre chemin

source: This section describes the different pages that you are going to see as you navigate around the NMHS Content Management System Admin interface.
fr: Cette section décrit les différentes pages que vous verrez lorsque vous naviguerez dans l'interface d'administration du système de gestion de contenu du NMHS.

source: How to reach the Dashboard
fr: Comment accéder au tableau de bord

source: The ClimWeb login button can be found at the top left corner of the website.
fr: Le bouton de connexion au ClimWeb se trouve dans le coin supérieur gauche du site Web.

source: Access Dashboard
fr: Accéder au tableau de bord

source: Logging into the ClimWeb automatically takes you to the Dashboard. If you navigate away from the dashboard, you can return to it at any time by clicking on the NMHS logo in the top-left section of your screen.
fr: La connexion au ClimWeb vous amène automatiquement au tableau de bord. Si vous quittez le tableau de bord, vous pouvez y revenir à tout moment en cliquant sur le logo NMHS dans la partie supérieure gauche de votre écran.

source: The Dashboard
fr: Le tableau de bord

source: The Dashboard is the main hub of the website. From the dashboard, you can access all of the content you create in the ClimWeb as well as reports, settings, and other content management features.
fr: Le tableau de bord est la plaque tournante principale du site Web. Depuis le tableau de bord, vous pouvez accéder à tout le contenu que vous créez dans le ClimWeb ainsi qu'aux rapports, paramètres et autres fonctionnalités de gestion de contenu.

source: ![Dashboard](../_static/images/navigating/dashboard.png "Dashboard")
fr: ![Tableau de bord](../_static/images/navigating/dashboard.png "Tableau de bord")

source: Dashboard
fr: Tableau de bord

source: What you see in your Dashboard depends on your user role. Common user roles include editors, moderators, composers, approvers, forecasters and administrators.
fr: Ce que vous voyez dans votre tableau de bord dépend de votre rôle d'utilisateur. Les rôles d'utilisateur courants incluent les éditeurs, les modérateurs, les compositeurs, les approbateurs, les prévisionnistes et les administrateurs.

source: The following are some of the tools that you can find within the Dashboard:
fr: Voici quelques-uns des outils que vous pouvez trouver dans le tableau de bord :

source: The Dashboard Panels
fr: Les panneaux du tableau de bord

source: The dashboard panels provide you with an overview of the various states of your pages.
fr: Les panneaux du tableau de bord vous offrent un aperçu des différents états de vos pages.

source: The different panels on your dashboard are as follows:
fr: Les différents panneaux de votre tableau de bord sont les suivants :

source: **1. Your pages in a workflow**
fr: **1. Vos pages dans un workflow**

source: The Your pages in a workflow panel shows you any pages in moderation that you own or have submitted for moderation yourself. It also shows the moderation tasks that are pending and how long the tasks have been open.
fr: Le panneau Vos pages dans un workflow vous montre toutes les pages en modération que vous possédez ou que vous avez vous-même soumises à modération. Il montre également les tâches de modération en attente et depuis combien de temps les tâches sont ouvertes.

source: **2. Awaiting your review**
fr: **2. En attente de votre avis**

source: If your webmaster or web developer gives you permission to perform moderation actions, your Wagtail dashboard displays the Awaiting your review panel. This panel shows content that's ready for you to review.
fr: Si votre webmaster ou développeur Web vous autorise à effectuer des actions de modération, votre tableau de bord Wagtail affiche le panneau En attente de votre révision. Ce panneau affiche le contenu que vous êtes prêt à examiner.

source: From the panel, you can perform the following actions:
fr: Depuis le panneau, vous pouvez effectuer les actions suivantes :

source: Click the name of a page to edit that page. Use the buttons to move the page to the next stage in your workflow by requesting changes to a page, approving the page, or approving the page with a comment. Get a quick view of the page status by hovering over the indicator circles to get more information about the pending task. The indicator circles show a tick for a completed task or an empty circle for an incomplete one. See how long a page has been waiting for review. Your most recent edits The Your most recent edits panel displays the five pages you last edited.
fr: Cliquez sur le nom d'une page pour modifier cette page. Utilisez les boutons pour déplacer la page vers l'étape suivante de votre flux de travail en demandant des modifications à une page, en approuvant la page ou en approuvant la page avec un commentaire. Obtenez un aperçu rapide de l'état de la page en survolant les cercles indicateurs pour obtenir plus d'informations sur la tâche en attente. Les cercles indicateurs montrent une coche pour une tâche terminée ou un cercle vide pour une tâche incomplète. Voyez depuis combien de temps une page est en attente de révision. Vos modifications les plus récentes Le panneau Vos modifications les plus récentes affiche les cinq pages que vous avez modifiées pour la dernière fois.

source: The panel also shows the date that you last edited the pages as well as the current status of the pages.
fr: Le panneau affiche également la date à laquelle vous avez modifié les pages pour la dernière fois ainsi que l'état actuel des pages.

source: **3. Your locked pages**
fr: **3. Vos pages verrouillées**

source: The Your locked pages panel shows all of the pages you've locked so that only you can edit them. From this panel, you can quickly view the date you locked a page. To edit a locked page, click the name.
fr: Le panneau Vos pages verrouillées affiche toutes les pages que vous avez verrouillées afin que vous seul puissiez les modifier. À partir de ce panneau, vous pouvez afficher rapidement la date à laquelle vous avez verrouillé une page. Pour modifier une page verrouillée, cliquez sur son nom.

source: The Sidebar
fr: La barre latérale

source: On the left-hand side of the dashboard and throughout the ClimWeb is a menu called the Sidebar. You can use the Sidebar to navigate to different parts of the ClimWeb.
fr: Sur le côté gauche du tableau de bord et dans tout le ClimWeb se trouve un menu appelé barre latérale. Vous pouvez utiliser la barre latérale pour accéder à différentes parties du ClimWeb.

source: The Sidebar helps you quickly access your content as well as ClimWeb features and settings. The items on the Sidebar can vary depending on what you have access to. These features include Search, Documents, Snippets, Forms, Reports, Settings, and Help.
fr: La barre latérale vous aide à accéder rapidement à votre contenu ainsi qu'aux fonctionnalités et paramètres du ClimWeb. Les éléments de la barre latérale peuvent varier en fonction de ce à quoi vous avez accès. Ces fonctionnalités incluent la recherche, les documents, les extraits de code, les formulaires, les rapports, les paramètres et l'aide.

source: If you want the Sidebar to take up less space, you can click the white arrow near the top of the Sidebar to switch it into slim mode and give yourself more space for writing.
fr: Si vous souhaitez que la barre latérale prenne moins de place, vous pouvez cliquer sur la flèche blanche située en haut de la barre latérale pour la faire passer en mode mince et vous donner plus d'espace pour écrire.

source: The Explorer Page
fr: La page Explorateur

source: The Explorer page allows you to view a page’s children and perform actions on them. On the Explorer page, you can publish and unpublish pages. You can also move the pages to other sections, drill down into the content tree, or reorder child pages within a parent.
fr: La page Explorateur vous permet d'afficher les enfants d'une page et d'effectuer des actions sur eux. Sur la page Explorateur, vous pouvez publier et annuler la publication de pages. Vous pouvez également déplacer les pages vers d'autres sections, explorer l'arborescence de contenu ou réorganiser les pages enfants au sein d'un parent.

source: You can see the name of the page whose Explorer page you are on as a heading at the top of the screen. If the page has child pages within it, then you can see a list displaying the child pages below the heading. Clicking the title of a child page takes you to the edit screen, from which you can edit that child page.
fr: Vous pouvez voir le nom de la page sur laquelle vous vous trouvez sous forme d'en-tête en haut de l'écran. Si la page contient des pages enfants, vous pouvez voir une liste affichant les pages enfants sous le titre. En cliquant sur le titre d'une page enfant, vous accédez à l'écran d'édition, à partir duquel vous pouvez modifier cette page enfant.

source: If you hover over a child page, you get an arrow on the right-hand side of that child page row. Clicking the arrow displays a further level of child pages.
fr: Si vous survolez une page enfant, vous obtenez une flèche sur le côté droit de la ligne de cette page enfant. Cliquer sur la flèche affiche un niveau supplémentaire de pages enfants.

source: ![Explorer](../_static/images/navigating/explorer_page.png "Explorer")
fr: ![Explorateur](../_static/images/navigating/explorer_page.png "Explorateur")

source: Explorer
fr: Explorateur

source: Additionally, hovering over a child page displays a checkbox at the left-hand side of the child page row. Selecting one or more child pages by clicking their checkboxes gives you an action bar at the bottom of the Explorer page. Clicking on any of the options in the action bar takes you to a confirmation page from which you can confirm the action.
fr: De plus, le survol d’une page enfant affiche une case à cocher sur le côté gauche de la ligne de la page enfant. La sélection d'une ou plusieurs pages enfants en cochant leurs cases vous donne une barre d'action en bas de la page de l'Explorateur. En cliquant sur l'une des options de la barre d'action, vous accédez à une page de confirmation à partir de laquelle vous pouvez confirmer l'action.

source: ![Child pages](../_static/images/navigating/child_pages.png "Child pages")
fr: ![Pages enfants](../_static/images/navigating/child_pages.png "Pages enfants")

source: Child pages
fr: Pages enfants

source: As you drill down through the site, the breadcrumb (the row of pages beginning with the home icon) displays the path you have taken. Clicking on the page titles in the breadcrumb takes you to the Explorer screen for that page.
fr: Au fur et à mesure que vous parcourez le site, le fil d'Ariane (la rangée de pages commençant par l'icône d'accueil) affiche le chemin que vous avez emprunté. En cliquant sur les titres des pages dans le fil d'Ariane, vous accédez à l'écran Explorateur de cette page.

source: ![Breadcrumb](../_static/images/navigating/breadcrumb.png "Breadcrumb")
fr: ![ Fil d'Ariane](../_static/images/navigating/breadcrumb.png " Fil d'Ariane ")

source: Breadcrumb
fr: Miette de pain

source: Clicking on the … Actions dropdown shows a list of actions for the parent page, like Move, Copy, Delete, Unpublish, and History. Also, clicking the Sort menu order option from the dropdown takes you to the ordering page.
fr: En cliquant sur le menu déroulant… Actions, vous affichez une liste d'actions pour la page parent, telles que Déplacer, Copier, Supprimer, Dépublier et Historique. De plus, en cliquant sur l’option d’ordre du menu Trier dans la liste déroulante, vous accédez à la page de commande.

source: Search the ClimWeb
fr: Rechercher dans le ClimWeb

source: The search feature is the topmost feature in the Sidebar. You can use the search feature to quickly search for content in the ClimWeb.
fr: La fonction de recherche est la fonctionnalité la plus élevée de la barre latérale. Vous pouvez utiliser la fonction de recherche pour rechercher rapidement du contenu dans le ClimWeb.

source: ![Search](../_static/images/navigating/search.png "Search")
fr: ![Recherche](../_static/images/navigating/search.png "Recherche")

source: Search
fr: Recherche

source: Frequently Asked Questions (FAQs)
fr: Foire aux questions (FAQ)

source: **1. What technologies is the ClimWeb Built on?**
fr: **1. Sur quelles technologies le ClimWeb est-il construit ?**

source: The ClimWeb, along with its various components, is **completely open-source** and developed on the [WMO RAF GitHub account](https://github.com/orgs/wmo-raf). This implies that the institution will have **unrestricted access to the source code**, allowing them to identify and report any bugs, request new features, and even actively contribute to the development of the codebase. This open approach encourages collaboration and fosters a sense of ownership and involvement within the institution.
fr: Le ClimWeb, ainsi que ses différents composants, sont **entièrement open source** et développés sur le [compte GitHub RAF de l'OMM](https://github.com/orgs/wmo-raf). Cela implique que l'institution aura **un accès illimité au code source**, lui permettant d'identifier et de signaler tout bug, de demander de nouvelles fonctionnalités et même de contribuer activement au développement de la base de code. Cette approche ouverte encourage la collaboration et favorise un sentiment d’appropriation et d’implication au sein de l’institution.

source: **2. Who will manage the ClimWeb Content?**
fr: **2. Qui gérera le contenu du ClimWeb ?**

source: The **NMHS installing the ClimWeb and its components will be fully responsible** for inputting and managing the content that goes into the ClimWeb, from their side. This means that they take the instance of the code and run it, without anyone else having access to the operational instance, unless authorized to do so.
fr: Les **NMHS installant le ClimWeb et ses composants seront entièrement responsables** de la saisie et de la gestion du contenu entrant dans le ClimWeb, de leur côté. Cela signifie qu'ils prennent l'instance du code et l'exécutent, sans que personne d'autre n'ait accès à l'instance opérationnelle, sauf autorisation de le faire.

source: **3. What if an NMHS already has a website?**
fr: **3. Que se passe-t-il si un SMHN possède déjà un site Web ?**

source: In cases where an NMHS already has an existing website but is interested in testing the new ClimWeb, they have the option to install and run it **concurrently with their existing system** for a specific duration. This allows them to thoroughly evaluate and experience the functionalities offered by the new ClimWeb. Once the NMHS is satisfied and comfortable with the new ClimWeb, a phased approach can be adopted to gradually transition and fully migrate their website to the new ClimWeb. This ensures a smooth and well-managed transition process.
fr: Dans les cas où un SMHN dispose déjà d'un site Web existant mais souhaite tester le nouveau ClimWeb, il a la possibilité de l'installer et de l'exécuter **simultanément avec son système existant** pendant une durée spécifique. Cela leur permet d’évaluer et d’expérimenter en profondeur les fonctionnalités offertes par le nouveau ClimWeb. Une fois que le SMHN est satisfait et à l’aise avec le nouveau ClimWeb, une approche progressive peut être adoptée pour effectuer progressivement la transition et migrer entièrement son site Web vers le nouveau ClimWeb. Cela garantit un processus de transition fluide et bien géré.

source: **4. What does ‘ClimWeb’ mean?**
fr: **4. Que signifie « ClimWeb » ?**

source: The term ‘ClimWeb’, as used in this document, refers to **all the components** working together to have a running website, more especially on managing the website content. Read more about the ClimWeb Key functionalities https://github.com/wmo-raf/nmhs-cms/wiki
fr: Le terme « ClimWeb », tel qu'utilisé dans ce document, fait référence à **tous les composants** travaillant ensemble pour faire fonctionner un site Web, plus particulièrement sur la gestion du contenu du site Web. En savoir plus sur les fonctionnalités clés du ClimWeb https://github.com/wmo-raf/nmhs-cms/wiki

source: **5. What with NMHSs services that do not have IT people**
fr: **5. Qu’en est-il des services des SMHN qui ne disposent pas de personnel informatique**

source: A fundamental aspect considered during the design and development phase of the ClimWeb was to establish a clear and well-defined system for managing content and page structure. This involved creating a **user-friendly interface with a modern design and intuitive features,** aimed at providing users with a seamless and enjoyable experience. The objective was to enable users to easily locate content and utilize the ClimWeb **without the need for specialized IT skills**.
fr: Un aspect fondamental pris en compte lors de la phase de conception et de développement du ClimWeb était d'établir un système clair et bien défini pour gérer le contenu et la structure des pages. Il s'agissait de créer une **interface conviviale avec un design moderne et des fonctionnalités intuitives**, visant à offrir aux utilisateurs une expérience fluide et agréable. L'objectif était de permettre aux utilisateurs de localiser facilement le contenu et d'utiliser le ClimWeb **sans avoir besoin de compétences informatiques spécialisées**.

source: **6. Security risks?**
fr: **6. Risques de sécurité ?**

source: The ClimWeb, which is being built using open-source technologies, benefits from the advantage of having a community of developers who actively contribute to enhancing its security and stability. Furthermore, the ClimWeb offers robust **support for secure authentication mechanisms**, including username/password authentication, integration with third-party authentication systems such as OAuth, and the ability to implement custom authentication backends. Additionally, the ClimWeb performs **regular backups to safeguard the website's data** and enable its restoration in case of data loss. The NMHS are encouraged to share **only the final products** intended for the public.
fr: Le ClimWeb, construit à l'aide de technologies open source, bénéficie de l'avantage de disposer d'une communauté de développeurs qui contribuent activement à améliorer sa sécurité et sa stabilité. De plus, le ClimWeb offre une **prise en charge robuste des mécanismes d'authentification sécurisés**, y compris l'authentification par nom d'utilisateur/mot de passe, l'intégration avec des systèmes d'authentification tiers tels que OAuth et la possibilité de mettre en œuvre des backends d'authentification personnalisés. De plus, le ClimWeb effectue des **sauvegardes régulières pour sauvegarder les données du site** et permettre leur restauration en cas de perte de données. Les SMHN sont encouragés à partager **uniquement les produits finaux** destinés au public.

source: **7. Where is it hosted?**
fr: **7. Où est-il hébergé ?**

source: The ClimWeb is deployed **at the National Meteorological and Hydrological Service (NMHS) level,** utilising either **cloud-based infrastructure or on-premises servers**. Please refer to the provided **server specifications** for more details on the hosting environment.
fr: Le ClimWeb est déployé **au niveau du Service météorologique et hydrologique national (NMHS),** en utilisant soit **une infrastructure basée sur le cloud, soit des serveurs sur site**. Veuillez vous référer aux **spécifications du serveur** fournies pour plus de détails sur l'environnement d'hébergement.

source: **8. Is WMO RAF managing or handing over completely?**
fr: **8. Le RAF de l’OMM gère-t-il ou cède-t-il complètement le relais ?**

source: The **NMHSs independently manage all components of the ClimWeb in a decentralized manner** at the departmental level. The ClimWeb includes an administrative role (superuser) that possesses complete privileges to access all components of the system. Further information regarding users and roles can be found at (https://github.com/wmo-raf/nmhs-cms/wiki/Manage-Users-and-Roles). It is important to note that WMO RAF does not have involvement in managing the ClimWeb, as its administration and control lie solely with the NMHSs. While WMO RAF does not directly manage the ClimWeb, it does offer valuable support to NMHSs by **providing training and guidance** on the proper management of the ClimWeb. WMO's role is to assist NMHSs in acquiring the necessary knowledge and skills to effectively handle and maintain the ClimWeb. This training and guidance aim to empower NMHSs in utilizing the ClimWeb to its full potential and ensuring optimal performance and functionality.
fr: Les **SMHN gèrent indépendamment toutes les composantes du ClimWeb de manière décentralisée** au niveau départemental. Le ClimWeb comprend un rôle administratif (superutilisateur) qui possède des privilèges complets pour accéder à tous les composants du système. De plus amples informations concernant les utilisateurs et les rôles sont disponibles sur (https://github.com/wmo-raf/nmhs-cms/wiki/Manage-Users-and-Roles). Il est important de noter que le RAF de l’OMM ne participe pas à la gestion de la ClimWeb, car son administration et son contrôle relèvent uniquement des SMHN. Bien que le RAF de l'OMM ne gère pas directement le ClimWeb, il offre un soutien précieux aux SMHN en **fournissant une formation et des conseils** sur la bonne gestion du ClimWeb. Le rôle de l'OMM est d'aider les SMHN à acquérir les connaissances et les compétences nécessaires pour gérer et entretenir efficacement le ClimWeb. Cette formation et ces conseils visent à permettre aux SMHN d'utiliser le ClimWeb à son plein potentiel et d'assurer des performances et des fonctionnalités optimales.

source: **9. Training and capacity building: how will it be done?**
fr: **9. Formation et renforcement des capacités : comment cela se fera-t-il ?**

source: WMO RAF will conduct training sessions for the ClimWeb, which can be arranged in **either face-to-face or online formats**. Comprehensive **training materials**, including user guides (https://github.com/wmo-raf/nmhs-cms/wiki) and developer guides (https://github.com/wmo-raf/nmhs-cms), are also available. The training sessions will be specifically targeted towards designated **departmental focal points **responsible for each component of the ClimWeb. This approach ensures that the training is tailored to meet the specific needs and roles within the NMHS, enabling efficient knowledge transfer and effective utilization of the ClimWeb.
fr: L'OMM RAF organisera des sessions de formation pour le ClimWeb, qui pourront être organisées **en présentiel ou en ligne**. **Matériels de formation** complets, y compris des guides d'utilisation (https://github.com/wmo-raf/nmhs-cms/wiki) et des guides de développement (https://github.com/wmo-raf/nmhs-cms) , sont également disponibles. Les sessions de formation seront spécifiquement destinées aux **points focaux départementaux **désignés responsables de chaque composante du ClimWeb. Cette approche garantit que la formation est adaptée aux besoins et aux rôles spécifiques au sein du SMHN, permettant ainsi un transfert de connaissances efficace et une utilisation efficace du ClimWeb.

source: **10. What about NMHS that want to migrate their website? What provision for migration?**
fr: **dix. Qu’en est-il des SMHN qui souhaitent migrer leur site Web ? Quelle disposition pour la migration ?**
