Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: Add Daily Weather Summary
fr: Ajouter un résumé météo quotidien

source: ![Daily Weather Explorer](../_static/images/city_forecasts/daily_weather_explorer.png "Daily Weather Explorer")
fr: ![Explorateur météo quotidien](../_static/images/city_forecasts/daily_weather_explorer.png "Explorateur météo quotidien")

source: Daily Weather Explorer
fr: Explorateur météo quotidien

source: ![Daily Weather](../_static/images/city_forecasts/daily_weather.png "Daily Weather")
fr: ![Météo quotidienne](../_static/images/city_forecasts/daily_weather.png "Météo quotidienne")

source: Daily Weather
fr: Météo quotidienne

source: Additionally, a daily weather summary containing descriptive information about the observed conditions, weather forecast and extreme station readings is also provided. A preview of this information would appear as below on the website:
fr: De plus, un résumé météorologique quotidien contenant des informations descriptives sur les conditions observées, les prévisions météorologiques et les relevés extrêmes des stations est également fourni. Un aperçu de ces informations apparaîtrait comme ci-dessous sur le site Web :

source: ![Daily Weather Preview](../_static/images/city_forecasts/daily_weather_preview.png "Daily Weather Preview")
fr: ![Aperçu météo quotidien](../_static/images/city_forecasts/daily_weather_preview.png "Aperçu météo quotidien")

source: Daily Weather Preview
fr: Aperçu météo quotidien

source: Fetching from an external source
fr: Récupération à partir d'une source externe

source: To enable automated fetching of city forecasts from an external source i.e YR Meteo Norway's location forecast API https://developer.yr.no/featured-products/forecast/, this option needs to be set to true.
fr: Pour activer la récupération automatisée des prévisions urbaines à partir d'une source externe, c'est-à-dire l'API de prévision de localisation de YR Meteo Norvège https://developer.yr.no/featured-products/forecast/, cette option doit être définie sur true.

source: The forecast will be fetched every three hours and get updated accordingly.
fr: Les prévisions seront récupérées toutes les trois heures et mises à jour en conséquence.

source: AutoForecast
fr: Prévision automatique

source: Mapviewer
fr: Visionneuse de cartes

source: ![Organisation page](../_static/images/mapviewer/mapviewer.png "Organisation page")
fr: ![Page de l'organisation](../_static/images/mapviewer/mapviewer.png "Page de l'organisation")

source: Organisation page
fr: Page de l'organisation

source: You can control access to specific sets of images and documents by setting up collections. By default, all images and documents belong to the root collection, but users with appropriate permissions can create new collections from the Collections interface. Go to Settings > Collections from the Wagtail Sidebar to access the Collections interface.
fr: Vous pouvez contrôler l'accès à des ensembles spécifiques d'images et de documents en configurant des collections. Par défaut, toutes les images et tous les documents appartiennent à la collection racine, mais les utilisateurs disposant des autorisations appropriées peuvent créer de nouvelles collections à partir de l'interface Collections. Accédez à Paramètres > Collections depuis la barre latérale Wagtail pour accéder à l'interface des collections.

source: ![Collections Explorer](../../_static/images/collections/collections_explorer.png "Collections Explorer")
fr: ![Explorateur de collections](../../_static/images/collections/collections_explorer.png "Explorateur de collections")

source: Collections Explorer
fr: Explorateur de collections

source: Add a collection
fr: Ajouter une collection

source: To create a collection, click **Add a collection** from the Collections interface. Then enter a name in the **Name** field and select a parent. Click **Create** to complete the creation process.
fr: Pour créer une collection, cliquez sur **Ajouter une collection** dans l'interface Collections. Saisissez ensuite un nom dans le champ **Nom** et sélectionnez un parent. Cliquez sur **Créer** pour terminer le processus de création.

source: ![Add Collections](../../_static/images/collections/add_collection.png "Add Collections")
fr: ![Ajouter des collections](../../_static/images/collections/add_collection.png "Ajouter des collections")

source: Add Collections
fr: Ajouter des collections

source: Add images or documents to a collection
fr: Ajouter des images ou des documents à une collection

source: To add images to a collection, click Images from the Wagtail sidebar and select a collection from the Collections dropdown. Then click Add an image and follow the instructions on the screen.
fr: Pour ajouter des images à une collection, cliquez sur Images dans la barre latérale Wagtail et sélectionnez une collection dans la liste déroulante Collections. Cliquez ensuite sur Ajouter une image et suivez les instructions à l'écran.

source: ![Image to Collections](../../_static/images/collections/image_to_collection.png "Image to Collections")
fr: ![Image vers les collections](../../_static/images/collections/image_to_collection.png "Image vers les collections")

source: Image to Collections
fr: Image vers les collections

source: The process of adding documents to a collection is similar to that of images. Click Documents from the Sidebar and select a collection from the Collections dropdown. Then click Add a document and follow the instructions on the screen.
fr: Le processus d’ajout de documents à une collection est similaire à celui des images. Cliquez sur Documents dans la barre latérale et sélectionnez une collection dans la liste déroulante Collections. Cliquez ensuite sur Ajouter un document et suivez les instructions à l'écran.

source: It's possible to add an image or document to a collection while editing them. To do this, click Images or Documents from the Sidebar and select the image or document you want to add to a collection by clicking it. Then choose a collection from the Collection dropdown in the edit screen.
fr: Il est possible d'ajouter une image ou un document à une collection tout en les éditant. Pour ce faire, cliquez sur Images ou Documents dans la barre latérale et sélectionnez l'image ou le document que vous souhaitez ajouter à une collection en cliquant dessus. Choisissez ensuite une collection dans la liste déroulante Collection de l'écran d'édition.

source: ![Image to Collections](../../_static/images/collections/image_to_collection2.png "Image to Collections")
fr: ![Image vers les collections](../../_static/images/collections/image_to_collection2.png "Image vers les collections")

source: You can also select a collection as part of uploading multiple images or documents.
fr: Vous pouvez également sélectionner une collection dans le cadre du téléchargement de plusieurs images ou documents.

source: Privacy settings
fr: Paramètres de confidentialité

source: To set permissions to determine who is able to view documents within a collection, go to **Settings > Collections** and select a collection. Then click **Privacy** preceding the collection name.
fr: Pour définir des autorisations afin de déterminer qui peut afficher les documents d'une collection, accédez à **Paramètres > Collections** et sélectionnez une collection. Cliquez ensuite sur **Confidentialité** précédant le nom de la collection.

source: ![Collection Privacy](../../_static/images/collections/collection_privacy.png "Collection Privacy")
fr: ![Confidentialité des collections](../../_static/images/collections/collection_privacy.png "Confidentialité des collections")

source: Collection Privacy
fr: Confidentialité des collections

source: Clicking Privacy gives you a pop-up modal from which you can select the level of privacy for the collection.
fr: En cliquant sur Confidentialité, vous obtenez une fenêtre contextuelle à partir de laquelle vous pouvez sélectionner le niveau de confidentialité de la collection.

source: ![Collection Privacy Options](../../_static/images/collections/collection_privacy_options.png "Collection Privacy Options")
fr: ![Options de confidentialité des collections](../../_static/images/collections/collection_privacy_options.png "Options de confidentialité des collections")

source: Collection Privacy Options
fr: Options de confidentialité des collections

source: The permissions set on a collection apply to that collection and all collections below it in the hierarchy. Therefore, if you make the root collection private, all documents on the site become private. Permissions set in other collections only apply to those collections.
fr: Les autorisations définies sur une collection s'appliquent à cette collection et à toutes les collections situées en dessous dans la hiérarchie. Par conséquent, si vous rendez la collection racine privée, tous les documents du site deviennent privés. Les autorisations définies dans d’autres collections s’appliquent uniquement à ces collections.

source: Privacy settings added to a collection are only enforced for documents within the collection. Privacy settings do not apply to images.
fr: Les paramètres de confidentialité ajoutés à une collection ne sont appliqués que pour les documents de la collection. Les paramètres de confidentialité ne s'appliquent pas aux images.

source: You can manage documents such as PDF files from the Documents interface. To access the Documents interface, click Documents in the Sidebar. This interface allows you to add documents to and remove documents from the Admin interface.
fr: Vous pouvez gérer des documents tels que des fichiers PDF à partir de l'interface Documents. Pour accéder à l'interface Documents, cliquez sur Documents dans la barre latérale. Cette interface vous permet d'ajouter et de supprimer des documents de l'interface d'administration.

source: ![Manage Documents](../../_static/images/documents/manage_documents.png "Manage Documents")
fr: ![Gérer les documents](../../_static/images/documents/manage_documents.png "Gérer les documents")

source: Manage Documents
fr: Gérer les documents

source: Add documents by clicking Add documents at the top right of the documents interface. Search for previously added documents by entering the title of the document in the search bar. The results automatically update as you type. You can also filter the results by Collection by selecting a collection from the Collection dropdown preceding the documents list.
fr: Ajoutez des documents en cliquant sur Ajouter des documents en haut à droite de l'interface des documents. Recherchez les documents précédemment ajoutés en saisissant le titre du document dans la barre de recherche. Les résultats sont automatiquement mis à jour au fur et à mesure que vous tapez. Vous pouvez également filtrer les résultats par collection en sélectionnant une collection dans la liste déroulante Collection précédant la liste des documents.

source: ![Select Documents](../../_static/images/documents/select_documents.png "Select Documents")
fr: ![Sélectionner des documents](../../_static/images/documents/select_documents.png "Sélectionner des documents")

source: Select Documents
fr: Sélectionnez des documents

source: Select multiple documents by clicking the checkbox on the left side of each document, then use the bulk actions bar at the bottom to perform an action on all selected documents.
fr: Sélectionnez plusieurs documents en cliquant sur la case à cocher sur le côté gauche de chaque document, puis utilisez la barre d'actions groupées en bas pour effectuer une action sur tous les documents sélectionnés.

source: If you want to edit a document, click the title of the document. Doing this takes you to the edit screen.
fr: Si vous souhaitez modifier un document, cliquez sur le titre du document. Cela vous amène à l’écran d’édition.

source: ![Edit Documents](../../_static/images/documents/edit_document.png "Edit Documents")
fr: ![Modifier les documents](../../_static/images/documents/edit_document.png "Modifier les documents")

source: Edit Documents
fr: Modifier des documents

source: When editing a document, you can replace the file associated with that document record. This means you can update documents without having to update the pages they're on. Changing the file changes it on all pages that use the document. You can also change the collection of the document by clicking on the Collection dropdown on the edit page and selecting a new collection of your choice. Add or remove tags using the Tags field on the edit screen. Once you are done editing a document, save your edits by clicking Save at the bottom of the edit screen.
fr: Lors de la modification d'un document, vous pouvez remplacer le fichier associé à cet enregistrement de document. Cela signifie que vous pouvez mettre à jour les documents sans avoir à mettre à jour les pages sur lesquelles ils se trouvent. La modification du fichier le modifie sur toutes les pages qui utilisent le document. Vous pouvez également modifier la collection du document en cliquant sur le menu déroulant Collection sur la page d'édition et en sélectionnant une nouvelle collection de votre choix. Ajoutez ou supprimez des balises à l’aide du champ Balises sur l’écran d’édition. Une fois que vous avez terminé de modifier un document, enregistrez vos modifications en cliquant sur Enregistrer en bas de l'écran d'édition.

source: To completely delete a document and its record, select the document by clicking the checkbox at the left-hand side of the document record row in the Documents interface. Then click Delete from the action bar displayed at the bottom of the Documents interface.
fr: Pour supprimer complètement un document et son enregistrement, sélectionnez le document en cochant la case située à gauche de la ligne d'enregistrement du document dans l'interface Documents. Cliquez ensuite sur Supprimer dans la barre d'action affichée en bas de l'interface Documents.

source: ![Delete Documents](../../_static/images/documents/delete_document.png "Delete Documents")
fr: ![Supprimer les documents](../../_static/images/documents/delete_document.png "Supprimer les documents")

source: Delete Documents
fr: Supprimer des documents

source: You can also delete a document and its record from the edit screen when editing a document by clicking Delete document at the bottom of the edit screen.
fr: Vous pouvez également supprimer un document et son enregistrement de l'écran d'édition lors de l'édition d'un document en cliquant sur Supprimer le document en bas de l'écran d'édition.

source: Deleted documents cannot be recovered.
fr: Les documents supprimés ne peuvent pas être récupérés.

source: Forms
fr: Formes

source: Add, edit, and remove images
fr: Ajouter, modifier et supprimer des images

source: If you want to edit, add, or remove images from the Admin interface outside of the individual pages, you can do so from the Images interface. To access the Images interface, click Images in the Sidebar.
fr: Si vous souhaitez modifier, ajouter ou supprimer des images de l'interface d'administration en dehors des pages individuelles, vous pouvez le faire depuis l'interface Images. Pour accéder à l'interface Images, cliquez sur Images dans la barre latérale.

source: ![Manage Images](../../_static/images/icons_and_images/manage_images.png "Manage Images")
fr: ![Gérer les images](../../_static/images/icons_and_images/manage_images.png "Gérer les images")

source: Manage Images
fr: Gérer les images

source: It is possible to select multiple images from the Images interface at once. To do this, select the checkbox on the top left of each image block, then use the bulk actions bar at the bottom to perform an action on all selected images.
fr: Il est possible de sélectionner plusieurs images à partir de l'interface Images à la fois. Pour ce faire, cochez la case en haut à gauche de chaque bloc d'image, puis utilisez la barre d'actions groupées en bas pour effectuer une action sur toutes les images sélectionnées.

source: ![Select Images](../../_static/images/icons_and_images/select_images.png "Select Images")
fr: ![Sélectionner des images](../../_static/images/icons_and_images/select_images.png "Sélectionner des images")

source: Select Images
fr: Sélectionnez des images

source: Also, the ClimWeb allows you to edit the data associated with an image by clicking on the image to access its edit screen. Image data includes the title, the file, the collection associated with it, the associated tags, and the focal area.
fr: De plus, le ClimWeb permet de modifier les données associées à une image en cliquant sur l'image pour accéder à son écran d'édition. Les données d'image incluent le titre, le fichier, la collection qui lui est associée, les balises associées et la zone focale.

source: Changing the image file when editing an image updates the image without updating the pages on which it appears.
fr: La modification du fichier image lors de l'édition d'une image met à jour l'image sans mettre à jour les pages sur lesquelles elle apparaît.

source: ![Edit Images](../../_static/images/icons_and_images/edit_image.png "Edit Images")
fr: ![Modifier les images](../../_static/images/icons_and_images/edit_image.png "Modifier les images")

source: Edit Images
fr: Modifier les images

source: Changing the file will change it on all pages that use the image.
fr: Changer le fichier le changera sur toutes les pages qui utilisent l'image.

source: Set the focal area of an image
fr: Définir la zone focale d'une image

source: The Images interface allows you to set a focal area, which can affect how your image displays to visitors on the front end. If you crop your images in some way to make them fit into a specific shape, then the focal area defines the centre point from which you crop the images.
fr: L'interface Images vous permet de définir une zone focale, qui peut affecter la façon dont votre image s'affiche aux visiteurs sur le front-end. Si vous recadrez vos images d'une manière ou d'une autre pour les adapter à une forme spécifique, la zone focale définit le point central à partir duquel vous recadrez les images.

source: You can set the focal area of an image by clicking the image to access its edit screen. Then drag a marquee around the most significant element of the image, and then click Save to save it. Once you set the focal area of an image and save it, you can see the most significant element of the image on the front end.
fr: Vous pouvez définir la zone focale d'une image en cliquant sur l'image pour accéder à son écran d'édition. Faites ensuite glisser un rectangle de sélection autour de l'élément le plus significatif de l'image, puis cliquez sur Enregistrer pour l'enregistrer. Une fois que vous avez défini la zone focale d'une image et l'avez enregistrée, vous pouvez voir l'élément le plus important de l'image sur le devant.

source: To remove the focal area, click Remove focal area in the edit screen.
fr: Pour supprimer la zone focale, cliquez sur Supprimer la zone focale dans l'écran d'édition.

source: Snippets
fr: Extraits

source: Using Snippets
fr: Utiliser des extraits

source: Snippets allow you to create elements on a website once and reuse them in multiple places. You only have to change something in a snippet once, and the changes appear in all occurrences.
fr: Les extraits vous permettent de créer des éléments sur un site Web une seule fois et de les réutiliser à plusieurs endroits. Vous ne devez modifier quelque chose dans un extrait qu'une seule fois, et les modifications apparaissent dans toutes les occurrences.

source: The use of snippets varies between websites. Wagtail developers use snippets for the following purposes:
fr: L’utilisation d’extraits varie selon les sites Web. Les développeurs de Wagtail utilisent des extraits de code aux fins suivantes :

source: For blog post authors. As a result, you can add them to multiple pages and manage them from one place. For adverts. This way, you can apply them site-wide or on individual pages. To manage links in a global area of the site. For example, in the footer. For calls to action, such as newsletter sign-up blocks, that may be consistent across many different pages.
fr: Pour les auteurs d’articles de blog. En conséquence, vous pouvez les ajouter à plusieurs pages et les gérer à partir d’un seul endroit. Pour les publicités. De cette façon, vous pouvez les appliquer à l’ensemble du site ou sur des pages individuelles. Gérer les liens dans une zone globale du site. Par exemple, dans le pied de page. Pour les appels à l’action, tels que les blocages d’inscription à la newsletter, qui peuvent être cohérents sur de nombreuses pages différentes.

source: The Snippets Menu
fr: Le menu des extraits

source: You can access the snippets by clicking **Snippets** in the Sidebar. Clicking **Snippets** takes you to the Snippets interface. To add, edit, or delete a snippet, click the snippet type that interests you. Clicking the snippet type takes you to the edit screen, from which you can add, edit, or delete a snippet. Hovering over an individual snippet displays the options to edit or delete that snippet. To add a new snippet to the snippet type, click **Add (snippet type)**.
fr: Vous pouvez accéder aux extraits en cliquant sur **Extraits** dans la barre latérale. En cliquant sur **Snippets**, vous accédez à l'interface Snippets. Pour ajouter, modifier ou supprimer un extrait, cliquez sur le type d'extrait qui vous intéresse. En cliquant sur le type d'extrait, vous accédez à l'écran d'édition, à partir duquel vous pouvez ajouter, modifier ou supprimer un extrait. Le survol d'un extrait individuel affiche les options permettant de modifier ou de supprimer cet extrait. Pour ajouter un nouvel extrait au type d'extrait, cliquez sur **Ajouter (type d'extrait)**.

source: ![Snippet Explorer](../../_static/images/snippets/snippet_explorer.png "Snippet Explorer")
fr: ![Explorateur d'extraits](../../_static/images/snippets/snippet_explorer.png "Explorateur d'extraits")

source: Snippet Explorer
fr: Explorateur d'extraits

source: Editing a snippet changes it on all of the pages on which it appears. In the top-right corner of the Snippet edit screen, you can see a label saying how many times you have used the snippet. Clicking this label displays a listing of all of these pages.
fr: La modification d'un extrait le modifie sur toutes les pages sur lesquelles il apparaît. Dans le coin supérieur droit de l’écran d’édition de l’extrait, vous pouvez voir une étiquette indiquant combien de fois vous avez utilisé l’extrait. En cliquant sur cette étiquette, vous affichez une liste de toutes ces pages.

source: Add snippets while editing a page
fr: Ajouter des extraits lors de la modification d'une page

source: Open the Snippets interface in a new tab while editing the page by pressing Ctrl+click in Windows or cmd+click in macOS. You can also open a new tab by right-clicking it and then selecting the Open in new tab option. Add the new snippet from this new tab as you normally would. Then return to your existing tab and reopen the Snippet chooser window by clicking Snippets from the Sidebar.
fr: Ouvrez l'interface Snippets dans un nouvel onglet lors de la modification de la page en appuyant sur Ctrl+clic sous Windows ou cmd+clic sous macOS. Vous pouvez également ouvrir un nouvel onglet en cliquant dessus avec le bouton droit, puis en sélectionnant l'option Ouvrir dans un nouvel onglet. Ajoutez le nouvel extrait de ce nouvel onglet comme vous le feriez normalement. Revenez ensuite à votre onglet existant et rouvrez la fenêtre de sélection d'extraits de code en cliquant sur Extraits dans la barre latérale.

source: Congratulation, you can now see your new snippet, even though you didn’t leave the edit page.
fr: Félicitations, vous pouvez désormais voir votre nouvel extrait, même si vous n'avez pas quitté la page d'édition.
