Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: On the page's history screen, you can see all the actions previously done on that particular page and the users that carried out the actions. Also, you can see the date or time that the action occurred.
fr: Sur l'écran d'historique de la page, vous pouvez voir toutes les actions précédemment effectuées sur cette page particulière et les utilisateurs qui ont effectué les actions. Vous pouvez également voir la date ou l’heure à laquelle l’action s’est produite.

source: You can also search for specific versions of your content on the page history screen by applying a filter.
fr: Vous pouvez également rechercher des versions spécifiques de votre contenu sur l'écran de l'historique des pages en appliquant un filtre.

source: ![View History](../../_static/images/pages/view_page_history.png "View Page History")
fr: ![Afficher l'historique](../../_static/images/pages/view_page_history.png "Afficher l'historique des pages")

source: View History
fr: Voir l'historique

source: If you want to compare different draft versions, hover over the draft and click Compare with previous version or Compare with current version.
fr: Si vous souhaitez comparer différentes versions brouillon, passez la souris sur le brouillon et cliquez sur Comparer avec la version précédente ou Comparer avec la version actuelle.

source: To replace the current version of the draft with a previous version, hover over the preferred version of your draft on the page history screen and click Review this version. Then click Replace current version located at the bottom of the screen. This action appears as a Revert action on the page history screen and you can always go back to review it.
fr: Pour remplacer la version actuelle du brouillon par une version précédente, survolez la version préférée de votre brouillon sur l'écran de l'historique de la page et cliquez sur Vérifier cette version. Cliquez ensuite sur Remplacer la version actuelle situé en bas de l'écran. Cette action apparaît comme une action Revenir sur l'écran de l'historique de la page et vous pouvez toujours revenir en arrière pour la consulter.

source: ![Review Page Version](../../_static/images/pages/review_page_version.png "Review Page Version")
fr: ![Version de la page de révision](../../_static/images/pages/review_page_version.png "Version de la page de révision")

source: Review Page Version
fr: Version de la page de révision

source: Workflow
fr: Flux de travail

source: If the page is currently in a workflow, then you can see an additional indicator underneath the title showing the current workflow task. Clicking this shows more information about the page's progress through the workflow and any comments left by reviewers.
fr: Si la page est actuellement dans un workflow, vous pouvez voir un indicateur supplémentaire sous le titre indiquant la tâche de workflow en cours. Cliquez dessus pour afficher plus d'informations sur la progression de la page dans le flux de travail et sur les commentaires laissés par les réviseurs.

source: If you have permission to perform moderation actions, for example, approval or requesting changes on the current task. In that case, you can see additional options in the action bar at the bottom of the page
fr: Si vous êtes autorisé à effectuer des actions de modération, par exemple une approbation ou une demande de modifications sur la tâche en cours. Dans ce cas, vous pouvez voir des options supplémentaires dans la barre d'action en bas de la page.

source: Copy pages
fr: Copier des pages

source: Sometimes, you don't need to create a new page from scratch. For example, you may have several pages that are similar in terms of structure but differ in content. In that case, you can copy an existing page and only change the required parts.
fr: Parfois, vous n’avez pas besoin de créer une nouvelle page à partir de zéro. Par exemple, vous pouvez avoir plusieurs pages similaires en termes de structure mais différentes en termes de contenu. Dans ce cas, vous pouvez copier une page existante et modifier uniquement les parties requises.

source: ![Copy Page](../../_static/images/pages/copy_page.png "Copy Page")
fr: ![Copier la page](../../_static/images/pages/copy_page.png "Copier la page")

source: Copy Page
fr: Copier la page

source: To copy an existing page, hover over a page in an Explorer page, then click More and select Copy. Selecting Copy from the dropdown takes you to a form where you can enter the title and slug of the copy and also choose its parent page. You then get the option to publish the copy right away and an option to mark the copy as an alias of the original page. Once you have completed the form, click Copy this page.
fr: Pour copier une page existante, passez la souris sur une page dans une page de l'Explorateur, puis cliquez sur Plus et sélectionnez Copier. En sélectionnant Copier dans la liste déroulante, vous accédez à un formulaire dans lequel vous pouvez saisir le titre et le slug de la copie et également choisir sa page parent. Vous avez alors la possibilité de publier la copie immédiatement et une option pour marquer la copie comme alias de la page originale. Une fois que vous avez rempli le formulaire, cliquez sur Copier cette page.

source: ![Copy Page](../../_static/images/pages/copy_page_2.png "Copy Page")
fr: ![Copier la page](../../_static/images/pages/copy_page_2.png "Copier la page")

source: Congratulations, you just copied a page. You can now find your copied page on the Explorer page.
fr: Félicitations, vous venez de copier une page. Vous pouvez maintenant retrouver votre page copiée sur la page Explorateur.

source: Alias pages
fr: Pages d'alias

source: When copying a page, you have the option to mark it as an alias. The content of an aliased page always stays in sync with the original.
fr: Lors de la copie d'une page, vous avez la possibilité de la marquer comme alias. Le contenu d'une page avec un alias reste toujours synchronisé avec l'original.

source: This is useful when you want a page to be available in multiple places. For example, if you have a page about Publications as a child page of Home, and you want to make the Publications page available in the Pastries section.
fr: Ceci est utile lorsque vous souhaitez qu'une page soit disponible à plusieurs endroits. Par exemple, si vous avez une page sur les Publications comme page enfant de l'Accueil, et que vous souhaitez rendre la page Publications disponible dans la section Pâtisseries.

source: Creating an alias for an existing page is similar to creating a copy. Hover over a page in the Explorer page, click More, and then select Copy. Selecting Copy takes you to the copy page form. On the copy page form, choose another page as the parent page by clicking Choose another page.
fr: La création d'un alias pour une page existante est similaire à la création d'une copie. Passez la souris sur une page de la page Explorateur, cliquez sur Plus, puis sélectionnez Copier. La sélection de Copier vous amène au formulaire de page de copie. Sur le formulaire de copie de page, choisissez une autre page comme page parent en cliquant sur Choisir une autre page.

source: Then, click the Alias checkbox and click Copy this page to complete the aliasing.
fr: Ensuite, cochez la case Alias ​​et cliquez sur Copier cette page pour terminer l'alias.

source: ![Alias Page](../../_static/images/pages/alias_page.png "Alias Page")
fr: ![Page Alias](../../_static/images/pages/alias_page.png "Page Alias")

source: Alias Page
fr: Page d'alias

source: Congratulations, you just aliased a page. You can now find your aliased page on the Explorer page of the parent page.
fr: Félicitations, vous venez d'aliaser une page. Vous pouvez maintenant trouver votre page alias sur la page Explorateur de la page parent.

source: If you try to edit the aliased page, you get a notification that it's an alias of another page. To edit an aliased page, you have two options:
fr: Si vous essayez de modifier la page avec un alias, vous recevez une notification indiquant qu'il s'agit d'un alias d'une autre page. Pour modifier une page avec un alias, vous disposez de deux options :

source: Edit the original page. This option changes both the original page and the aliased page.
fr: Modifiez la page d'origine. Cette option modifie à la fois la page d'origine et la page alias.

source: Convert the alias page to an ordinary page, which is a copy of the original. If you choose this option, you must make manual changes to the alias page in order for it to be in sync with the original page.
fr: Convertissez la page d'alias en une page ordinaire, qui est une copie de l'original. Si vous choisissez cette option, vous devez apporter des modifications manuelles à la page d'alias afin qu'elle soit synchronisée avec la page d'origine.

source: About Page
fr: À propos de la page

source: Create an About Page
fr: Créer une page À propos

source: The creation of this page assumes you have already created an organisation index page which is the parent page of this page. To create an organisation index page, please refer to [Managing Organisation Page](./Manage-Organisation).
fr: La création de cette page suppose que vous ayez déjà créé une page d'index d'organisation qui est la page parent de cette page. Pour créer une page d'index d'organisation, veuillez vous référer à [Page de gestion de l'organisation] (./Manage-Organisation).

source: To create an about page, navigate to organisation page and create a child page from it selecting the about page.
fr: Pour créer une page à propos, accédez à la page de l'organisation et créez une page enfant à partir de celle-ci en sélectionnant la page à propos.

source: ![About page](../../../_static/images/about/add_about_page.png "About page")
fr: ![Page À propos](../../../_static/images/about/add_about_page.png "Page À propos")

source: About page
fr: À propos de la page

source: ![About page](../../../_static/images/about/select_about_page.png "About page")
fr: ![Page À propos](../../../_static/images/about/select_about_page.png "Page À propos")

source: The About page is divided into various sections.
fr: La page À propos est divisée en plusieurs sections.

source: ![About page](../../../_static/images/about/about_sections.png "About page")
fr: ![Page À propos](../../../_static/images/about/about_sections.png "Page À propos")

source: The sections include:
fr: Les rubriques comprennent :

source: **Banner Section** - this contains the banner image, title, subtitle and call to action button. If no banner image is provided then this section will not be displayed
fr: **Section bannière** : elle contient l'image de la bannière, le titre, le sous-titre et le bouton d'appel à l'action. Si aucune image de bannière n'est fournie, cette section ne sera pas affichée

source: ![Banner Sections](../../../_static/images/about/banner_section.png "Banner Sections")
fr: ![Sections de bannière](../../../_static/images/about/banner_section.png "Sections de bannière")

source: ![Introduction Sections](../../../_static/images/about/introduction_section.png "Introduction Sections")
fr: ![Sections d'introduction](../../../_static/images/about/introduction_section.png "Sections d'introduction")

source: **Mission and Vision Section** - this is the organisation's mission and vision
fr: **Section Mission et Vision** - c'est la mission et la vision de l'organisation

source: ![Mission & Vision Sections](../../../_static/images/about/mission_vision_section.png "Mission & Vision Sections")
fr: ![Sections Mission et Vision](../../../_static/images/about/mission_vision_section.png "Sections Mission et Vision")

source: Mission & Vision Sections
fr: Sections Mission et Vision

source: **Organisation Structure Section** - this contains a heading description and image of the organisational structure.
fr: **Section Structure organisationnelle** - elle contient une description du titre et une image de la structure organisationnelle.

source: ![Organisation Structure Sections](../../../_static/images/about/organisation_structure_section.png "Organisation Structure Sections")
fr: ![Sections de la structure de l'organisation](../../../_static/images/about/organisation_structure_section.png "Sections de la structure de l'organisation")

source: Organisation Structure Sections
fr: Sections de la structure organisationnelle

source: **Historical Timeline Section** - the historical timeline section allows for narration of the history of the organisation grouping the milestones on an yearly basis.
fr: **Section Chronologie historique** - la section chronologie historique permet de raconter l'histoire de l'organisation en regroupant les jalons sur une base annuelle.

source: ![Historical Timeline Sections](../../../_static/images/about/history_timeline_section.png "Historical Timeline Sections")
fr: ![Sections de la chronologie historique](../../../_static/images/about/history_timeline_section.png "Sections de la chronologie historique")

source: Historical Timeline Sections
fr: Sections de la chronologie historique

source: **Additional Materials** - any additional material including documents or images relating to the organisation can be added here for download.
fr: **Matériaux supplémentaires** - tout matériel supplémentaire, y compris des documents ou des images relatifs à l'organisation, peut être ajouté ici pour téléchargement.

source: ![Additional Materials](../../../_static/images/about/additional_material.png "Additional Materials")
fr: ![Matériaux supplémentaires](../../../_static/images/about/additional_material.png "Matériaux supplémentaires")

source: Additional Materials
fr: Matériaux additionnels

source: ![Feature Block Sections](../../../_static/images/services/feature_block_section.png "Projects Sections")
fr: ![Sections des blocs de fonctionnalités](../../../_static/images/services/feature_block_section.png "Sections de projets")

source: **Bottom Call to action Section** - call to action button at the bottom of the page.
fr: **Section d'appel à l'action inférieure** - bouton d'appel à l'action en bas de la page.

source: ![Bottom CTA Sections](../../../_static/images/about/bottom_cta_section.png "Bottom CTA Sections")
fr: ![Sections CTA inférieures](../../../_static/images/about/bottom_cta_section.png "Sections CTA inférieures")

source: Bottom CTA Sections
fr: Sections CTA inférieures

source: Organisation Pages
fr: Pages d'organisation

source: ![Organisation page](../../../_static/images/organisation/organisation_preview.png "Organisation page")
fr: ![Page Organisation](../../../_static/images/organisation/organisation_preview.png "Page Organisation")

source: The Organisational Index page lists the pages below:
fr: La page Index organisationnel répertorie les pages ci-dessous :

source: To create the overall organisation page that houses the pages above, begin by adding a child page to the home page and selecting 'Organisation Index Page'.
fr: Pour créer la page globale de l'organisation qui héberge les pages ci-dessus, commencez par ajouter une page enfant à la page d'accueil et sélectionnez « Page d'index de l'organisation ».

source: ![Organisation page](../../../_static/images/organisation/add_organisation_page.png "Organisation page")
fr: ![Page Organisation](../../../_static/images/organisation/add_organisation_page.png "Page Organisation")

source: ![Organisation page](../../../_static/images/organisation/select_organisation_page.png "Organisation page")
fr: ![Page Organisation](../../../_static/images/organisation/select_organisation_page.png "Page Organisation")

source: Populate the form with page title and listing heading as below:
fr: Remplissez le formulaire avec le titre de la page et l'en-tête de la liste comme ci-dessous :

source: ![Organisation page](../../../_static/images/organisation/organisation_page.png "Organisation page")
fr: ![Page Organisation](../../../_static/images/organisation/organisation_page.png "Page Organisation")

source: This option will only appear if an 'Organisation Index Page' does not already exist as only one instance of this page is allowed. If it already exists proceed to prepare the other pages listed above.
fr: Cette option n'apparaîtra que si une « Page d'index de l'organisation » n'existe pas déjà, car une seule instance de cette page est autorisée. S'il existe déjà, préparez les autres pages répertoriées ci-dessus.

source: Partners Page
fr: Page Partenaires

source: The steps to create a partners page are:
fr: Les étapes pour créer une page partenaires sont :

source: Create a list of partners
fr: Créer une liste de partenaires

source: Create a partners page
fr: Créer une page partenaires

source: 1. Create a list of partners
fr: 1. Créez une liste de partenaires

source: To list partners begin by accessing the partners menu from snippets as shown below.
fr: Pour répertorier les partenaires, commencez par accéder au menu des partenaires à partir d'extraits, comme indiqué ci-dessous.

source: ![List Partners](../../../_static/images/partners/partners_explorer.png "List Partners")
fr: ![Liste des partenaires](../../../_static/images/partners/partners_explorer.png "Liste des partenaires")

source: List Partners
fr: Liste des partenaires

source: Click on add partners
fr: Cliquez sur ajouter des partenaires

source: ![Add Partners](../../../_static/images/partners/add_partner.png "Add Partners")
fr: ![Ajouter des partenaires](../../../_static/images/partners/add_partner.png "Ajouter des partenaires")

source: Add Partners
fr: Ajouter des partenaires

source: Provide the partner name, logo, link to website and any other relevant info in the form.
fr: Fournissez le nom du partenaire, le logo, le lien vers le site Web et toute autre information pertinente dans le formulaire.

source: ![Partners](../../../_static/images/partners/partner.png "Partners")
fr: ![Partenaires](../../../_static/images/partners/partner.png "Partenaires")

source: Partners
fr: Les partenaires

source: Repeat this process to list more partners
fr: Répétez ce processus pour répertorier plus de partenaires

source: 2. Create a partners page
fr: 2. Créez une page partenaires

source: To create a partner page, navigate to organisation page and create a child page from it selecting the about page.
fr: Pour créer une page partenaire, accédez à la page de l'organisation et créez une page enfant à partir de celle-ci en sélectionnant la page À propos.

source: ![Partner page](../../../_static/images/partners/add_partner_page.png "Partner page")
fr: ![Page partenaire](../../../_static/images/partners/add_partner_page.png "Page partenaire")

source: Partner page
fr: Page partenaire

source: The Partners page contains the sections below:
fr: La page Partenaires contient les sections ci-dessous :

source: ![Partner page](../../../_static/images/partners/partner_sections.png "Partner page")
fr: ![Page partenaire](../../../_static/images/partners/partner_sections.png "Page partenaire")

source: ![Banner Sections](../../../_static/images/partners/banner_section.png "Banner Sections")
fr: ![Sections de bannière](../../../_static/images/partners/banner_section.png "Sections de bannière")

source: ![Introduction Sections](../../../_static/images/partners/introduction_section.png "Introduction Sections")
fr: ![Sections d'introduction](../../../_static/images/partners/introduction_section.png "Sections d'introduction")

source: **Partners Call to Action Section**
fr: **Section Appel à l'action des partenaires**

source: ![Partner CTA Sections](../../../_static/images/partners/partner_cta.png "Partner CTA Sections")
fr: ![Sections CTA partenaires](../../../_static/images/partners/partner_cta.png "Sections CTA partenaires")

source: Partner CTA Sections
fr: Sections CTA partenaires

source: All listed partners in step 1 will be displayed automatically on the partners page.
fr: Tous les partenaires répertoriés à l'étape 1 seront affichés automatiquement sur la page des partenaires.

source: Projects
fr: Projets

source: Tenders
fr: Appels d'offres

source: Vacancies
fr: Postes vacants

source: Workflows
fr: Flux de travail

source: About workflows
fr: À propos des flux de travail

source: Workflows allow you to configure how moderation works on your site. Workflows are sequences of tasks that require approval before completion. A completed workflow usually results in the publication of a page, depending on your website's settings.
fr: Les workflows vous permettent de configurer le fonctionnement de la modération sur votre site. Les workflows sont des séquences de tâches qui nécessitent une approbation avant d'être terminées. Un flux de travail terminé aboutit généralement à la publication d'une page, en fonction des paramètres de votre site Web.

source: To access the Workflow interface, go to **Settings > Workflows** from the left Sidebar.
fr: Pour accéder à l'interface Workflow, accédez à **Paramètres > Workflows** dans la barre latérale gauche.

source: ![Worklow explorer](../../_static/images/workflows/workflow_explorer.png "Worklow explorer")
fr: ![Explorateur Worklow](../../_static/images/workflows/workflow_explorer.png "Explorateur Worklow")

source: Worklow explorer
fr: Explorateur de workflow

source: From the Workflow interface, you can see all of the workflows on your site and the order of tasks in each. To create a new workflow, click Add a workflow from the Workflow interface.
fr: Depuis l'interface Workflow, vous pouvez voir tous les workflows de votre site et l'ordre des tâches dans chacun. Pour créer un nouveau workflow, cliquez sur Ajouter un workflow depuis l'interface Workflow.

source: Furthermore, the Workflow interface shows how many pages each workflow covers. If you click the number of pages, you can see a list of all the pages a workflow applies to.
fr: De plus, l'interface Workflow indique le nombre de pages couvertes par chaque workflow. Si vous cliquez sur le nombre de pages, vous pouvez voir une liste de toutes les pages auxquelles un flux de travail s'applique.

source: ![Worklow interface](../../_static/images/workflows/list_workflows.png "Worklow interface")
fr: ![Interface Worklow](../../_static/images/workflows/list_workflows.png "Interface Worklow")

source: Worklow interface
fr: Interface de flux de travail

source: Edit workflows
fr: Modifier les flux de travail

source: In the Workflow interface, click on the name of a workflow to edit it or to assign it to a part of the page tree.
fr: Dans l'interface Workflow, cliquez sur le nom d'un workflow pour le modifier ou l'attribuer à une partie de l'arborescence des pages.

source: Click **Add task** under **Add tasks to your workflow** to add a task. When adding a task to a workflow, you can create a new task or reuse an existing one.
fr: Cliquez sur **Ajouter une tâche** sous **Ajouter des tâches à votre flux de travail** pour ajouter une tâche. Lorsque vous ajoutez une tâche à un workflow, vous pouvez créer une nouvelle tâche ou réutiliser une tâche existante.

source: To change a task in the workflow, hover over the task under **Add tasks to your workflow** and select **Choose another task** from the pop-up options.
fr: Pour modifier une tâche dans le flux de travail, passez la souris sur la tâche sous **Ajouter des tâches à votre flux de travail** et sélectionnez **Choisir une autre tâche** dans les options contextuelles.

source: You can also reorder tasks in a workflow by hovering over a task under the **Add tasks to your workflow** and then clicking the up and down arrow.
fr: Vous pouvez également réorganiser les tâches dans un flux de travail en survolant une tâche sous **Ajouter des tâches à votre flux de travail**, puis en cliquant sur les flèches haut et bas.
