Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: Even though this is possible, it is advisable to save your page as a draft as often as possible. This prevents you from accidentally exiting the edit page and losing your changes.
fr: Même si cela est possible, il est conseillé de sauvegarder votre page en tant que brouillon aussi souvent que possible. Cela vous évite de quitter accidentellement la page d'édition et de perdre vos modifications.

source: Surveys
fr: Enquêtes

source: Using Surveys
fr: Utiliser des enquêtes

source: Surveys allow you to create a dynamic survey forms, create/modify survey structure, display and analyse survey results and save as PDF Document. With the survey editor it is possible to define conditional logic and answer validation for form fields.
fr: Les enquêtes vous permettent de créer des formulaires d'enquête dynamiques, de créer/modifier la structure de l'enquête, d'afficher et d'analyser les résultats de l'enquête et de les enregistrer sous forme de document PDF. Avec l'éditeur d'enquête, il est possible de définir une logique conditionnelle et une validation des réponses pour les champs du formulaire.

source: The Survey editor can be accessed from the left side bar under surveys menu.
fr: L'éditeur d'enquête est accessible à partir de la barre latérale gauche sous le menu Enquêtes.

source: ![Survey Explorer](../../_static/images/surveys/survey_explorer.png "Survey Explorer")
fr: ![Explorateur d'enquête](../../_static/images/surveys/survey_explorer.png "Explorateur d'enquête")

source: Survey Explorer
fr: Explorateur d'enquête

source: Create Surveys and Panel Types
fr: Créer des enquêtes et des types de panels

source: To create a survey, you will need to first add a **survey form page**. You can do this by clicking on the **Add survey from page** button at the top right corner of the of the page.
fr: Pour créer une enquête, vous devrez d'abord ajouter une **page de formulaire d'enquête**. Vous pouvez le faire en cliquant sur le bouton **Ajouter une enquête à partir de la page** dans le coin supérieur droit de la page.

source: ![Add Survey](../../_static/images/surveys/add_survey_page.png "Add Survey")
fr: ![Ajouter une enquête](../../_static/images/surveys/add_survey_page.png "Ajouter une enquête")

source: Add Survey
fr: Ajouter une enquête

source: Select a parent page e.g 'Home' and continue to edit the page and supply a Page title. Publish this page. This page will render the form that will be created in the survey creator.
fr: Sélectionnez une page parent, par exemple « Accueil », continuez à modifier la page et fournissez un titre de page. Publiez cette page. Cette page affichera le formulaire qui sera créé dans le créateur d'enquête.

source: ![Survey Parent Page](../../_static/images/surveys/survey_parent.png "Survey Parent Page")
fr: ![Page parent de l'enquête](../../_static/images/surveys/survey_parent.png "Page parent de l'enquête")

source: Survey Parent Page
fr: Page parent de l'enquête

source: ![Survey Page](../../_static/images/surveys/survey_page.png "Survey Page")
fr: ![Page d'enquête](../../_static/images/surveys/survey_page.png "Page d'enquête")

source: Survey Page
fr: Page d'enquête

source: Navigate to the Survey creator to create form fields and their logic using the **Survey Creator** button. | ![Surveys](../../_static/images/surveys/surveys.png "Surveys")
fr: Accédez au créateur d'enquête pour créer des champs de formulaire et leur logique à l'aide du bouton **Survey Creator**. | ![Enquêtes](../../_static/images/surveys/surveys.png "Enquêtes")

source: The Survey Creator
fr: Le créateur d'enquête

source: This section describes how to perfom basic tasks in the Survey Creator. There are currently two tabs in the creator i.e Designer and Preview tab.
fr: Cette section décrit comment effectuer des tâches de base dans Survey Creator. Il y a actuellement deux onglets dans le créateur, à savoir l'onglet Concepteur et Aperçu.

source: ![Survey Creator](../../_static/images/surveys/survey_creator.png "Survey Creator")
fr: ![Créateur d'enquête](../../_static/images/surveys/survey_creator.png "Créateur d'enquête")

source: Survey Creator
fr: Créateur d'enquête

source: Designer Tab
fr: Onglet Concepteur

source: By using the Designer tab, you have the ability to customize your survey. You can move questions and panels from the **Toolbox** onto the **Design Surface** through drag and drop, and modify the question, panel, and survey settings using the **Property Grid**.
fr: En utilisant l'onglet Concepteur, vous avez la possibilité de personnaliser votre enquête. Vous pouvez déplacer des questions et des panneaux de la **Boîte à outils** vers la **Surface de conception** par glisser-déposer, et modifier les paramètres de la question, du panneau et de l'enquête à l'aide de la **Grille de propriétés**.

source: Question and Panel Types
fr: Types de questions et de panels

source: Type
fr: Taper

source: **Single Input**
fr: **Entrée unique**

source: For open-ended questions that necessitate brief responses, employ the Single Input type where respondents can input their answers using a single-line text editor.
fr: Pour les questions ouvertes qui nécessitent des réponses brèves, utilisez le type de saisie unique où les personnes interrogées peuvent saisir leurs réponses à l'aide d'un éditeur de texte sur une seule ligne.

source: ![Single Input](../../_static/images/surveys/question-types-single-input.png "Single Input")
fr: ![Entrée unique](../../_static/images/surveys/question-types-single-input.png "Entrée unique")

source: Single Input
fr: Entrée unique

source: **Checkbox**
fr: **case à cocher**

source: For questions that allow for multiple answers, utilize the Checkbox type where respondents can choose one or more options by clicking on the corresponding checkboxes.
fr: Pour les questions qui permettent plusieurs réponses, utilisez le type Case à cocher où les personnes interrogées peuvent choisir une ou plusieurs options en cliquant sur les cases correspondantes.

source: Checkbox
fr: Case à cocher

source: **Radiogroup**
fr: **Groupe radio**

source: For questions that offer several options but allow only one response, use the Radiogroup type where respondents can select a single answer by clicking on one of the radio buttons.
fr: Pour les questions qui offrent plusieurs options mais ne permettent qu'une seule réponse, utilisez le type Radiogroupe où les répondants peuvent sélectionner une seule réponse en cliquant sur l'un des boutons radio.

source: ![Radiogroup](../../_static/images/surveys/question-types-radiogroup.png "Radiogroup")
fr: ![Groupe radio](../../_static/images/surveys/question-types-radiogroup.png "Groupe radio")

source: Radiogroup
fr: Groupe radio

source: **Dropdown**
fr: **Dérouler**

source: In the Dropdown type, respondents can choose a single answer from a list of options displayed in a drop-down menu. Similar to Radiogroup, this type is suitable for questions that have multiple options but require only one answer. The Dropdown UI can also show more options while using less screen space.
fr: Dans le type Dropdown, les personnes interrogées peuvent choisir une seule réponse dans une liste d'options affichées dans un menu déroulant. Semblable à Radiogroup, ce type convient aux questions comportant plusieurs options mais ne nécessitant qu'une seule réponse. L'interface utilisateur déroulante peut également afficher plus d'options tout en utilisant moins d'espace sur l'écran.

source: Dropdown
fr: Dérouler

source: **Comment**
fr: **Commentaire**

source: For open-ended questions that require respondents to provide lengthy answers, use the Comment type where respondents can input their responses in a resizable multi-line text area. This type is suitable for questions that accept multi-line answers.
fr: Pour les questions ouvertes qui nécessitent que les personnes interrogées fournissent de longues réponses, utilisez le type Commentaire où les personnes interrogées peuvent saisir leurs réponses dans une zone de texte multiligne redimensionnable. Ce type convient aux questions qui acceptent des réponses sur plusieurs lignes.

source: ![Comment](../../_static/images/surveys/question-types-comment.png "Comment")
fr: ![Commentaire](../../_static/images/surveys/question-types-comment.png "Commentaire")

source: Comment
fr: Commentaire

source: **Rating**
fr: **Notation**

source: When you want respondents to provide a rating, use the Rating type where they can select a single number from within a specified range. This type is appropriate for questions that require a rating response.
fr: Lorsque vous souhaitez que les répondants fournissent une note, utilisez le type Note qui leur permet de sélectionner un seul chiffre dans une plage spécifiée. Ce type est approprié pour les questions qui nécessitent une réponse de notation.

source: ![Rating](../../_static/images/surveys/question-types-rating.png "Rating")
fr: ![Note](../../_static/images/surveys/question-types-rating.png "Note")

source: Rating
fr: Notation

source: **Ranking**
fr: **Classement**

source: The Ranking type is suitable for questions where respondents need to establish the order of items. This type allows respondents to drag and drop items from a list to rearrange them based on rank or preference.
fr: Le type Classement convient aux questions pour lesquelles les répondants doivent établir l'ordre des éléments. Ce type permet aux répondants de glisser-déposer des éléments d'une liste pour les réorganiser en fonction de leur classement ou de leurs préférences.

source: ![Ranking](../../_static/images/surveys/question-types-ranking.png "Ranking")
fr: ![Classement](../../_static/images/surveys/question-types-ranking.png "Classement")

source: Ranking
fr: Classement

source: **Image Picker**
fr: ** Sélecteur d'images **

source: In a survey question where respondents are required to select one or several images or videos from a series, a value associated with the chosen image or video is saved to the survey results.
fr: Dans une question d'enquête où les répondants doivent sélectionner une ou plusieurs images ou vidéos d'une série, une valeur associée à l'image ou à la vidéo choisie est enregistrée dans les résultats de l'enquête.

source: ![Image Picker](../../_static/images/surveys/question-types-imagepicker.png "Image Picker")
fr: ![Sélecteur d'images](../../_static/images/surveys/question-types-imagepicker.png "Sélecteur d'images")

source: Image Picker
fr: Sélecteur d'images

source: **Boolean**
fr: **Booléen**

source: When using a Boolean editor, respondents can switch between Yes or No to provide their response. The survey results will record the response as true for Yes or false for No.
fr: Lorsqu'ils utilisent un éditeur booléen, les personnes interrogées peuvent basculer entre Oui ou Non pour fournir leur réponse. Les résultats de l'enquête enregistreront la réponse comme étant vraie pour Oui ou fausse pour Non.

source: ![Boolean](../../_static/images/surveys/question-types-boolean.png "Boolean")
fr: ![Booléen](../../_static/images/surveys/question-types-boolean.png "Booléen")

source: Boolean
fr: Booléen

source: **Signature Pad**
fr: **Tampon de signature**

source: To capture a respondent's signature or any other hand-drawn input, use a type that allows respondents to draw their signature using mouse or touch gestures within a designated input area.
fr: Pour capturer la signature d'un répondant ou toute autre entrée dessinée à la main, utilisez un type qui permet aux répondants de dessiner leur signature à l'aide de la souris ou de gestes tactiles dans une zone de saisie désignée.

source: ![Signature Pad](../../_static/images/surveys/question-types-signature-pad.png "Signature Pad")
fr: ![Bloc de signature](../../_static/images/surveys/question-types-signature-pad.png "Bloc de signature")

source: Signature Pad
fr: Bloc-signature

source: The Image type is used to include an image or video in the survey for presentation purposes only. This type does not generate a value to be saved in the survey results.
fr: Le type Image est utilisé pour inclure une image ou une vidéo dans l’enquête à des fins de présentation uniquement. Ce type ne génère pas de valeur à enregistrer dans les résultats de l'enquête.

source: The HTML type can be used to format text, include links, and insert media or custom elements into the survey. This type is solely for presentation purposes and does not produce a value to be saved in the survey results. However, it is important to note that HTML content can be susceptible to security breaches. Therefore, make sure that any links inserted lead to trusted resources.
fr: Le type HTML peut être utilisé pour formater du texte, inclure des liens et insérer des médias ou des éléments personnalisés dans l'enquête. Ce type est uniquement destiné à des fins de présentation et ne produit pas de valeur à enregistrer dans les résultats de l'enquête. Cependant, il est important de noter que le contenu HTML peut être sujet à des failles de sécurité. Par conséquent, assurez-vous que tous les liens insérés mènent à des ressources fiables.

source: The Expression type is used to calculate values and present them to respondents. It can be utilized to sum up scores of previous responses, display current date and time, find an average value, and so on. The calculated value is then saved in the survey results. In the example image provided, the Expression type concatenates the first and last names to display a full name. To define an expression in a survey question, type it into the Expression field found in the General category. Your expression can refer to other survey questions (such as {question1} + {question2}) or use pre-built calculation functions.
fr: Le type Expression est utilisé pour calculer les valeurs et les présenter aux répondants. Il peut être utilisé pour résumer les scores des réponses précédentes, afficher la date et l'heure actuelles, trouver une valeur moyenne, etc. La valeur calculée est ensuite enregistrée dans les résultats de l'enquête. Dans l’exemple d’image fourni, le type Expression concatène le prénom et le nom pour afficher un nom complet. Pour définir une expression dans une question d'enquête, saisissez-la dans le champ Expression de la catégorie Général. Votre expression peut faire référence à d'autres questions d'enquête (telles que {question1} + {question2}) ou utiliser des fonctions de calcul prédéfinies.

source: **File**
fr: **Déposer**

source: The File type is used to enable respondents to upload files. They can drag and drop one or several files into the designated area or select files using the browser's Upload File dialog window. Once uploaded, the files are saved in the survey results as base64-encoded strings.
fr: Le type Fichier est utilisé pour permettre aux répondants de télécharger des fichiers. Ils peuvent glisser et déposer un ou plusieurs fichiers dans la zone désignée ou sélectionner des fichiers à l'aide de la fenêtre de dialogue Télécharger un fichier du navigateur. Une fois téléchargés, les fichiers sont enregistrés dans les résultats de l'enquête sous forme de chaînes codées en base64.

source: ![File](../../_static/images/surveys/question-types-file.png "File")
fr: ![Fichier](../../_static/images/surveys/question-types-file.png "Fichier")

source: File
fr: Déposer

source: **Single-Choice Matrix**
fr: **Matrice à choix unique**

source: The Single-Choice Matrix type exhibits radio buttons arranged in rows and columns. Respondents can choose only one radio button within each row.
fr: Le type Matrice à choix unique présente des boutons radio disposés en lignes et en colonnes. Les répondants ne peuvent choisir qu’un seul bouton radio dans chaque ligne.

source: ![Single-Choice Matrix](../../_static/images/surveys/question-types-matrix-single-choice.png "Single-Choice Matrix")
fr: ![Matrice à choix unique](../../_static/images/surveys/question-types-matrix-single-choice.png "Matrice à choix unique")

source: Single-Choice Matrix
fr: Matrice à choix unique

source: **Multiple-Choice Matrix**
fr: **Matrice à choix multiples**

source: The Multiple-Choice Matrix type displays rows and columns. Respondents use these editors to select a desired value in each cell. The following image illustrates the Multiple-Choice Matrix type with the default Dropdown editors.
fr: Le type Matrice à choix multiples affiche des lignes et des colonnes. Les répondants utilisent ces éditeurs pour sélectionner une valeur souhaitée dans chaque cellule. L'image suivante illustre le type Matrice à choix multiples avec les éditeurs déroulants par défaut.

source: ![Surveys](../../_static/images/surveys/question-types-matrix-multiple-choices.png "Surveys")
fr: ![Enquêtes](../../_static/images/surveys/question-types-matrix-multiple-choices.png "Enquêtes")

source: **Dynamic Matrix**
fr: **Matrice dynamique**

source: The Dynamic Matrix type is similar to a [Multiple-Choice Matrix](https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix), but respondents can add and remove matrix rows.
fr: Le type de matrice dynamique est similaire à une [matrice à choix multiples](https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix), mais les personnes interrogées peuvent ajouter et supprimer des lignes de matrice. .

source: ![Dynamic Matrix](../../_static/images/surveys/question-types-matrix-dynamic-rows.png "Dynamic Matrix")
fr: ![Matrice dynamique](../../_static/images/surveys/question-types-matrix-dynamic-rows.png "Matrice dynamique")

source: Dynamic Matrix
fr: Matrice dynamique

source: **Multiple Text**
fr: **Texte multiple**

source: Respondents enter their answers into multiple single-line text editors. Use the Multiple Text type for open-ended questions that require more than one short answer.
fr: Les répondants saisissent leurs réponses dans plusieurs éditeurs de texte sur une seule ligne. Utilisez le type Texte multiple pour les questions ouvertes qui nécessitent plusieurs réponses courtes.

source: ![Multiple Text](../../_static/images/surveys/question-types-multiple-text.png "Multiple Text")
fr: ![Texte multiple](../../_static/images/surveys/question-types-multiple-text.png "Texte multiple")

source: Multiple Text
fr: Texte multiple

source: **Panel**
fr: **Panneau**

source: The Panel type is a container for other questions and panels. Use this type to group several questions or panels and control them all together.
fr: Le type Panel est un conteneur pour d’autres questions et panels. Utilisez ce type pour regrouper plusieurs questions ou panneaux et les contrôler tous ensemble.

source: **Dynamic Panel**
fr: **Panneau dynamique**

source: The Dynamic Panel type is a template panel that can contain multiple questions. Respondents can add and remove panels based on the template.
fr: Le type Dynamic Panel est un panneau modèle qui peut contenir plusieurs questions. Les répondants peuvent ajouter et supprimer des panneaux en fonction du modèle.

source: ![Dynamic Panel](../../_static/images/surveys/question-types-dynamic-panel.png "Dynamic Panel")
fr: ![Panneau dynamique](../../_static/images/surveys/question-types-dynamic-panel.png "Panneau dynamique")

source: Dynamic Panel
fr: Panneau dynamique

source: In progress...
fr: En cours...

source: Content Assets
fr: Actifs de contenu

source: Flexible Pages (Flex Page)
fr: Pages flexibles (page flexible)

source: This is a type of content page that offers a high degree of customization and flexibility in terms of layout and content structure. Unlike other pages above, which have a fixed set of predefined fields, a Flex Page allows you to add various content blocks and sections to create dynamic and richly structured pages.
fr: Il s'agit d'un type de page de contenu qui offre un haut degré de personnalisation et de flexibilité en termes de mise en page et de structure de contenu. Contrairement aux autres pages ci-dessus, qui disposent d'un ensemble fixe de champs prédéfinis, une page Flex vous permet d'ajouter divers blocs et sections de contenu pour créer des pages dynamiques et richement structurées.

source: With a Flex Page, you have the flexibility to add, rearrange, and customize these content blocks within the page editor. This enables you to build complex and unique page layouts without the need for technical expertise or assistance from developers.
fr: Avec une page Flex, vous avez la possibilité d'ajouter, de réorganiser et de personnaliser ces blocs de contenu dans l'éditeur de page. Cela vous permet de créer des mises en page complexes et uniques sans avoir besoin d’une expertise technique ou de l’assistance des développeurs.

source: The ability to create Flex Pages is one of the features that make Wagtail a powerful and user-friendly ClimWeb. It allows website administrators and editors to have greater control over the presentation of content, making it easier to maintain a consistent design while accommodating diverse content needs across different pages of the website.
fr: La possibilité de créer des pages Flex est l'une des fonctionnalités qui font de Wagtail un ClimWeb puissant et convivial. Il permet aux administrateurs et aux éditeurs de sites Web d'avoir un plus grand contrôle sur la présentation du contenu, ce qui facilite le maintien d'une conception cohérente tout en répondant aux divers besoins de contenu sur les différentes pages du site Web.

source: Create a Flex Page
fr: Créer une page flexible

source: To create this page navigate to the 'pages' item on the explorer menu as shown below and click on the pages item at the top.
fr: Pour créer cette page, accédez à l'élément « pages » dans le menu de l'explorateur comme indiqué ci-dessous et cliquez sur l'élément pages en haut.

source: ![Pages Explorer](../../_static/images/pages/pages_explorer.png "Pages Explorer")
fr: ![Explorateur de pages](../../_static/images/pages/pages_explorer.png "Explorateur de pages")

source: Pages Explorer
fr: Explorateur de pages

source: Hover over the Home item and click 'Add Child Page'
fr: Passez la souris sur l'élément Accueil et cliquez sur "Ajouter une page enfant".

source: ![Add Child Page](../../_static/images/pages/add_child_page.png "Add Child Page")
fr: ![Ajouter une page enfant](../../_static/images/pages/add_child_page.png "Ajouter une page enfant")

source: Add Child Page
fr: Ajouter une page enfant

source: Select Flex Page from the type of pages provided.
fr: Sélectionnez Flex Page parmi le type de pages fourni.

source: ![Add Flex Page](../../_static/images/flex_page/add_flex_page.png "Add Flex Page")
fr: ![Ajouter une page Flex](../../_static/images/flex_page/add_flex_page.png "Ajouter une page Flex")

source: Add Flex Page
fr: Ajouter une page flexible

source: Sections of a Flex Page
fr: Sections d'une page flexible

source: The main sections of the flex page include the **page title, banner and content** section.
fr: Les sections principales de la page flexible incluent la section **titre de la page, bannière et contenu**.

source: ![Flex Page Sections](../../_static/images/flex_page/flex_page_sections.png "Flex Page Sections")
fr: ![Sections de page flexibles](../../_static/images/flex_page/flex_page_sections.png "Sections de page flexibles")

source: Flex Page Sections
fr: Sections de page flexibles

source: The **content section** contains a set of resuable and reorderable blocks, i.e
fr: La **section de contenu** contient un ensemble de blocs réutilisables et réorganisables, c'est-à-dire

source: ![Flex Page Sections](../../_static/images/flex_page/content_panel_sections.png "Flex Page Sections")
fr: ![Sections de page flexibles](../../_static/images/flex_page/content_panel_sections.png "Sections de page flexibles")

source: Title and Text Block
fr: Titre et bloc de texte
