Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: ![Add child Page](../_static/images/mautic/add_child_page.png "Add child Page")
fr: ![Ajouter une page enfant](../_static/images/mautic/add_child_page.png "Ajouter une page enfant")

source: Select `Mautic mailing list subsrciption page` from the list. Note that, if this page was already created then this option will not appear as only one instance of this page is allowed.
fr: Sélectionnez « Page d'abonnement à la liste de diffusion Mautic » dans la liste. Notez que si cette page a déjà été créée, cette option n'apparaîtra pas car une seule instance de cette page est autorisée.

source: ![Add mautic Page](../_static/images/mautic/add_mautic_page.png "Add mautic Page")
fr: ![Ajouter une page mautic](../_static/images/mautic/add_mautic_page.png "Ajouter une page mautic")

source: Add mautic Page
fr: Ajouter une page Mautic

source: Fill in the form with necessary input. Example below. The Mautic form ID is retrieved from the subscription form created on Mautic's software. Refer to [Mautic User Guide](https://docs.mautic.org/en)
fr: Remplissez le formulaire avec les informations nécessaires. Exemple ci-dessous. L'identifiant du formulaire Mautic est récupéré à partir du formulaire d'abonnement créé sur le logiciel Mautic. Reportez-vous au [Guide de l'utilisateur Mautic](https://docs.mautic.org/en)

source: ![Mautic Page](../_static/images/mautic/mautic_page.png "Mautic Page")
fr: ![Page Mautic](../_static/images/mautic/mautic_page.png "Page Mautic")

source: Mautic Page
fr: Page Mautique

source: Once the page is published, this page will render all fields created in Mautic.
fr: Une fois la page publiée, cette page affichera tous les champs créés dans Mautic.

source: In progress ...
fr: En cours ...

source: CAP Editor
fr: Éditeur du CAP

source: The **Common Alerting Protocol (CAP)** provides an open, non-proprietary digital message format for all types of alerts and notifications. It does not address any particular application or telecommunications method. The CAP format is compatible with emerging techniques, such as Web services, as well as existing formats including the Specific Area Message Encoding (SAME) used for the United States' National Oceanic and Atmospheric Administration (NOAA) Weather Radio and the Emergency Alert System (EAS)
fr: Le **Common Alerting Protocol (CAP)** fournit un format de message numérique ouvert et non propriétaire pour tous les types d'alertes et de notifications. Il ne concerne aucune application ou méthode de télécommunication particulière. Le format CAP est compatible avec les techniques émergentes, telles que les services Web, ainsi qu'avec les formats existants, notamment le codage de messages de zone spécifique (SAME) utilisé pour la radio météo de la National Oceanic and Atmospheric Administration (NOAA) des États-Unis et le système d'alerte d'urgence ( EAS)

source: The CAP xml response follows the structure of the schema provided at http://docs.oasis-open.org/emergency/cap/v1.2/CAP-v1.2-os.html
fr: La réponse CAP XML suit la structure du schéma fourni sur http://docs.oasis-open.org/emergency/cap/v1.2/CAP-v1.2-os.html

source: CAP Editor Features
fr: Fonctionnalités de l'éditeur CAP

source: ![CAP Preview](../_static/images/cap/cap_preview.png "CAP Preview")
fr: ![Aperçu CAP](../_static/images/cap/cap_preview.png "Aperçu CAP")

source: CAP Preview
fr: Aperçu du CAP

source: The CAP editor tool is a solution that provides a range of functionalities to support the NMHS in seamlessly issuing CAP. It has been developed with an aim of increasing the adoption of CAP by NMHS in Africa. Some of the key features of the tool include:
fr: L'outil éditeur de CAP est une solution qui fournit une gamme de fonctionnalités pour aider les SMHN à émettre des CAP en toute transparence. Il a été développé dans le but d’accroître l’adoption du CAP par les SMHN en Afrique. Certaines des fonctionnalités clés de l'outil incluent :

source: Possibility to run as standalone editor or integrate into Wagtail-ClimWeb-based website
fr: Possibilité de fonctionner en tant qu'éditeur autonome ou d'intégrer un site Web basé sur Wagtail-ClimWeb

source: Search Engine Optimization support to increase visibility and attract targeted traffic to an alert
fr: Prise en charge de l'optimisation des moteurs de recherche pour augmenter la visibilité et attirer du trafic ciblé vers une alerte

source: Support for Approval Workflow from composer to approver, including commenting and email notification support
fr: Prise en charge du flux de travail d'approbation du compositeur à l'approbateur, y compris la prise en charge des commentaires et des notifications par courrier électronique

source: Interoperable XML API of Alert List and Detail for integration with CAP Aggregators - Live CAP creation and editing preview
fr: API XML interopérable de liste d'alerte et de détail pour l'intégration avec les agrégateurs CAP - Aperçu de la création et de la modification du CAP en direct

source: Draw / Upload Polygon Functionality for Alert Area/Areas
fr: Fonctionnalité de dessin/téléchargement de polygones pour les zones/zones d'alerte

source: Simple user friendly and mobile friendly CAP alert creation and management
fr: Création et gestion d'alertes CAP simples, conviviales et adaptées aux appareils mobiles

source: Alert to Alert/Alerts Reference Linkage
fr: Lien de référence entre alerte et alerte/alertes

source: Published python package with version management and changelogs https://github.com/wmo-raf/cap-editor
fr: Package Python publié avec gestion des versions et journaux des modifications https://github.com/wmo-raf/cap-editor

source: Related Setup/Installation and Usage instructions
fr: Instructions de configuration/installation et d'utilisation associées

source: Creating a CAP Alert
fr: Créer une alerte CAP

source: To create a CAP Alert access the editor from the explorer menu as below and add a new cap alert page:
fr: Pour créer une alerte CAP, accédez à l'éditeur depuis le menu de l'explorateur comme ci-dessous et ajoutez une nouvelle page d'alerte CAP :

source: ![CAP Explorer](../_static/images/cap/cap_explorer.png "CAP Explorer")
fr: ![Explorateur CAP](../_static/images/cap/cap_explorer.png "Explorateur CAP")

source: CAP Explorer
fr: Explorateur CAP

source: Sections in the Alert Page and corresponding XML
fr: Sections de la page d'alerte et XML correspondant

source: The overall Document Object Model of an alert is as below:
fr: Le modèle objet de document global d’une alerte est le suivant :

source: ![Alert DOM](../_static/images/cap/dom.jpg "CAP Document Object Model")
fr: ![Alerte DOM](../_static/images/cap/dom.jpg "Modèle objet du document CAP")

source: Alert DOM
fr: Alerte DOM

source: A. Alert Identification
fr: A. Identification des alertes

source: This is the root section of CAP corresponds to:
fr: Voici la section racine du CAP qui correspond à :

source: It contains the **Message ID (identifier), Sender ID(sender), Sent Dat/Time (sent), Message Status (status), Message Type (msgType), Scope (scope), Restriction (restriction), Addresses (addresses), Note (note), Reference IDs (references) and Incident ids (incidents)**.
fr: Il contient le ** ID du message (identifiant), ID de l'expéditeur (expéditeur), Date/heure d'envoi (envoyé), Statut du message (statut), Type de message (msgType), Portée (portée), Restriction (restriction), Adresses (adresses). ), Note (note), ID de référence (références) et ID d'incident (incidents)**.

source: Some fields are visible based on selection of different parameters.
fr: Certains champs sont visibles en fonction de la sélection de différents paramètres.

source: ![Alert Identification](../_static/images/cap/alert_identification.png "Alert Identification section")
fr: ![Identification des alertes](../_static/images/cap/alert_identification.png "Section Identification des alertes")

source: AlertIdentification
fr: AlerteIdentification

source: B. Alert Information
fr: B. Informations d'alerte

source: This is an optional child section of the Alert Identification Section i.e
fr: Il s'agit d'une section enfant facultative de la section d'identification des alertes, c'est-à-dire

source: Multiple instances of this section are allowed. It contains the **Langauge (langauge), Event Category/Categories (category), Event Type (event), Response Type/Types (responseType), Urgency (urgency), Severity (severity), Certainty (certainty), Audience (audience), Event Code/Codes (eventCode), Effective Date/Time (effective), Onset Date/Time (onset), Expiration Date/Time (expires), Sender Name (senderName), Headline (headline), Event description (description), Instructions (instruction), Information URL (web), Contact Info (contact) and Parameter/Parameters (parameter)**.
fr: Plusieurs instances de cette section sont autorisées. Il contient le ** Langauge (langauge), la ou les catégories d'événements (catégorie), le type d'événement (événement), le ou les types de réponse (responseType), l'urgence (urgence), la gravité (gravité), la certitude (certitude), l'audience (audience). ), code/codes d'événement (eventCode), date/heure d'effet (effectif), date/heure de début (début), date/heure d'expiration (expire), nom de l'expéditeur (senderName), titre (titre), description de l'événement (description) , Instructions (instruction), URL d'information (web), Informations de contact (contact) et Paramètre/Paramètres (paramètre)**.

source: ![Alert Info](../_static/images/cap/alert_info.png "Alert Info")
fr: ![Infos d'alerte](../_static/images/cap/alert_info.png "Infos d'alerte")

source: AlertInfo
fr: AlerteInfo

source: C. Alert Area
fr: C. Zone d'alerte

source: This is an optional child section of the Alert Info Section i.e
fr: Il s'agit d'une section enfant facultative de la section Informations sur les alertes, c'est-à-dire

source: Multiple instances of this section are allowed. It contains the **Area Description (areaDesc), Area Polygon/Polygons (polygon), Area Circle/Circles (circle), Area Geocode/Geocodes (geocode), Altitude (altitude), Ceiling (ceiling)**.
fr: Plusieurs instances de cette section sont autorisées. Il contient la **Description de la zone (areaDesc), la zone Polygone/Polygones (polygone), la Zone Cercle/Cercles (cercle), la Zone Géocode/Géocodes (géocode), l'Altitude (altitude), le Plafond (plafond)**.

source: ![Alert Area](../_static/images/cap/alert_area_options.png "Alert Area section")
fr: ![Zone d'alerte](../_static/images/cap/alert_area_options.png "Section Zone d'alerte")

source: Alert Area
fr: Zone d'alerte

source: The Alert area input accepts 4 options:
fr: L'entrée Zone d'alerte accepte 4 options :

source: Admin Boundary (area is picked from predefined boundaries). To use this option, ensure that admin boundaries are initially loaded. Refer to [Setting up boundaries](#setting-up-boundaries) section.
fr: Limite d'administration (la zone est sélectionnée à partir de limites prédéfinies). Pour utiliser cette option, assurez-vous que les limites d'administration sont initialement chargées. Reportez-vous à la section [Définition des limites](#setting-up-boundaries).

source: ![Alert Area boundary](../_static/images/cap/alert_area_boundary.png "Alert Area section")
fr: ![Limite de la zone d'alerte](../_static/images/cap/alert_area_boundary.png "Section de la zone d'alerte")

source: Alert Area boundary
fr: Limite de la zone d'alerte

source: Polygon (drawing a polygon)
fr: Polygone (dessiner un polygone)

source: ![Alert Area polygon](../_static/images/cap/alert_area_polygon.png "Alert Area section")
fr: ![Polygone de la zone d'alerte](../_static/images/cap/alert_area_polygon.png "Section de la zone d'alerte")

source: Alert Area polygon
fr: Polygone de la zone d'alerte

source: Circle (drawing a circle which specifies the latitude, longitude and radius)
fr: Cercle (dessiner un cercle qui précise la latitude, la longitude et le rayon)

source: ![Alert Area circle](../_static/images/cap/alert_area_circle.png "Alert Area section")
fr: ![Cercle de la zone d'alerte](../_static/images/cap/alert_area_circle.png "Section de la zone d'alerte")

source: Alert Area circle
fr: Cercle de zone d'alerte

source: Geocode (specifying area geocode name and value). Using this option presumes knowleged of the coding system
fr: Géocodage (spécifiant le nom et la valeur du géocode de la zone). L'utilisation de cette option suppose une connaissance du système de codage

source: ![Alert Area geocode](../_static/images/cap/alert_area_geocode.png "Alert Area section")
fr: ![Géocode de la zone d'alerte](../_static/images/cap/alert_area_geocode.png "Section de la zone d'alerte")

source: Alert Area geocode
fr: Géocodage de la zone d'alerte

source: D. Alert Resource
fr: D. Ressource d'alerte

source: Multiple instances of this section are allowed. It contains the **Description (resourceDesc), MIME Type (mimeType), File Size (size), URI (uri), Dereferenced URI (derefUri) and Digest (digest)**
fr: Plusieurs instances de cette section sont autorisées. Il contient la **Description (resourceDesc), le type MIME (mimeType), la taille du fichier (taille), l'URI (uri), l'URI déréférencé (derefUri) et le résumé (digest)**.

source: File resource (takes in a file and description)
fr: Ressource de fichier (prend un fichier et une description)

source: ![Alert Resource](../_static/images/cap/alert_resource_file.png "Alert Resource section")
fr: ![Ressource d'alerte](../_static/images/cap/alert_resource_file.png "Section des ressources d'alerte")

source: Alert Resource
fr: Ressource d'alerte

source: External resource
fr: Ressource externe

source: ![Alert Resource](../_static/images/cap/alert_resource_external.png "Alert Resource section")
fr: ![Ressource d'alerte](../_static/images/cap/alert_resource_external.png "Section des ressources d'alerte")

source: E. Additional CAP Inputs
fr: E. Contributions supplémentaires du PAC

source: Addition alert information elements include parameters and event codes
fr: Les éléments d'information d'alerte supplémentaires incluent des paramètres et des codes d'événement

source: This defines the reference incident to the current alert, if any.
fr: Ceci définit l'incident de référence à l'alerte actuelle, le cas échéant.

source: ![Alert Incidents](../_static/images/cap/alert_incidents.png "Alert Incidents section")
fr: ![Incidents d'alerte](../_static/images/cap/alert_incidents.png "Section Incidents d'alerte")

source: Alert Incidents
fr: Incidents d’alerte

source: CAP Settings
fr: Paramètres du PAC

source: CAP Settings include sender name, sender identifier, contact details, hazard types and audience types.
fr: Les paramètres CAP incluent le nom de l’expéditeur, l’identifiant de l’expéditeur, les coordonnées, les types de danger et les types d’audience.

source: ![CAP Settings](../_static/images/cap/cap_settings.png "CAP Settings")
fr: ![Paramètres CAP](../_static/images/cap/cap_settings.png "Paramètres CAP")

source: The creation of Hazard types will change the event input under alert information to a dropdown.
fr: La création de types de danger modifiera l'entrée d'événement sous les informations d'alerte en une liste déroulante.

source: ![CAP Settings](../_static/images/cap/alert_hazard_types.png "CAP Settings")
fr: ![Paramètres CAP](../_static/images/cap/alert_hazard_types.png "Paramètres CAP")

source: ![CAP Settings](../_static/images/cap/alert_hazard_input.png "CAP Settings")
fr: ![Paramètres CAP](../_static/images/cap/alert_hazard_input.png "Paramètres CAP")

source: Setting up boundaries
fr: Fixer des limites

source: The boundary manager allows for the addition of boundaries to be used in the creation of an alert area using the admin boundary option.
fr: Le gestionnaire de limites permet d'ajouter des limites à utiliser dans la création d'une zone d'alerte à l'aide de l'option de limite d'administration.

source: To access it, click on the boundary manager in the explorer menu as below and select Admin boundary settings to select the boundary data source and country/countries of interest. You will then need to add boundary data for the countries selected:
fr: Pour y accéder, cliquez sur le gestionnaire de limites dans le menu de l'explorateur comme ci-dessous et sélectionnez Paramètres de limite d'administration pour sélectionner la source de données de limite et le(s) pays d'intérêt. Vous devrez ensuite ajouter des données de limites pour les pays sélectionnés :

source: ![Boundary Settings](../_static/images/cap/boundary_settings_menu.png "Boundary Settings")
fr: ![Paramètres des limites](../_static/images/cap/boundary_settings_menu.png "Paramètres des limites")

source: Boundary Settings
fr: Paramètres de limite

source: Select the 'boundary data source' where you will download the boundaries. The current options are:
fr: Sélectionnez la « source de données de limites » où vous téléchargerez les limites. Les options actuelles sont :

source: OCHA Administrative Boundary common Operational Datasets (COD-ABS) (*default*) https://data.humdata.org/
fr: Ensembles de données opérationnelles communes des limites administratives d'OCHA (COD-ABS) (*par défaut*) https://data.humdata.org/

source: Global Administrative Areas 4.1 (GADM) https://gadm.org/download_country.html
fr: Zones administratives mondiales 4.1 (GADM) https://gadm.org/download_country.html

source: Add one or more countries
fr: Ajouter un ou plusieurs pays

source: To add boundary data, access the menu as below and click on 'Add Boundary' button:
fr: Pour ajouter des données de limite, accédez au menu comme ci-dessous et cliquez sur le bouton « Ajouter une limite » :

source: ![Boundary Data](../_static/images/cap/add_boundary.png "Boundary Data")
fr: ![Données de limite](../_static/images/cap/add_boundary.png "Données de limite")

source: Boundary Data
fr: Données de limite

source: Load country boundaries at each of different levels (level 0 to 4) in zipped shapefile format
fr: Charger les limites des pays à chacun des différents niveaux (niveau 0 à 4) au format de fichier de formes compressé

source: ![Boundary Loader](../_static/images/cap/boundary_loader.png "Boundary Loader")
fr: ![Chargeur de frontière](../_static/images/cap/boundary_loader.png "Chargeur de frontière")

source: Boundary Loader
fr: Chargeur de frontière

source: Zip shapefiles seperately by Admin level before upload.
fr: Compressez les fichiers de formes séparément par niveau d'administrateur avant le téléchargement.

source: City Forecasts
fr: Prévisions de la ville

source: ![Preview Home](../_static/images/city_forecasts/preview_home.png "Preview Home")
fr: ![Accueil de l'aperçu](../_static/images/city_forecasts/preview_home.png "Accueil de l'aperçu")

source: Preview Home
fr: Aperçu Accueil

source: City forecasts displayed on the homepage, and forecasts page can be added through the ClimWeb in two ways:
fr: Les prévisions de la ville affichées sur la page d'accueil et la page des prévisions peuvent être ajoutées via le ClimWeb de deux manières :

source: Manually adding daily forecasts
fr: Ajout manuel de prévisions quotidiennes

source: Fetching city forecasts from an external source i.e YR Meteo Norway's location forecast API https://developer.yr.no/featured-products/forecast/
fr: Récupération des prévisions de la ville à partir d'une source externe, par exemple l'API de prévision de localisation de YR Meteo Norvège https://developer.yr.no/featured-products/forecast/

source: The forecast manager comes with predefined weather conditions and icons. Please refer to YR Weather symbols documentation for guidance on icons and naming convention. https://api.met.no/weatherapi/weathericon/2.0/documentation
fr: Le gestionnaire de prévisions est livré avec des conditions météorologiques et des icônes prédéfinies. Veuillez vous référer à la documentation des symboles YR Weather pour obtenir des conseils sur les icônes et la convention de dénomination. https://api.met.no/weatherapi/weathericon/2.0/documentation

source: Manually Adding Forecasts
fr: Ajout manuel de prévisions

source: The city forecast explorer menu can be accessed on the left sidebar.
fr: Le menu de l’explorateur de prévisions de la ville est accessible dans la barre latérale gauche.

source: ![Forecast explorer](../_static/images/city_forecasts/forecast_explorer.png "Forecast explorer")
fr: ![Explorateur de prévisions](../_static/images/city_forecasts/forecast_explorer.png "Explorateur de prévisions")

source: Forecast explorer
fr: Explorateur de prévisions

source: Here you have the ability to:
fr: Ici, vous avez la possibilité de :

source: Add/Edit/Delete a city (city name and location)
fr: Ajouter/Modifier/Supprimer une ville (nom de la ville et emplacement)

source: ![Add city](../_static/images/city_forecasts/add_city.png "Add city")
fr: ![Ajouter une ville](../_static/images/city_forecasts/add_city.png "Ajouter une ville")

source: Add city
fr: Ajouter une ville

source: Import city forecasts in CSV format.
fr: Importez les prévisions de la ville au format CSV.

source: ![Add Forecast Explorer](../_static/images/city_forecasts/add_forecast_explorer.png "Add Forecast Explorer")
fr: ![Ajouter un explorateur de prévisions](../_static/images/city_forecasts/add_forecast_explorer.png "Ajouter un explorateur de prévisions")

source: Add Forecast Explorer
fr: Ajouter un explorateur de prévisions

source: Using the forecast manager, it is possible to load city forecasts in CSV format created offline or alternatively populate the table on the right with data. A template of the standard CSV structure is provided prepopulated with a list of all cities listed in the database. However, the forecast manager can accept a different structure and allow for correct matching of each of the columns. A forecast date must be provided for the data being uploaded before publishing.
fr: À l'aide du gestionnaire de prévisions, il est possible de charger des prévisions urbaines au format CSV créées hors ligne ou de remplir le tableau de droite avec des données. Un modèle de structure CSV standard est fourni, prérempli avec une liste de toutes les villes répertoriées dans la base de données. Cependant, le responsable des prévisions peut accepter une structure différente et permettre une correspondance correcte de chacune des colonnes. Une date prévisionnelle doit être fournie pour les données téléchargées avant la publication.

source: ![Add Forecast](../_static/images/city_forecasts/add_forecast.png "Add Forecast")
fr: ![Ajouter une prévision](../_static/images/city_forecasts/add_forecast.png "Ajouter une prévision")

source: Add Forecast
fr: Ajouter une prévision

source: Preview previously added city forecasts (last 7 days)
fr: Aperçu des prévisions de la ville ajoutées précédemment (7 derniers jours)

source: ![Load Forecast Explorer](../_static/images/city_forecasts/load_forecast_explorer.png "Load Forecast Explorer")
fr: ![Explorateur de prévisions de charge](../_static/images/city_forecasts/load_forecast_explorer.png "Explorateur de prévisions de charge")

source: Load Forecast Explorer
fr: Explorateur de prévisions de charge

source: It is also possible to fetch and preview the last 7 day city forecasts. The forecast manager allows for switching between each of the avilable dates and preview both in tabular and georeferenced formats.
fr: Il est également possible de récupérer et de prévisualiser les prévisions de la ville des 7 derniers jours. Le gestionnaire de prévisions permet de basculer entre chacune des dates disponibles et de prévisualiser à la fois sous forme tabulaire et géoréférencée.

source: ![Load Forecast](../_static/images/city_forecasts/load_forecast.png "Load Forecast")
fr: ![Prévision de charge](../_static/images/city_forecasts/load_forecast.png "Prévision de charge")

source: Load Forecast
fr: Prévision de charge
