Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: Step 2: Create a publication listing page
fr: Étape 2 : Créer une page de liste de publications

source: A listing page is a page that holds a list of pages. For example, a Publication Listing page would hold one or more publications. It lists the banner, latest 3 featured publications and all other publications.
fr: Une page de liste est une page qui contient une liste de pages. Par exemple, une page de liste de publications contiendrait une ou plusieurs publications. Il répertorie la bannière, les 3 dernières publications en vedette et toutes les autres publications.

source: ![Publication List Preview](../../_static/images/publications/publication_list_preview.png "Publication List Preview")
fr: ![Aperçu de la liste des publications](../../_static/images/publications/publication_list_preview.png "Aperçu de la liste des publications")

source: Publication List Preview
fr: Aperçu de la liste des publications

source: This option will only appear if no publication listing page already exists as there can only be on instance/occurrrence of a publication listing page.
fr: Cette option n'apparaîtra que si aucune page de liste de publications n'existe déjà, car il ne peut y avoir qu'une instance/occurrence d'une page de liste de publications.

source: Select Publication List Page from the type of pages provided.
fr: Sélectionnez Page de liste de publications parmi le type de pages fourni.

source: ![Add Publication List Page](../../_static/images/publications/add_publication_list.png "Add Publication List Page")
fr: ![Ajouter une page de liste de publications](../../_static/images/publications/add_publication_list.png "Ajouter une page de liste de publications")

source: Add Publication List Page
fr: Page Ajouter une liste de publications

source: ![Add Publication List Page](../../_static/images/publications/publication_list_page.png "Add Publication List Page")
fr: ![Ajouter une page de liste de publications](../../_static/images/publications/publication_list_page.png "Ajouter une page de liste de publications")

source: Step 3: Create a publication page
fr: Étape 3 : Créer une page de publication

source: This will navigate to the list of pages under the home page including the publication list page you just created. Hover over the the publication listing page and click on 'add child page'.
fr: Cela mènera à la liste des pages sous la page d'accueil, y compris la page de liste de publications que vous venez de créer. Passez la souris sur la page de liste des publications et cliquez sur « Ajouter une page enfant ».

source: ![Add Publication Page](../../_static/images/publications/add_publication.png "Add Publication Page")
fr: ![Ajouter une page de publication](../../_static/images/publications/add_publication.png "Ajouter une page de publication")

source: Add Publication Page
fr: Ajouter une page de publication

source: ![Publication Page Sections](../../_static/images/publications/publication_sections.png "Publication Page Sections")
fr: ![Sections des pages de publication](../../_static/images/publications/publication_sections.png "Sections des pages de publication")

source: Publication Page Sections
fr: Sections des pages de publication

source: **Publication Type** - selected from previously prepared service category in step 1
fr: **Type de publication** - sélectionné dans la catégorie de service précédemment préparée à l'étape 1

source: **Service Category** - selected from previously prepared service category. Refer to [Create Services Categories Section](./Manage-Services#step-1-create-an-agromet-service-category) to create service categories.
fr: **Catégorie de service** - sélectionnée dans la catégorie de service précédemment préparée. Reportez-vous à la [Section Créer des catégories de services](./Manage-Services#step-1-create-an-agromet-service-category) pour créer des catégories de services.

source: **Projects Section** - select from previously prepared projects. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects.
fr: **Section Projets** - sélectionnez parmi les projets préalablement préparés. Veuillez vous référer à [Gérer les projets](./Manage-Projects) pour guider la création de projets.

source: **Publication Image** - This can be a screenshot of the front page of the publication
fr: **Image de la publication** – Il peut s'agir d'une capture d'écran de la première page de la publication.

source: **Date of Publish** - the date the publication was published
fr: **Date de publication** - la date à laquelle la publication a été publiée

source: **Document or File** - Here you can upload pdfs, word documents, powerpoints, zip files or any other file of the publication
fr: **Document ou fichier** - Ici, vous pouvez télécharger des fichiers PDF, Word, PowerPoint, zip ou tout autre fichier de la publication.

source: **External Url** - Only If published/hosted somewhere else, provide a link to published resource if external
fr: **Url externe** - Uniquement si publié/hébergé ailleurs, fournissez un lien vers la ressource publiée si elle est externe

source: **Summary** - Brief Summary of the publication
fr: **Résumé** - Bref résumé de la publication

source: **Mark as featured** - If enabled, the publication will appear as Featured publications on the publications listing page
fr: **Marquer comme en vedette** - Si cette option est activée, la publication apparaîtra en tant que publications en vedette sur la page de liste des publications.

source: **Is visible on homepage** - If enabled, the publication will appear in the homepage as an alert/latest update
fr: **Est visible sur la page d'accueil** - Si activé, la publication apparaîtra sur la page d'accueil sous forme d'alerte/dernière mise à jour

source: **Peer reviewed** - enable this option if the publication has been peer reviewed
fr: **Évalué par les pairs** - activez cette option si la publication a été évaluée par les pairs

source: **Additional Details** - this include an optional start and end date for which the publication is considered relevant.
fr: **Détails supplémentaires** - cela inclut une date de début et de fin facultative pour laquelle la publication est considérée comme pertinente.

source: To create additional publications in the future you would need to begin from [Step 3: Create a publication page](./Manage-Publications#step-3-create-a-publication-page).
fr: Pour créer des publications supplémentaires à l'avenir, vous devrez commencer par [Étape 3 : Créer une page de publication](./Manage-Publications#step-3-create-a-publication-page).

source: Services
fr: Prestations de service

source: Creation of Services
fr: Création de Prestations

source: The creation of services follows the steps below:
fr: La création de services suit les étapes ci-dessous :

source: Create a service category
fr: Créer une catégorie de service

source: Create a service listing page
fr: Créer une page de liste de services

source: Create a service page
fr: Créer une page de service

source: Service Creation Example Scenario
fr: Exemple de scénario de création de service

source: Assume you would like to have Agrometeorology Service on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous souhaitiez avoir le service d’agrométéorologie sur le site Web, la manière pratique de le faire en suivant les étapes ci-dessus serait :

source: Step 1: Create an 'Agromet Service Category'
fr: Étape 1 : Créer une « catégorie de services agromet »

source: To create a service, navigate to the 'Snippets' section on the explorer menu and select 'Servies Categories' as below:
fr: Pour créer un service, accédez à la section « Extraits » du menu de l'explorateur et sélectionnez « Catégories de services » comme ci-dessous :

source: Click on 'Add service category' to create a new service.
fr: Cliquez sur « Ajouter une catégorie de service » pour créer un nouveau service.

source: Step 2: Create a Service Listing page
fr: Étape 2 : Créer une page de liste de services

source: A listing page is a page that holds a list of pages. For example, a Service Listing page would hold an agrometeorology service page, weather forecasting page, etc.
fr: Une page de liste est une page qui contient une liste de pages. Par exemple, une page de liste de services contiendrait une page de service d'agrométéorologie, une page de prévisions météorologiques, etc.

source: ![Services List Preview](../../_static/images/services/service_list_preview.png "Services List Preview")
fr: ![Aperçu de la liste des services](../../_static/images/services/service_list_preview.png "Aperçu de la liste des services")

source: Services List Preview
fr: Aperçu de la liste des services

source: This option will only appear if no service listing page already exists as there can only be on instance/occurrrence of a service listing page.
fr: Cette option n'apparaîtra que si aucune page de liste de services n'existe déjà, car il ne peut y avoir qu'une instance/occurrence d'une page de liste de services.

source: Select Service List Page from the type of pages provided.
fr: Sélectionnez Page de liste de services parmi le type de pages fournies.

source: ![Add Service List Page](../../_static/images/services/add_service_list.png "Add Service List Page")
fr: ![Ajouter une page de liste de services](../../_static/images/services/add_service_list.png "Ajouter une page de liste de services")

source: Add Service List Page
fr: Page Ajouter une liste de services

source: Provide a the page title and Heading and either save draft, publish or submit to moderation depending on your previlleges.
fr: Fournissez le titre et l'en-tête de la page et enregistrez le brouillon, publiez ou soumettez-le à la modération en fonction de vos préférences.

source: ![Add Service List Page](../../_static/images/services/service_list_page.png "Add Service List Page")
fr: ![Ajouter une page de liste de services](../../_static/images/services/service_list_page.png "Ajouter une page de liste de services")

source: Step 3: Create a service page
fr: Étape 3 : Créer une page de service

source: This will navigate to the list of pages under the home page including the service list page you just created. Hover over the the services listing page and click on 'add child page'.
fr: Cela mènera à la liste des pages sous la page d'accueil, y compris la page de liste de services que vous venez de créer. Passez la souris sur la page de liste des services et cliquez sur « Ajouter une page enfant ».

source: ![Add Service Page](../../_static/images/services/add_service.png "Add Service Page")
fr: ![Ajouter une page de service](../../_static/images/services/add_service.png "Ajouter une page de service")

source: Add Service Page
fr: Ajouter une page de service

source: ![Service Page Sections](../../_static/images/services/service_page_sections.png "Service Page Sections")
fr: ![Sections de la page de service](../../_static/images/services/service_page_sections.png "Sections de la page de service")

source: Service Page Sections
fr: Sections des pages de services

source: **Service Category** - selected from previously prepared service category in step 2.
fr: **Catégorie de service** - sélectionnée dans la catégorie de service précédemment préparée à l'étape 2.

source: **Banner Section** - this contains the banner image, title, subtitle and call to action button.
fr: **Section bannière** : elle contient l'image de la bannière, le titre, le sous-titre et le bouton d'appel à l'action.

source: ![Banner Sections](../../_static/images/services/banner_section.png "Banner Sections")
fr: ![Sections de bannière](../../_static/images/services/banner_section.png "Sections de bannière")

source: Banner Sections
fr: Sections de bannière

source: **Introduction Section** - this contains the introduction title, introduction image, introduction text and button.
fr: **Section d'introduction** : elle contient le titre d'introduction, l'image d'introduction, le texte d'introduction et le bouton.

source: ![Introduction Sections](../../_static/images/services/introduction_section.png "Introduction Sections")
fr: ![Sections d'introduction](../../_static/images/services/introduction_section.png "Sections d'introduction")

source: Introduction Sections
fr: Sections d'introduction

source: **What we do in this Service section** - entails the 'what we do' items and what we do button.
fr: **Ce que nous faisons dans cette section Service** - comprend les éléments « ce que nous faisons » et le bouton ce que nous faisons.

source: ![What we do Sections](../../_static/images/services/what_we_do_section.png "What we do Sections")
fr: ![Ce que nous faisons Sections](../../_static/images/services/what_we_do_section.png "Ce que nous faisons Sections")

source: What we do Sections
fr: Ce que nous faisons

source: **Projects Section** - This contains a description of the projects linked to the service being edited. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects and linking them to services.
fr: **Section Projets** - Elle contient une description des projets liés au service en cours d'édition. Veuillez vous référer à [Gérer les projets](./Manage-Projects) pour guider la création de projets et les lier aux services.

source: ![Projects Sections](../../_static/images/services/projects_section.png "Projects Sections")
fr: ![Sections Projets](../../_static/images/services/projects_section.png "Sections Projets")

source: Projects Sections
fr: Rubriques Projets

source: **Feature Block Items** - this section allows addition of a series of alternating blocks containing an image, title, description and call to action button.
fr: **Éléments de blocs de fonctionnalités** - cette section permet l'ajout d'une série de blocs alternés contenant une image, un titre, une description et un bouton d'appel à l'action.

source: ![Feature Block Sections](../../_static/images/services/feature_block_section.png "Projects Sections")
fr: ![Sections des blocs de fonctionnalités](../../_static/images/services/feature_block_section.png "Sections des projets")

source: Feature Block Sections
fr: Sections des blocs de fonctionnalités

source: **Youtube playlist** - this section enables selection of an existing youtube playlist with videos related to this service.
fr: **Playlist YouTube** - cette section permet de sélectionner une playlist YouTube existante avec des vidéos liées à ce service.

source: **Applications** - this section enables selection of an existing system applications related to this service.
fr: **Applications** - cette section permet de sélectionner une application système existante liée à ce service.

source: Projects, Events, News and Publications are linked to the service in their respective pages.
fr: Les projets, événements, actualités et publications sont liés au service dans leurs pages respectives.

source: ![Creating pages](../../_static/images/pages/page_hierarchy.png "Creating pages")
fr: ![Création de pages](../../_static/images/pages/page_hierarchy.png "Création de pages")

source: Creating pages
fr: Création de pages

source: The section below gives an overall guide on the concept of a page and managing pages together with their elements. However, if you would prefer a guide to manage specific pages refer to sections listed below.
fr: La section ci-dessous donne un guide général sur le concept de page et la gestion des pages avec leurs éléments. Cependant, si vous préférez un guide pour gérer des pages spécifiques, reportez-vous aux sections répertoriées ci-dessous.

source: Creating new pages
fr: Création de nouvelles pages

source: To create a new page, click … Actions and select the Add child page option. This creates a child page of the section you are currently in. In this case, a child page of the Breads page. The **Home Page** is the top most page in the hierarchy.
fr: Pour créer une nouvelle page, cliquez sur… Actions et sélectionnez l’option Ajouter une page enfant. Cela crée une page enfant de la section dans laquelle vous vous trouvez actuellement. Dans ce cas, une page enfant de la page Pains. La **page d'accueil** est la page la plus haute de la hiérarchie.

source: ![Creating pages](../../_static/images/pages/create_page.png "Creating pages")
fr: ![Création de pages](../../_static/images/pages/create_page.png "Création de pages")

source: Edit Existing pages
fr: Modifier les pages existantes

source: You can access an existing page's edit screen in three ways.
fr: Vous pouvez accéder à l'écran d'édition d'une page existante de trois manières.

source: First, by clicking … **Actions** and then select the Edit option from the dropdown.
fr: Tout d'abord, en cliquant sur … **Actions**, puis sélectionnez l'option Modifier dans la liste déroulante.

source: Second, by clicking the page's title if you are accessing the page from its **parent's Explorer page** or in search results.
fr: Deuxièmement, en cliquant sur le titre de la page si vous accédez à la page à partir de sa **page Explorateur parent** ou dans les résultats de recherche.

source: Last, if you are accessing the page from the Explorer page of its parent, you can **hover over the page** and then click Edit.
fr: Enfin, si vous accédez à la page depuis la page Explorateur de son parent, vous pouvez **survoler la page** puis cliquer sur Modifier.

source: On the edit screen, you can find the title of the page you are editing at the top of the page. If the page is already published, then you can find a link to the live version of the page at the top right of the page. To change the title of the page, click the title field and enter a new title.
fr: Sur l'écran d'édition, vous pouvez trouver le titre de la page que vous modifiez en haut de la page. Si la page est déjà publiée, vous pouvez trouver un lien vers la version live de la page en haut à droite de la page. Pour modifier le titre de la page, cliquez sur le champ de titre et saisissez un nouveau titre.

source: ![Edit pages](../../_static/images/pages/edit_page.png "Edit pages")
fr: ![Modifier les pages](../../_static/images/pages/edit_page.png "Modifier les pages")

source: Edit pages
fr: Modifier les pages

source: While on the edit screen, you can perform several actions, such as copying, moving, or deleting a page. To perform any of these actions, click … Actions at the top of the edit screen and select the applicable option from the dropdown.
fr: Sur l'écran d'édition, vous pouvez effectuer plusieurs actions, telles que copier, déplacer ou supprimer une page. Pour effectuer l'une de ces actions, cliquez sur… Actions en haut de l'écran d'édition et sélectionnez l'option applicable dans la liste déroulante.

source: Search Engine Optimization
fr: optimisation du moteur de recherche

source: To promote your page for search engine optimization, using the promote tab set the title tag and meta description. This will ecnourage web crawlers to correctly index your page and rank it higher in search results for related topics. Under the promote tab, the slug is created automatically from the page's initial title
fr: Pour promouvoir votre page pour l'optimisation des moteurs de recherche, à l'aide de l'onglet de promotion, définissez la balise de titre et la méta description. Cela encouragera les robots d'exploration Web à indexer correctement votre page et à la classer plus haut dans les résultats de recherche pour des sujets connexes. Sous l'onglet promouvoir, le slug est créé automatiquement à partir du titre initial de la page

source: ![Search Engine Optimization](../../_static/images/pages/seo.png "Search Engine Optimization")
fr: ![Optimisation des moteurs de recherche](../../_static/images/pages/seo.png "Optimisation des moteurs de recherche")

source: Create and edit comments
fr: Créer et modifier des commentaires

source: To toggle on commenting mode, click Comments at the top of the edit screen page. Once commenting mode is on, you can create a new comment or reply to a comment by hovering over any commentable field to reveal the add comment icon.
fr: Pour activer le mode commentaires, cliquez sur Commentaires en haut de la page de l'écran d'édition. Une fois le mode commentaire activé, vous pouvez créer un nouveau commentaire ou répondre à un commentaire en survolant n'importe quel champ commentable pour afficher l'icône d'ajout de commentaire.

source: ![Add comment](../../_static/images/pages/add_comment.png "Add comment")
fr: ![Ajouter un commentaire](../../_static/images/pages/add_comment.png "Ajouter un commentaire")

source: Add comment
fr: Ajouter un commentaire

source: If there is no pre-existing comment in the field, click the add comment icon to create a new comment. However, if there is an existing comment, clicking either the field button or the comment brings the comment thread into focus. This allows you to add new replies.
fr: S'il n'y a aucun commentaire préexistant dans le champ, cliquez sur l'icône Ajouter un commentaire pour créer un nouveau commentaire. Cependant, s'il existe un commentaire existant, cliquer sur le bouton de champ ou sur le commentaire met en évidence le fil de commentaires. Cela vous permet d'ajouter de nouvelles réponses.

source: ![Add comment](../../_static/images/pages/save_comment.png "Add comment")
fr: ![Ajouter un commentaire](../../_static/images/pages/save_comment.png "Ajouter un commentaire")

source: The arrow to the right of the comments icon shows the comment notifications panel, where you can enable or disable email notifications for other users' comments on the page.
fr: La flèche à droite de l'icône des commentaires affiche le panneau de notifications de commentaires, dans lequel vous pouvez activer ou désactiver les notifications par courrier électronique pour les commentaires des autres utilisateurs sur la page.

source: ![Reveal comment](../../_static/images/pages/reveal_comment.png "Reveal comment")
fr: ![Révéler le commentaire](../../_static/images/pages/reveal_comment.png "Révéler le commentaire")

source: Reveal comment
fr: Révéler le commentaire

source: You will always receive email notifications for threads you are part of, unless you opt out of all comment notifications in your account settings. All participants in a thread will receive email notifications for new replies, even if they no longer have permission to edit the page.
fr: Vous recevrez toujours des notifications par e-mail pour les fils de discussion dont vous faites partie, sauf si vous désactivez toutes les notifications de commentaires dans les paramètres de votre compte. Tous les participants à un fil de discussion recevront des notifications par e-mail pour les nouvelles réponses, même s'ils ne sont plus autorisés à modifier la page.

source: Manage Page History
fr: Gérer l'historique des pages

source: it is possible to retrieve a version of the content you previously saved as a draft or published. You can do this by hovering over a page on the Explorer page and clicking More from the resulting dropdown options. Alternatively, you can access the page history screen by clicking the History icon in the top-right corner when editing a page.
fr: il est possible de récupérer une version du contenu que vous avez précédemment enregistré en tant que brouillon ou publié. Vous pouvez le faire en survolant une page de la page Explorateur et en cliquant sur Plus dans les options déroulantes résultantes. Vous pouvez également accéder à l'écran d'historique de la page en cliquant sur l'icône Historique dans le coin supérieur droit lors de la modification d'une page.

source: ![Acess Page History](../../_static/images/pages/page_history.png "Access Page History")
fr: ![Accès à l'historique des pages](../../_static/images/pages/page_history.png "Accès à l'historique des pages")

source: Acess Page History
fr: Accéder à l’historique des pages
