Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: The migration process will commence by initially **identifying the current content of the pages, as well as identifying additional pages that may be relevant and determining any obsolete content**. Moreover, recommendations will be provided regarding optimal practices pertaining to wording, images, colors, and other related aspects. The manual migration of each page will be conducted in collaboration with departmental focal points to ensure efficient coordination.
fr: Le processus de migration commencera par **identifier initialement le contenu actuel des pages, ainsi que par l'identification des pages supplémentaires qui peuvent être pertinentes et par la détermination de tout contenu obsolète**. De plus, des recommandations seront fournies concernant les pratiques optimales concernant le libellé, les images, les couleurs et d'autres aspects connexes. La migration manuelle de chaque page sera réalisée en collaboration avec les points focaux départementaux pour assurer une coordination efficace.

source: **11. What support will be offered by WMO RAF?**
fr: **11. Quel soutien sera offert par l'OMM RAF ?**

source: Support on the operationalization of the ClimWeb cuts across:
fr: L’accompagnement à l’opérationnalisation du ClimWeb concerne :

source: Assessing Quality and interactivity of existing NMHS website
fr: Évaluation de la qualité et de l'interactivité du site Web existant du SMHN

source: Approach and present the ClimWeb to the NMHS. Integrate suggested feedback
fr: Approcher et présenter le ClimWeb au SMHN. Intégrer les commentaires suggérés

source: Identify departmental focal points for ClimWeb coordination including overall ClimWeb administrator
fr: Identifier les points focaux départementaux pour la coordination du ClimWeb, y compris l'administrateur général du ClimWeb

source: Installation and setup of ClimWeb in-premise servers/cloud servers
fr: Installation et configuration de serveurs ClimWeb sur site/serveurs cloud

source: Provision one-on-one training and capacity building to departmental focal points on configuration and customization of the ClimWeb and Website
fr: Fournir une formation individuelle et un renforcement des capacités aux points focaux départementaux sur la configuration et la personnalisation du ClimWeb et du site Web.

source: Provision of learning materials, documentations, and guides of the ClimWeb
fr: Fourniture de matériels d'apprentissage, de documentations et de guides du ClimWeb

source: Follow-up support in troubleshooting and resolving technical bugs
fr: Assistance de suivi dans le dépannage et la résolution des bugs techniques

source: This also includes the implementation of CAP Alerts, Georeferenced data visualization, email marketing, events, surveys, and user analytics integration.
fr: Cela inclut également la mise en œuvre d'alertes CAP, la visualisation de données géoréférencées, le marketing par e-mail, les événements, les enquêtes et l'intégration de l'analyse des utilisateurs.

source: **12. How does the ClimWeb work in low internet connectivity**
fr: **12. Comment fonctionne le ClimWeb en cas de faible connectivité Internet**

source: The ClimWeb is optimized for low bandwidth scenarios. This involves the minimisation of the use of large images, videos or heavy media files that might consume a significant amount of bandwidth. The ClimWeb also supports **caching mechanisms** that can help reduce the load on the server and improve the website’s performance. By enabling caching, static content can be stored on the user's device, reducing the need for repeated downloads, and enhancing the experience on low bandwidth connections.
fr: Le ClimWeb est optimisé pour les scénarios à faible bande passante. Cela implique de minimiser l’utilisation d’images, de vidéos ou de fichiers multimédias volumineux susceptibles de consommer une quantité importante de bande passante. Le ClimWeb prend également en charge des **mécanismes de mise en cache** qui peuvent aider à réduire la charge sur le serveur et à améliorer les performances du site Web. En activant la mise en cache, le contenu statique peut être stocké sur l'appareil de l'utilisateur, réduisant ainsi le besoin de téléchargements répétés et améliorant l'expérience sur les connexions à faible bande passante.

source: **13. Geo-referenced data visualization: What data sources and formats are supported?**
fr: **13. Visualisation de données géoréférencées : quelles sources de données et quels formats sont pris en charge ?**

source: An essential feature provided by the ClimWeb is its capability to **facilitate interactive visualization of georeferenced data**. This includes the ability to upload and visualize gridded data in formats such as NetCDF and GeoTIFF, as well as vector data in the form of points and polygons. The ClimWeb also supports the integration of CAP Alerts and enables the inclusion of data from external Web Map Service (WMS) sources for comprehensive data visualization.
fr: Une fonctionnalité essentielle fournie par le ClimWeb est sa capacité à **faciliter la visualisation interactive des données géoréférencées**. Cela inclut la possibilité de télécharger et de visualiser des données maillées dans des formats tels que NetCDF et GeoTIFF, ainsi que des données vectorielles sous forme de points et de polygones. Le ClimWeb prend également en charge l'intégration des alertes CAP et permet l'inclusion de données provenant de sources externes du service de cartographie Web (WMS) pour une visualisation complète des données.

source: **14. Can they use the CAP editor alone?**
fr: **14. Peuvent-ils utiliser l'éditeur CAP seul ?**

source: The CAP Editor has been developed to be flexible in its deployment options. It can be run independently as a **standalone application**, which is accessible at https://github.com/wmo-raf/cap-editor. Alternatively, it can be fully **integrated into the ClimWeb**, providing seamless management of CAP Alerts within the ClimWeb environment. More information about the integration and usage can be found at https://github.com/wmo-raf/nmhs-cms/wiki/Manage-CAP-Alerts.
fr: L'éditeur CAP a été développé pour être flexible dans ses options de déploiement. Il peut être exécuté indépendamment en tant qu'**application autonome**, accessible sur https://github.com/wmo-raf/cap-editor. Alternativement, il peut être entièrement **intégré au ClimWeb**, offrant ainsi une gestion transparente des alertes CAP au sein de l'environnement ClimWeb. Plus d'informations sur l'intégration et l'utilisation sont disponibles sur https://github.com/wmo-raf/nmhs-cms/wiki/Manage-CAP-Alerts.

source: ![ClimWeb Kit](../_static/images/home/cms_package_kit.jpg "ClimWeb Kit")
fr: ![Kit ClimWeb](../_static/images/home/cms_package_kit.jpg "Kit ClimWeb")

source: ClimWeb Kit
fr: Kit ClimWeb

source: The **template Content Management System** is available for any NMHS wishing to upgrade its website. This initiative was developed as part of targeted support for African NMHSs in their digital transformation journey. The template was presented to technical experts from NMHSs during a [training in early warning communications](https://public.wmo.int/en/resources/meteoworld/building-capacity-africa-achieve-early-warnings-all).
fr: Le **modèle de système de gestion de contenu** est disponible pour tout SMHN souhaitant mettre à niveau son site Web. Cette initiative a été développée dans le cadre d’un soutien ciblé aux SMHN africains dans leur parcours de transformation numérique. Le modèle a été présenté aux experts techniques des SMHN lors d'une [formation sur les communications d'alerte précoce](https://public.wmo.int/en/resources/meteoworld/building-capacity-africa-achieve-early-warnings-all).

source: ![Stepwise Approach](../_static/images/home/stepwise_approach.jpg "Stepwise Approach")
fr: ![Approche par étapes](../_static/images/home/stepwise_approach.jpg "Approche par étapes")

source: Stepwise Approach
fr: Approche par étapes

source: This new template offers:
fr: Ce nouveau modèle propose :

source: a customisable and modern design
fr: un design personnalisable et moderne

source: seamless marketing integrations
fr: intégrations marketing transparentes

source: a user-friendly CAP editor
fr: un éditeur CAP convivial

source: advanced climate data visualization tools for any NMHS seeking to upgrade its website.
fr: des outils avancés de visualisation des données climatiques pour tout SMHN cherchant à mettre à niveau son site Web.

source: It adopts **best practices in data visualization and hydro meteorological department and climate communications**. All components of the website are built on free and open-source standards allowing for collaboration and contribution.
fr: Il adopte les **meilleures pratiques en matière de visualisation des données, de service hydrométéorologique et de communication climatique**. Tous les composants du site Web sont construits sur des normes gratuites et open source permettant la collaboration et la contribution.

source: The CAP editor is expected to **increase the adoption of the Common Alerting Protocol in Africa**, key to increasing the reach of alerts, and their connectivity to broadcast, web and mobile networks. Africa remains one of the world's most vulnerable regions to climate change and increasing extremes. Increasing the protection of the population through improved climate and early warning communications is crucial.
fr: L'éditeur du CAP devrait **accroître l'adoption du protocole d'alerte commun en Afrique**, essentiel pour accroître la portée des alertes et leur connectivité aux réseaux de diffusion, Web et mobiles. L'Afrique reste l'une des régions du monde les plus vulnérables au changement climatique et à la multiplication des extrêmes. Il est crucial d’accroître la protection de la population grâce à de meilleures communications en matière de climat et d’alerte précoce.

source: Considerations during the design & development phase
fr: Considérations pendant la phase de conception et de développement

source: During the design and development phase, fundamental factors were taken into consideration to ensure the delivery of a Content Management System that would improve the efficiency of management.
fr: Au cours de la phase de conception et de développement, des facteurs fondamentaux ont été pris en compte pour garantir la livraison d'un système de gestion de contenu qui améliorerait l'efficacité de la gestion.

source: ![ClimWeb Features](../_static/images/home/features.jpg "ClimWeb Features")
fr: ![Fonctionnalités ClimWeb](../_static/images/home/features.jpg "Fonctionnalités ClimWeb")

source: ClimWeb Features
fr: Fonctionnalités du ClimWeb

source: It factored in:
fr: Il a pris en compte :

source: Well **defined content structure** and pages management,
fr: Bien **structure de contenu** et gestion des pages bien définies,

source: **User-friendly interface** with a modern look and feel
fr: **Interface conviviale** avec une apparence et une convivialité modernes

source: Great **user experience and ease** in locating content
fr: Excellente **expérience utilisateur et facilité** de localisation du contenu

source: A **decentralized ClimWeb architecture** was adopted to allow management of departmental sections by different user roles and allow for content moderation and publishing **workflows**. ![centralization](../_static/images/home/centralization.jpg "centralization")
fr: Une **architecture ClimWeb décentralisée** a été adoptée pour permettre la gestion des sections départementales par différents rôles d'utilisateur et permettre la modération du contenu et les **workflows** de publication. ![centralisation](../_static/images/home/centralization.jpg "centralisation")

source: centralization
fr: centralisation

source: Delivery and support
fr: Livraison et assistance

source: For a smooth and efficient delivery of the ClimWeb and customization of the website template to the NMHS, a step by step process will be adopted. The quality and interactivity of the website is first assessed followed by approaching and presenting the ClimWeb and integrating feedback. Thereafter, willing/potential members for support are identified together with a focal point for coordination. The ClimWeb is then installed and training on the configuration of ClimWeb and customization of the website conducted. Additionally, learning materials, documentations and guides are provided alongside follow-up support in troubleshooting
fr: Pour une livraison fluide et efficace du ClimWeb et une personnalisation du modèle de site Web au SMHN, un processus étape par étape sera adopté. La qualité et l'interactivité du site Web sont d'abord évaluées, puis l'approche et la présentation du ClimWeb et l'intégration des commentaires sont effectuées. Par la suite, les membres désireux/potentiels à soutenir sont identifiés ainsi qu'un point focal pour la coordination. Le ClimWeb est ensuite installé et une formation sur la configuration du ClimWeb et la personnalisation du site internet est réalisée. De plus, du matériel d'apprentissage, des documentations et des guides sont fournis ainsi qu'une assistance de suivi pour le dépannage.

source: ![ClimWeb Support](../_static/images/home/support.jpg "ClimWeb Support")
fr: ![Support ClimWeb](../_static/images/home/support.jpg "Support ClimWeb")

source: ClimWeb Support
fr: Prise en charge du ClimWeb

source: Core Components and Integrations
fr: Composants de base et intégrations

source: **User friendly website Content Management System**
fr: **Système de gestion de contenu de site Web convivial**

source: Modern look and design, mobile friendly.
fr: Look et design modernes, adaptés aux appareils mobiles.

source: Adopts best practices and designs benchmarked for weather and climate information dissemination for NMHSs in Africa.
fr: Adopte les meilleures pratiques et conceptions référencées pour la diffusion d’informations météorologiques et climatiques pour les SMHN en Afrique.

source: Easy to use and customise without technical skills.
fr: Facile à utiliser et à personnaliser sans compétences techniques.

source: Decentralised content management. Different staff can be assigned and manage different sections of the website.
fr: Gestion de contenu décentralisée. Différents employés peuvent être affectés et gérer différentes sections du site Web.

source: Defined content publishing workflows. Editors and moderators can be defined for every section of the website.
fr: Définir les workflows de publication de contenu. Des éditeurs et modérateurs peuvent être définis pour chaque section du site Web.

source: Embedding Multimedia Content - Youtube etc.
fr: Intégration de contenu multimédia - Youtube, etc.

source: **Cap Alerts Publishing**
fr: **Publication des alertes de plafond**

source: Modern Cap Editor with simple user friendly and mobile friendly CAP alert creation and management.
fr: Éditeur de casquettes moderne avec création et gestion d'alertes CAP simples, conviviales et adaptées aux appareils mobiles.

source: Moderated Publishing Workflow from CAP composer to approver, including commenting and email notification support.
fr: Flux de travail de publication modéré du compositeur du CAP à l'approbateur, y compris la prise en charge des commentaires et des notifications par courrier électronique.

source: Conforms to CAP Version 1.2 Standards.
fr: Conforme aux normes CAP version 1.2.

source: Search Engine Optimisation support to increase visibility and attract targeted traffic to an alert.
fr: Prise en charge de l’optimisation des moteurs de recherche pour augmenter la visibilité et attirer du trafic ciblé vers une alerte.

source: Support for Approval Workflow from composer to approver, including commenting and email notification support.
fr: Prise en charge du flux de travail d'approbation du compositeur à l'approbateur, y compris la prise en charge des commentaires et des notifications par courrier électronique.

source: Interoperable XML API of Alert List and Detail for integration with CAP Aggregators
fr: API XML interopérable de liste d'alerte et de détails pour l'intégration avec les agrégateurs CAP

source: Live CAP creation and editing preview.
fr: Aperçu de la création et de l'édition du CAP en direct.

source: Draw / Upload Polygon Functionality for Alert Area/Areas.
fr: Fonctionnalité de dessin/téléchargement de polygones pour les zones/zones d'alerte.

source: Alert to Alert/Alerts Reference Linkage.
fr: Lien de référence entre alerte et alerte/alertes.

source: **Events registrations and Integration with Online Meeting Platforms (Zoom)**
fr: **Inscriptions aux événements et intégration avec les plateformes de réunion en ligne (Zoom)**

source: Create event registration forms hosted on the website.
fr: Créez des formulaires d'inscription à des événements hébergés sur le site Web.

source: Automatically send invitation emails to users as they register to events from the website.
fr: Envoyez automatiquement des e-mails d'invitation aux utilisateurs lorsqu'ils s'inscrivent à des événements depuis le site Web.

source: Keep record of all your registrants for internal analysis.
fr: Gardez une trace de tous vos inscrits pour une analyse interne.

source: Allow users registering to events to also subscribe to your products.
fr: Permettez aux utilisateurs s’inscrivant à des événements de s’abonner également à vos produits.

source: **Interactive Georeferenced data visualisation**
fr: **Visualisation interactive de données géoréférencées**

source: Upload and visualise own gridded data (forecasts, advisories, climate data products) on a map.
fr: Téléchargez et visualisez vos propres données maillées (prévisions, avis, produits de données climatiques) sur une carte.

source: Upload and visualise vector data (Point, areas) on a map.
fr: Téléchargez et visualisez des données vectorielles (Point, zones) sur une carte.

source: Visualise own CAP alerts.
fr: Visualisez vos propres alertes CAP.

source: Visualise thematic/sectorial data products interactively.
fr: Visualisez les produits de données thématiques/sectorielles de manière interactive.

source: Integrate external data sources ( from Regional Centers, Global Producing Centers, Satellite, Google Earth Engine etc).
fr: Intégrer des sources de données externes (provenant de centres régionaux, de centres de production mondiaux, de satellites, de Google Earth Engine, etc.).

source: Provide a platform to support impact based forecasts, analysis and advisories.
fr: Fournir une plate-forme pour prendre en charge les prévisions, analyses et conseils basés sur l’impact.

source: **Email Marketing integration and user analytics**
fr: **Intégration du marketing par e-mail et analyse des utilisateurs**

source: Sign Up forms for users to subscribe to NMHSs products (using Mautic or Mailchimp).
fr: Formulaires d'inscription permettant aux utilisateurs de s'abonner aux produits du NMHS (en utilisant Mautic ou Mailchimp).

source: Analyse your email marketing users data.
fr: Analysez les données de vos utilisateurs de marketing par e-mail.

source: **Survey creation and results analysis**
fr: **Création d'enquêtes et analyse des résultats**

source: Create custom surveys hosted on own website.
fr: Créez des enquêtes personnalisées hébergées sur votre propre site Web.

source: Analyse results on interactive dashboards.
fr: Analysez les résultats sur des tableaux de bord interactifs.

source: **User analytics**
fr: **Analyse des utilisateurs**

source: User base breakdown (eg. by sectors, gender, geographic area, etc, from user database - email marketing software).
fr: Répartition de la base d'utilisateurs (par exemple par secteurs, sexe, zone géographique, etc., à partir de la base de données d'utilisateurs - logiciel de marketing par e-mail).

source: User satisfaction (from surveys) data and trends .
fr: Données et tendances sur la satisfaction des utilisateurs (à partir d'enquêtes).

source: Website traffic analytics (eg. google analytics) .
fr: Analyse du trafic du site Web (par exemple Google Analytics) .

source: System traffic analytics (eg. hazards watch) .
fr: Analyse du trafic du système (par exemple, surveillance des dangers) .

source: Social media analytics
fr: Analyse des médias sociaux

source: Mailing Integrations
fr: Intégrations de messagerie

source: Mautic
fr: Mautique

source: Mautic is an open-source alternative to Mailchimp.
fr: Mautic est une alternative open source à Mailchimp.

source: The aim of this package is to render a given Mautic Form on a Wagtail page, and send the submitted data to Mautic. Other Mautic functionalities might be added later as need arises.
fr: Le but de ce package est de restituer un formulaire Mautic donné sur une page Wagtail et d'envoyer les données soumises à Mautic. D'autres fonctionnalités Mautic pourraient être ajoutées ultérieurement selon les besoins.

source: For package developer guide visit [Wagtail Mautic Developer Guide](https://github.com/wmo-raf/wagtailmautic)
fr: Pour le guide du développeur de packages, visitez [Wagtail Mautic Developer Guide](https://github.com/wmo-raf/wagtailmautic)

source: Settings
fr: Paramètres

source: `NOTE`: This instructions assume you have knowledge of setting up Wagtail and configuring Mautic, as we don't cover the specifics.
fr: « REMARQUE » : ces instructions supposent que vous avez des connaissances sur la configuration de Wagtail et de Mautic, car nous n'abordons pas les détails.

source: Mautic Settings will be added to the Wagtail Admin Menu as below
fr: Les paramètres Mautic seront ajoutés au menu d'administration Wagtail comme ci-dessous

source: ![Navigation in Wagtail admin](../_static/images/mautic/locate_mautic_settings.png "Navigation in Wagtail admin")
fr: ![Navigation dans l'administrateur Wagtail](../_static/images/mautic/locate_mautic_settings.png "Navigation dans l'administrateur Wagtail")

source: Navigation in Wagtail admin
fr: Navigation dans l'administration Bergeronnette

source: Add in the URL for your Mautic instance (including the https://) to the Mautic Url field.
fr: Ajoutez l'URL de votre instance Mautic (y compris le https://) au champ Mautic Url.

source: ![Set Mautic Base Url](../_static/images/mautic/base_url.png "Set Mautic Base Url")
fr: ![Définir l'URL de base de Mautic](../_static/images/mautic/base_url.png "Définir l'URL de base de Mautic")

source: Set Mautic Base Url
fr: Définir l'URL de base de Mautic

source: You can use two methods for authentication:
fr: Vous pouvez utiliser deux méthodes d'authentification :

source: OAuth2 that requires client id and client secret from Mautic
fr: OAuth2 qui nécessite l'identifiant client et le secret client de Mautic

source: Basic Authentication that needs username and password. To use Basic Auth, you must enable this on Mautic Configuration
fr: Authentification de base nécessitant un nom d'utilisateur et un mot de passe. Pour utiliser Basic Auth, vous devez l'activer sur la configuration Mautic

source: Basic
fr: Basique

source: ![Basic](../_static/images/mautic/basic.png "Basic")
fr: ![Basique](../_static/images/mautic/basic.png "Basique")

source: To create a subscription page based on mautic integration, navigate to `Pages` on the left side panel, select Pages and click on add a child page to the home page by hovering over the homepage.
fr: Pour créer une page d'abonnement basée sur l'intégration Mautic, accédez à « Pages » dans le panneau latéral gauche, sélectionnez Pages et cliquez sur ajouter une page enfant à la page d'accueil en survolant la page d'accueil.

source: ![Add child Page](../_static/images/mautic/mautic_navigate.png "Add child Page")
fr: ![Ajouter une page enfant](../_static/images/mautic/mautic_navigate.png "Ajouter une page enfant")

source: Add child Page
fr: Ajouter une page enfant
