Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: ![Flex Page Sections](../../_static/images/flex_page/title_text.png "Flex Page Sections")
fr: ![Sections de page flexibles](../../_static/images/flex_page/title_text.png "Sections de page flexibles")

source: Title, Text and Image Block
fr: Bloc de titre, de texte et d'image

source: ![Flex Page Sections](../../_static/images/flex_page/title_text_image.png "Flex Page Sections")
fr: ![Sections de page flexibles](../../_static/images/flex_page/title_text_image.png "Sections de page flexibles")

source: Accordion Block ![Flex Page Sections](../../_static/images/flex_page/accordion.png "Flex Page Sections")
fr: Bloc Accordéon ![Sections de page flexibles](../../_static/images/flex_page/accordion.png "Sections de page flexibles")

source: Table Block ![Flex Page Sections](../../_static/images/flex_page/table.png "Flex Page Sections")
fr: Bloc de table ![Sections de page flexibles](../../_static/images/flex_page/table.png "Sections de page flexibles")

source: News
fr: Nouvelles

source: Creation of news
fr: Création de nouvelles

source: The creation of news follows the steps below:
fr: La création de news suit les étapes ci-dessous :

source: Create a news type
fr: Créer un type d'actualité

source: Create a news listing page
fr: Créer une page de liste d'actualités

source: Create a news page
fr: Créer une page d'actualités

source: News Creation Example Scenario
fr: Exemple de scénario de création d'actualités

source: Assume you would like to have news on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous souhaitiez avoir des nouvelles sur le site Web, la manière pratique de le faire en suivant les étapes ci-dessus serait :

source: Step 1: Create an news type
fr: Étape 1 : Créer un type d'actualité

source: To create a news type, navigate to the 'Snippets' section on the explorer menu and select 'News Types' as below:
fr: Pour créer un type d'actualité, accédez à la section « Extraits » du menu de l'explorateur et sélectionnez « Types d'actualités » comme ci-dessous :

source: ![News Explorer](../../_static/images/news/news_explorer.png "News Explorer")
fr: ![Explorateur d'actualités](../../_static/images/news/news_explorer.png "Explorateur d'actualités")

source: News Explorer
fr: Explorateur d'actualités

source: Click on 'Add news Type' to create a new news type.
fr: Cliquez sur « Ajouter un type d'actualité » pour créer un nouveau type d'actualité.

source: ![News Type](../../_static/images/news/add_news_type.png "News Type")
fr: ![Type d'actualités](../../_static/images/news/add_news_type.png "Type d'actualités")

source: News Type
fr: Type d'actualité

source: Provide news type name and choose an icon and save.
fr: Fournissez le nom du type d’actualité, choisissez une icône et enregistrez.

source: ![News Type](../../_static/images/news/news_type.png "News Type")
fr: ![Type d'actualité](../../_static/images/news/news_type.png "Type d'actualité")

source: Step 2: Create a news listing page
fr: Étape 2 : Créer une page de liste d'actualités

source: A listing page is a page that holds a list of pages. For example, a news Listing page would hold one or more news. It lists the banner, latest featured news and all other news.
fr: Une page de liste est une page qui contient une liste de pages. Par exemple, une page de liste d'actualités contiendrait une ou plusieurs actualités. Il répertorie la bannière, les dernières actualités en vedette et toutes les autres actualités.

source: ![News List Preview](../../_static/images/news/news_list_preview.png "News List Preview")
fr: ![Aperçu de la liste des actualités](../../_static/images/news/news_list_preview.png "Aperçu de la liste des actualités")

source: News List Preview
fr: Aperçu de la liste des actualités

source: This option will only appear if no news listing page already exists as there can only be on instance/occurrrence of a news listing page.
fr: Cette option n'apparaîtra que si aucune page de liste d'actualités n'existe déjà, car il ne peut y avoir qu'une seule instance/occurrence d'une page de liste d'actualités.

source: Select news List Page from the type of pages provided.
fr: Sélectionnez la page de liste d'actualités parmi le type de pages fournies.

source: ![Add News List Page](../../_static/images/news/add_news_list.png "Add News List Page")
fr: ![Ajouter une page de liste d'actualités](../../_static/images/news/add_news_list.png "Ajouter une page de liste d'actualités")

source: Add News List Page
fr: Ajouter une page de liste d'actualités

source: Provide a the page title, banner image, title, subtitle and call to action and either save draft, publish or submit to moderation depending on your previlleges.
fr: Fournissez le titre de la page, l'image de la bannière, le titre, le sous-titre et l'appel à l'action et enregistrez le brouillon, publiez ou soumettez-le à la modération en fonction de vos préférences.

source: ![Add News List Page](../../_static/images/news/news_list_page.png "Add News List Page")
fr: ![Ajouter une page de liste d'actualités](../../_static/images/news/news_list_page.png "Ajouter une page de liste d'actualités")

source: Step 3: Create a news page
fr: Étape 3 : Créer une page d'actualités

source: This will navigate to the list of pages under the home page including the news list page you just created. Hover over the the news listing page and click on 'add child page'.
fr: Cela mènera à la liste des pages sous la page d'accueil, y compris la page de liste d'actualités que vous venez de créer. Passez la souris sur la page de liste des actualités et cliquez sur « Ajouter une page enfant ».

source: ![Add news Page](../../_static/images/news/add_news.png "Add news Page")
fr: ![Ajouter une page d'actualités](../../_static/images/news/add_news.png "Ajouter une page d'actualités")

source: Add news Page
fr: Ajouter une page d'actualités

source: ![News Page Sections](../../_static/images/news/news_sections.png "News Page Sections")
fr: ![Sections de la page d'actualités](../../_static/images/news/news_sections.png "Sections de la page d'actualités")

source: News Page Sections
fr: Sections de la page d'actualités

source: The sections of a service page include:
fr: Les sections d'une page de service comprennent :

source: **News Type** - selected from previously prepared news type in step 1
fr: **Type d'actualité** - sélectionné parmi le type d'actualité précédemment préparé à l'étape 1

source: **Relevant Service** - selected from previously prepared service categories. Refer to [Create Services Categories Section](./Manage-Services#step-1-create-an-agromet-service-category) to create service categories.
fr: **Service pertinent** - sélectionné parmi les catégories de services préalablement préparées. Reportez-vous à la [Section Créer des catégories de services](./Manage-Services#step-1-create-an-agromet-service-category) pour créer des catégories de services.

source: **Relevant Projects** - select from previously prepared projects. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects.
fr: **Projets pertinents** - sélectionnez parmi les projets préalablement préparés. Veuillez vous référer à [Gérer les projets](./Manage-Projects) pour guider la création de projets.

source: **Post date** - the date the news was published
fr: **Date de publication** - la date à laquelle la nouvelle a été publiée

source: **Subtitle** - optional subtitle
fr: **Sous-titre** - sous-titre facultatif

source: **Body** - the body of the news
fr: **Corps** - le corps de l'actualité

source: **Tags** - tags related to the news
fr: **Tags** - tags liés à l'actualité

source: **Extra Links** - additional links
fr: **Liens supplémentaires** - liens supplémentaires

source: **Is featured** - If enabled, the news will appear as Featured news on the news listing page
fr: **Est en vedette** - Si cette option est activée, les actualités apparaîtront en tant qu'actualités en vedette sur la page de liste des actualités.

source: **Is visible on homepage** - If enabled, the news will appear in the homepage as an alert/latest update
fr: **Est visible sur la page d'accueil** - Si activé, les actualités apparaîtront sur la page d'accueil sous forme d'alerte/dernière mise à jour

source: To create additional news in the future you would need to begin from [Step 3: Create a news page](./Manage-news#step-3-create-a-news-page) if the desired news type is already defined.
fr: Pour créer des actualités supplémentaires à l'avenir, vous devrez commencer par [Étape 3 : Créer une page d'actualités](./Manage-news#step-3-create-a-news-page) si le type d'actualités souhaité est déjà défini.

source: Products
fr: Des produits

source: The creation of products follows the steps below:
fr: La création des produits suit les étapes ci-dessous :

source: Creation of a product and a service category
fr: Création d'une catégorie de produit et d'une catégorie de service

source: Creation of one or more product categories for each of the products
fr: Création d'une ou plusieurs catégories de produits pour chacun des produits

source: Creation of one or more product item types for each of the product categories
fr: Création d'un ou plusieurs types d'articles de produits pour chacune des catégories de produits

source: Creation of a product page that will serve all products for a specific category
fr: Création d'une page produit qui servira tous les produits d'une catégorie spécifique

source: Creation of one or more product items for a product page
fr: Création d'un ou plusieurs articles produit pour une page produit

source: Product Creation Example Scenario
fr: Exemple de scénario de création de produit

source: Assume you would like to have Dekadal Agromet Bulletin Products on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous souhaitiez avoir les produits du bulletin Dekadal Agromet sur le site Web, la manière pratique de le faire en suivant les étapes ci-dessus serait :

source: Step 1: Create an 'Agromet Service Category' and a 'Dekadal Agromet Bulletin' Product
fr: Étape 1 : Créer une « Catégorie de services Agromet » et un produit « Dekadal Agromet Bulletin »

source: To create a service, navigate to the 'Snippets' section on the explorer menu and select 'Servies' as below:
fr: Pour créer un service, accédez à la section « Extraits » du menu de l'explorateur et sélectionnez « Services » comme ci-dessous :

source: ![Services Explorer](../../_static/images/products/services_explorer.png "Services Explorer")
fr: ![Explorateur de services](../../_static/images/products/services_explorer.png "Explorateur de services")

source: Services Explorer
fr: Explorateur de services

source: Click on 'Add service' to create a new service.
fr: Cliquez sur « Ajouter un service » pour créer un nouveau service.

source: ![Services Category](../../_static/images/products/add_service_category.png "Services Category")
fr: ![Catégorie de services](../../_static/images/products/add_service_category.png "Catégorie de services")

source: Services Category
fr: Catégorie de services

source: Provide service category name and choose an icon and save.
fr: Fournissez le nom de la catégorie de service, choisissez une icône et enregistrez.

source: ![Services Category](../../_static/images/products/service_category.png "Services Category")
fr: ![Catégorie de services](../../_static/images/products/service_category.png "Catégorie de services")

source: To create a product, navigate to the 'Snippets' section on the explorer menu and select 'Products' as below:
fr: Pour créer un produit, accédez à la section « Extraits » du menu de l'explorateur et sélectionnez « Produits » comme ci-dessous :

source: ![Products Explorer](../../_static/images/products/products_explorer.png "Products Explorer")
fr: ![Explorateur de produits](../../_static/images/products/products_explorer.png "Explorateur de produits")

source: Products Explorer
fr: Explorateur de produits

source: Click on 'Add product' to create a new product.
fr: Cliquez sur 'Ajouter un produit' pour créer un nouveau produit.

source: ![Add Product](../../_static/images/products/add_product.png "Add Product")
fr: ![Ajouter un produit](../../_static/images/products/add_product.png "Ajouter un produit")

source: Add Product
fr: Ajouter un produit

source: Fill in the form providing the name of the product e.g Dekadal Agromet Bulletin
fr: Remplissez le formulaire en indiquant le nom du produit, par exemple Dekadal Agromet Bulletin

source: ![Add Product](../../_static/images/products/add_product_name.png "Add Product")
fr: ![Ajouter un produit](../../_static/images/products/add_product_name.png "Ajouter un produit")

source: Step 2: Creation of one or more product categories for each of the products
fr: Étape 2 : Création d'une ou plusieurs catégories de produits pour chacun des produits

source: Create a product category based on sections measured and reported in Dekadal Agrometeorology providing the name and icon e.g
fr: Créez une catégorie de produits basée sur les sections mesurées et rapportées dans Dekadal Agrometeorology en fournissant le nom et l'icône, par exemple

source: Category 1 - Weather Assessment
fr: Catégorie 1 – Évaluation météorologique

source: Category 2 - Agrometeorological conditions and impact on agriculture
fr: Catégorie 2 - Conditions agrométéorologiques et impact sur l'agriculture

source: Category 3 - Bulletin
fr: Catégorie 3 - Bulletin

source: ![Add Product](../../_static/images/products/add_product_categories.png "Add Product")
fr: ![Ajouter un produit](../../_static/images/products/add_product_categories.png "Ajouter un produit")

source: Category 1 and 2 can contain text and images and allows you to break down your bulletin into sharable sections while category 3 can hold the bulletin file/document for download by users. A preview of these categories to the public would appear as below on the website.
fr: Les catégories 1 et 2 peuvent contenir du texte et des images et vous permettent de diviser votre bulletin en sections partageables, tandis que la catégorie 3 peut contenir le fichier/document du bulletin à télécharger par les utilisateurs. Un aperçu de ces catégories au public apparaîtrait comme ci-dessous sur le site Web.

source: ![Add Product](../../_static/images/products/product_preview.png "Add Product")
fr: ![Ajouter un produit](../../_static/images/products/product_preview.png "Ajouter un produit")

source: Step 3: Creation of one or more product item types for each of the product categories
fr: Étape 3 : Création d'un ou plusieurs types d'articles de produits pour chacune des catégories de produits

source: For each of the three categories above, you can now add product item types e.g
fr: Pour chacune des trois catégories ci-dessus, vous pouvez désormais ajouter des types d'articles de produits, par exemple

source: **Category 1** - Weather Assessment
fr: **Catégorie 1** - Évaluation météorologique

source: |_ Rainfall Amount
fr: |_ Montant des précipitations

source: |_ Rainfall Anomaly
fr: |_ Anomalie de précipitations

source: |_ Moisture Condition
fr: |_ État d'humidité

source: **Category 2** - Agrometeorological conditions and impact on agriculture
fr: **Catégorie 2** - Conditions agrométéorologiques et impact sur l'agriculture

source: |_ Vegetation Condition & Impact on Agriculture
fr: |_ État de la végétation et impact sur l'agriculture

source: **Category 3** - Bulletin
fr: **Catégorie 3** - Bulletin

source: ![Add Product Item](../../_static/images/products/add_product_item_types.png "Add Product Item")
fr: ![Ajouter un article de produit](../../_static/images/products/add_product_item_types.png "Ajouter un article de produit")

source: Add Product Item
fr: Ajouter un article de produit

source: A preview of these product item types to the public would appear as below on the website.
fr: Un aperçu de ces types d'articles de produits destiné au public apparaîtra comme ci-dessous sur le site Web.

source: Step 4: Creation of a product page that will serve all products for a specific category
fr: Étape 4 : Création d'une page produit qui servira tous les produits d'une catégorie spécifique

source: Once a product, its categories and items have been defined, a product page can be created to hold all products linked to it. To create this, navigate to 'pages' in the explorer menu and click on products.
fr: Une fois un produit, ses catégories et ses articles définis, une page produit peut être créée pour contenir tous les produits qui y sont liés. Pour le créer, accédez aux « pages » dans le menu de l'explorateur et cliquez sur les produits.

source: ![Add Product Page](../../_static/images/products/add_product_page.png "Add Product Page")
fr: ![Ajouter une page produit](../../_static/images/products/add_product_page.png "Ajouter une page produit")

source: Add Product Page
fr: Ajouter une page produit

source: Click on the three dots and select 'Add child pages'
fr: Cliquez sur les trois points et sélectionnez « Ajouter des pages enfants »

source: ![Add Product Child Page](../../_static/images/products/add_product_child_page.png "Add Product Child Page")
fr: ![Ajouter une page enfant de produit](../../_static/images/products/add_product_child_page.png "Ajouter une page enfant de produit")

source: Add Product Child Page
fr: Ajouter une page enfant de produit

source: Choose the relevant service category and product as below. Fill in another necessary and optional inputs including an introduction section, introduction image and text that will appear at the top of the Dekadal Agromet Bulletin Page.
fr: Choisissez la catégorie de service et le produit appropriés comme ci-dessous. Remplissez d'autres entrées nécessaires et facultatives, y compris une section d'introduction, une image d'introduction et un texte qui apparaîtront en haut de la page du Bulletin Dekadal Agromet.

source: ![Add Product Child Page](../../_static/images/products/product_child_page.png "Add Product Child Page")
fr: ![Ajouter une page enfant de produit](../../_static/images/products/product_child_page.png "Ajouter une page enfant de produit")

source: Save draft / Publish page.
fr: Enregistrer le brouillon / Publier la page.

source: Step 5: Creation of one or more product items for a product page
fr: Étape 5 : Création d'un ou plusieurs articles produit pour une page produit

source: Add a product item by hovering over Dekadal Agromet Bulletin and selecting 'add child page'.
fr: Ajoutez un article de produit en survolant le Bulletin Dekadal Agromet et en sélectionnant « Ajouter une page enfant ».

source: ![Add Product Item](../../_static/images/products/product_item.png "Add Product Item")
fr: ![Ajouter un article de produit](../../_static/images/products/product_item.png "Ajouter un article de produit")

source: For example, you can add a product item for **1 - 10 June 2023** , by specifying the date, valid until and products.
fr: Par exemple, vous pouvez ajouter un article de produit pour la période du **1 au 10 juin 2023** en spécifiant la date, la validité jusqu'au et les produits.

source: ![Add Product Item Page](../../_static/images/products/product_item_page.png "Add Product Item Page")
fr: ![Ajouter une page d'article de produit](../../_static/images/products/product_item_page.png "Ajouter une page d'article de produit")

source: Add Product Item Page
fr: Page Ajouter un article de produit

source: The 'products' input accepts two options:
fr: L'entrée « produits » accepte deux options :

source: Map/Image Product
fr: Produit de carte/image

source: Document/Bulletin Product
fr: Produit de document/bulletin

source: ![Add Product Options](../../_static/images/products/product_options.png "Add Product Options")
fr: ![Ajouter des options de produit](../../_static/images/products/product_options.png "Ajouter des options de produit")

source: Add Product Options
fr: Ajouter des options de produit

source: An example of a product based on Map/Image product would be the type 'Rainfall Amount'
fr: Un exemple de produit basé sur un produit Carte/Image serait le type « Quantité de pluie ».

source: ![Add Product Options](../../_static/images/products/product_options_map_image.png "Add Product Options")
fr: ![Ajouter des options de produit](../../_static/images/products/product_options_map_image.png "Ajouter des options de produit")

source: An example of a product based on Document/Bulletin product would be the type 'Document'
fr: Un exemple de produit basé sur un produit Document/Bulletin serait le type « Document »

source: ![Add Product Options](../../_static/images/products/product_options_document.png "Add Product Options")
fr: ![Ajouter des options de produit](../../_static/images/products/product_options_document.png "Ajouter des options de produit")

source: When adding a new bulletin, you will only need to begin from Step 5: [Creation of one or more product items for a product page](Manage-Products#step-5-creation-of-one-or-more-product-items-for-a-product-page) section above to upload the document or any related text and images about a new period.
fr: Lors de l'ajout d'un nouveau bulletin, il vous suffira de commencer à partir de l'étape 5 : [Création d'un ou plusieurs éléments de produit pour une page produit](Gérer les produits#étape-5-création-d'un ou plusieurs-produits- articles-pour-une-page-produit) ci-dessus pour télécharger le document ou tout texte et image connexe concernant une nouvelle période.

source: Creation of Publications
fr: Création de publications

source: The creation of publications follows the steps below:
fr: La création des publications suit les étapes ci-dessous :

source: Create a publication type
fr: Créer un type de publication

source: Create a publication listing page
fr: Créer une page de liste de publications

source: Create a publication page
fr: Créer une page de publication

source: Publication Creation Example Scenario
fr: Exemple de scénario de création de publication

source: Assume you would like to have publication relating to Agrometeorology on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous souhaitiez publier une publication relative à l’agrométéorologie sur le site Web. La manière pratique de le faire en suivant les étapes ci-dessus serait :

source: Step 1: Create an publication type
fr: Étape 1 : Créer un type de publication

source: To create a publication type, navigate to the 'Snippets' section on the explorer menu and select 'Publication Types' as below:
fr: Pour créer un type de publication, accédez à la section « Extraits » du menu de l'explorateur et sélectionnez « Types de publication » comme ci-dessous :

source: ![Publications Explorer](../../_static/images/publications/publications_explorer.png "Publications Explorer")
fr: ![Explorateur de publications](../../_static/images/publications/publications_explorer.png "Explorateur de publications")

source: Publications Explorer
fr: Explorateur de publications

source: Click on 'Add Publication Type' to create a new publication type.
fr: Cliquez sur « Ajouter un type de publication » pour créer un nouveau type de publication.

source: ![Publications Type](../../_static/images/publications/add_publication_type.png "Publications Type")
fr: ![Type de publications](../../_static/images/publications/add_publication_type.png "Type de publications")

source: Publications Type
fr: Type de publication

source: Provide publication type name and choose an icon and save.
fr: Fournissez le nom du type de publication, choisissez une icône et enregistrez.

source: ![Publications Type](../../_static/images/publications/publication_type.png "Publications Type")
fr: ![Type de publications](../../_static/images/publications/publication_type.png "Type de publications")
