Repository: wmo-raf/climweb-docs
Catalog: docs/locale/*/LC_MESSAGES/_docs.po
Languages: fr

source: Under **Assign your workflow to pages**, you can see a list of the pages assigned to a workflow. All child pages take the same workflow as their parents. So if the root page of your site gets assigned to a workflow, it becomes the default workflow. You may remove a page from the workflow by clicking **Delete** at the right of each entry. Also, you can change the page in an entry to another by clicking **Choose another page.**
fr: Sous **Attribuer votre flux de travail aux pages**, vous pouvez voir une liste des pages attribuées à un flux de travail. Toutes les pages enfants suivent le même flux de travail que leurs parents. Ainsi, si la page racine de votre site est affectée à un workflow, elle devient le workflow par défaut. Vous pouvez supprimer une page du flux de travail en cliquant sur **Supprimer** à droite de chaque entrée. Vous pouvez également remplacer la page d'une entrée par une autre en cliquant sur **Choisir une autre page.**

source: The action menu at the bottom allows you to save your changes, or disable the workflow. Disabling a workflow cancels all pages currently in moderation in that workflow, and prevents others from starting it. If the workflow was previously disabled, then you get the option to enable it in the action menu.
fr: Le menu d'action en bas vous permet d'enregistrer vos modifications ou de désactiver le workflow. La désactivation d'un flux de travail annule toutes les pages actuellement en modération dans ce flux de travail et empêche les autres de le démarrer. Si le flux de travail a été précédemment désactivé, vous avez la possibilité de l'activer dans le menu d'action.

source: ![Edit Worklow](../../_static/images/workflows/edit_workflow.png "Edit Worklow")
fr: ![Modifier le workflow](../../_static/images/workflows/edit_workflow.png "Modifier le workflow")

source: Edit Worklow
fr: Modifier le flux de travail

source: Create and edit tasks
fr: Créer et modifier des tâches

source: To create a task, go to Settings > Workflows tasks from the Sidebar. This takes you to the Tasks interface, where you can see a list of the currently available tasks and which workflows use each task. Similar to workflows, you can click the name of an existing task to edit it. To add a new task, click Add a task.
fr: Pour créer une tâche, accédez à Paramètres > Tâches de flux de travail dans la barre latérale. Cela vous amène à l'interface Tâches, où vous pouvez voir une liste des tâches actuellement disponibles et quels flux de travail utilisent chaque tâche. Semblable aux flux de travail, vous pouvez cliquer sur le nom d'une tâche existante pour la modifier. Pour ajouter une nouvelle tâche, cliquez sur Ajouter une tâche.

source: ![Worklow Explorer](../../_static/images/workflows/workflow_tasks_explorer.png "Worklow Explorer")
fr: ![Explorateur Worklow](../../_static/images/workflows/workflow_tasks_explorer.png "Explorateur Worklow")

source: Worklow Explorer
fr: Explorateur de flux de travail

source: ![Worklow Task](../../_static/images/workflows/workflow_tasks.png "Worklow Tasks")
fr: ![Tâche Worklow](../../_static/images/workflows/workflow_tasks.png "Tâches Worklow")

source: Worklow Task
fr: Tâche de flux de travail

source: When creating a task, if you have multiple task types available, then they are offered to you as options. By default, only group approval tasks are available. By creating a group approval task, you are able to select one or multiple groups. Members of any of these, as well as administrators, will be able to approve or reject moderation for this task.
fr: Lors de la création d'une tâche, si plusieurs types de tâches sont disponibles, ils vous sont alors proposés en option. Par défaut, seules les tâches d'approbation de groupe sont disponibles. En créant une tâche d'approbation de groupe, vous pouvez sélectionner un ou plusieurs groupes. Les membres de l'un d'entre eux, ainsi que les administrateurs, pourront approuver ou refuser la modération de cette tâche.

source: ![Edit Worklow Task](../../_static/images/workflows/edit_workflow_task.png "Edit Worklow Task")
fr: ![Modifier la tâche du workflow](../../_static/images/workflows/edit_workflow_task.png "Modifier la tâche du workflow")

source: Edit Worklow Task
fr: Modifier la tâche du workflow

source: When editing a task, you may find that some fields, such as the name field, are uneditable. This is to ensure workflow history remains consistent. If you need to change the name of a task, then disable the old task, and create a new one with the name you need. Disabling a task causes any pages currently in moderation on that task to skip to the next task.
fr: Lors de la modification d'une tâche, vous constaterez peut-être que certains champs, tels que le champ de nom, ne sont pas modifiables. Cela permet de garantir que l’historique du flux de travail reste cohérent. Si vous devez modifier le nom d'une tâche, désactivez l'ancienne tâche et créez-en une nouvelle avec le nom dont vous avez besoin. La désactivation d'une tâche fait passer toutes les pages actuellement en modération sur cette tâche à la tâche suivante.

source: Managing Top Navigation
fr: Gestion de la navigation supérieure

source: ![Top Navbar](../../_static/images/menus/top_nav_preview.png "Top Navbar")
fr: ![Barre de navigation supérieure](../../_static/images/menus/top_nav_preview.png "Barre de navigation supérieure")

source: Top Navbar
fr: Barre de navigation supérieure

source: The menu items of the top navigation of the website can be added/edited or removed. to access the menu configurations in the ClimWeb, click on the settings and main menu on the left sidebar.
fr: Les éléments de menu de la navigation supérieure du site Web peuvent être ajoutés/modifiés ou supprimés. pour accéder aux configurations du menu dans le ClimWeb, cliquez sur les paramètres et le menu principal dans la barre latérale gauche.

source: ![Top Navbar](../../_static/images/menus/top_nav_explorer.png "Top Navbar")
fr: ![Barre de navigation supérieure](../../_static/images/menus/top_nav_explorer.png "Barre de navigation supérieure")

source: Depending on whether a child page allows for sub menu items or not the navbar dropdown will be displayed. Each menu item takes in a:
fr: Selon qu'une page enfant autorise ou non des éléments de sous-menu, la liste déroulante de la barre de navigation sera affichée. Chaque élément de menu comprend :

source: link to an internal page / link to a custom URL
fr: lien vers une page interne / lien vers une URL personnalisée

source: Option to append a value to the url
fr: Option pour ajouter une valeur à l'URL

source: The link display text
fr: Le texte affiché du lien

source: Handle (Use this field to optionally specify an additional value for each menu item, which you can then reference in custom menu templates.)
fr: Handle (Utilisez ce champ pour éventuellement spécifier une valeur supplémentaire pour chaque élément de menu, que vous pourrez ensuite référencer dans des modèles de menu personnalisés.)

source: Submenu visibility option
fr: Option de visibilité du sous-menu

source: ![Manage Menu Items](../../_static/images/menus/manage_menu_items.png "Manage Menu Items")
fr: ![Gérer les éléments du menu](../../_static/images/menus/manage_menu_items.png "Gérer les éléments du menu")

source: Manage Menu Items
fr: Gérer les éléments de menu

source: Managing Footer Navigation
fr: Gestion de la navigation dans le pied de page

source: ![Footer](../../_static/images/menus/footer_preview.png "Footer")
fr: ![Pied de page](../../_static/images/menus/footer_preview.png "Pied de page")

source: Footer
fr: Bas de page

source: Similarly, to configure the footer, select settings on the left sidebar and select flat menus instead.
fr: De même, pour configurer le pied de page, sélectionnez les paramètres dans la barre latérale gauche et sélectionnez plutôt les menus plats.

source: ![Footer](../../_static/images/menus/footer_explorer.png "Footer")
fr: ![Pied de page](../../_static/images/menus/footer_explorer.png "Pied de page")

source: Edit footer menu and add menu items. You can group pages by giving them the same handler name. For example, weekly forecast and monthly forecasts can be grouped in 'Products' handler.
fr: Modifiez le menu de pied de page et ajoutez des éléments de menu. Vous pouvez regrouper des pages en leur donnant le même nom de gestionnaire. Par exemple, les prévisions hebdomadaires et mensuelles peuvent être regroupées dans le gestionnaire « Produits ».

source: ![Edit Footer](../../_static/images/menus/edit_footer.png "Edit Footer")
fr: ![Modifier le pied de page](../../_static/images/menus/edit_footer.png "Modifier le pied de page")

source: Edit Footer
fr: Modifier le pied de page

source: All settings can be found at the settings menu on the left side-bar. *Scroll down if settings menu is not visible*.
fr: Tous les paramètres se trouvent dans le menu des paramètres sur la barre latérale gauche. *Faites défiler vers le bas si le menu des paramètres n'est pas visible*.

source: ![Settings explorer](../../_static/images/settings/settings_explorer.png "Settings explorer")
fr: ![Explorateur de paramètres](../../_static/images/settings/settings_explorer.png "Explorateur de paramètres")

source: Settings explorer
fr: Explorateur de paramètres

source: This section covers:
fr: Cette rubrique couvre :

source: Managing Organisation Settings
fr: Gestion des paramètres de l'organisation

source: Managing Themes
fr: Gestion des thèmes

source: Managing Integrations
fr: Gestion des intégrations

source: Managing Languages
fr: Gestion des langues

source: Managing Measurement Units
fr: Gestion des unités de mesure

source: Organisation settings include the logo, country, address, contact information and social media address (Twitter, Facebook, Youtube and Instagram)
fr: Les paramètres de l'organisation incluent le logo, le pays, l'adresse, les coordonnées et l'adresse des réseaux sociaux (Twitter, Facebook, Youtube et Instagram).

source: ![Organisation settings](../../_static/images/settings/settings_explorer.png "Organisation settings")
fr: ![Paramètres de l'organisation](../../_static/images/settings/settings_explorer.png "Paramètres de l'organisation")

source: Organisation settings
fr: Paramètres de l'organisation

source: The ClimWeb allows you to create/edit/delete a theme. You can also set a default theme which will be applied to all pages of the website.
fr: Le ClimWeb vous permet de créer/modifier/supprimer un thème. Vous pouvez également définir un thème par défaut qui sera appliqué à toutes les pages du site Web.

source: ![Themes](../../_static/images/settings/themes.png "Themes")
fr: ![Thèmes](../../_static/images/settings/themes.png "Thèmes")

source: Themes
fr: Thèmes

source: The theme configurations include theme name, theme colors, borders and shadows.
fr: Les configurations du thème incluent le nom du thème, les couleurs du thème, les bordures et les ombres.

source: ![Theme Detail](../../_static/images/settings/theme_detail.png "Theme Detail")
fr: ![Détail du thème](../../_static/images/settings/theme_detail.png "Détail du thème")

source: Theme Detail
fr: Détail du thème

source: The ClimWeb supports integrations with 3rd party softwares including Recaptcha, YouTube API, Mailchimp, Mautic, Zoom and Google analytics.
fr: Le ClimWeb prend en charge les intégrations avec des logiciels tiers, notamment Recaptcha, l'API YouTube, Mailchimp, Mautic, Zoom et Google Analytics.

source: ![Integrations](../../_static/images/settings/integrations.png "Integrations")
fr: ![Intégrations](../../_static/images/settings/integrations.png "Intégrations")

source: Integrations
fr: Intégrations

source: Multiple languages can be configured inorder to allow translation of the website by users to their prefered language. A language prefix and name is required and default state to specify the primary language the website is published in.
fr: Plusieurs langues peuvent être configurées afin de permettre la traduction du site Web par les utilisateurs dans leur langue préférée. Un préfixe et un nom de langue sont requis ainsi qu'un état par défaut pour spécifier la langue principale dans laquelle le site Web est publié.

source: ![Languages](../../_static/images/settings/manage_languages_explorer.png "Languages")
fr: ![Langues](../../_static/images/settings/manage_linguals_explorer.png "Langues")

source: Languages
fr: Langues

source: ![Languages](../../_static/images/settings/manage_languages.png "Languages")
fr: ![Langues](../../_static/images/settings/manage_linguals.png "Langues")

source: Users & Roles
fr: Utilisateurs et rôles

source: Manage Users
fr: gérer les utilisateurs

source: The ClimWeb allows several users to manage content in the admin interface. These users have roles, which determine the access rights they can exercise.
fr: Le ClimWeb permet à plusieurs utilisateurs de gérer le contenu dans l'interface d'administration. Ces utilisateurs ont des rôles qui déterminent les droits d'accès qu'ils peuvent exercer.

source: By default, there are 5 roles:
fr: Par défaut, il y a 5 rôles :

source: **Administrator** - This role has complete control over the ClimWeb and can perform tasks such as managing user accounts, creating and deleting pages, and modifying site settings.
fr: **Administrateur** : ce rôle a un contrôle total sur le ClimWeb et peut effectuer des tâches telles que la gestion des comptes d'utilisateurs, la création et la suppression de pages et la modification des paramètres du site.

source: **Moderator** - A moderator has the next level of access after an administrator. A moderator has access to creating drafts and publishing them.
fr: **Modérateur** - Un modérateur a le niveau d'accès suivant après un administrateur. Un modérateur a accès à la création de brouillons et à leur publication.

source: **Editor** - This role has the ability to create and edit content on the website. They can add and remove pages, modify existing content, and publish new content.
fr: **Éditeur** - Ce rôle a la capacité de créer et de modifier du contenu sur le site Web. Ils peuvent ajouter et supprimer des pages, modifier le contenu existant et publier du nouveau contenu.

source: **Forecaster** - This role provides accurate and timely weather forecasts for the region or area that the website serves.
fr: **Prévisionniste** : ce rôle fournit des prévisions météorologiques précises et opportunes pour la région ou la zone desservie par le site Web.

source: **CAP Composer** - role are authorized to view and create draft CAP alerts, but not to approve nor to publish final CAP alerts;
fr: **CAP Composer** - le rôle est autorisé à afficher et à créer des projets d'alertes CAP, mais pas à approuver ni à publier les alertes CAP finales ;

source: **CAP Approver** - role are authorized to view and create draft CAP alerts, and approve and publish CAP final alerts
fr: **Approbateur CAP** : le rôle est autorisé à afficher et à créer des projets d'alertes CAP, ainsi qu'à approuver et publier les alertes finales CAP.

source: Administrator
fr: Administrateur

source: An administrator has the highest level of access to the admin interface, and are able to perform all actions in the Admin interface. A common task of an administrator is to add, modify, or remove user profiles. As an administrator, you can add, modify, and remove users via the Users interface. To access the Users interface, go to Settings > Users from the Wagtail Sidebar.
fr: Un administrateur dispose du niveau d'accès le plus élevé à l'interface d'administration et peut effectuer toutes les actions dans l'interface d'administration. Une tâche courante d'un administrateur consiste à ajouter, modifier ou supprimer des profils utilisateur. En tant qu'administrateur, vous pouvez ajouter, modifier et supprimer des utilisateurs via l'interface Utilisateurs. Pour accéder à l'interface Utilisateurs, accédez à Paramètres > Utilisateurs dans la barre latérale Wagtail.

source: In the Users interface, you can see all of your users, their usernames, roles, and status. The status of a user can either be active or inactive. You can sort this listing either by Name or Username.
fr: Dans l'interface Utilisateurs, vous pouvez voir tous vos utilisateurs, leurs noms d'utilisateur, leurs rôles et leur statut. Le statut d'un utilisateur peut être actif ou inactif. Vous pouvez trier cette liste par nom ou par nom d'utilisateur.

source: ![Manage Users](../../_static/images/users_and_roles/manage_users.png "Manage Users")
fr: ![Gérer les utilisateurs](../../_static/images/users_and_roles/manage_users.png "Gérer les utilisateurs")

source: You can add a new user, using the 'add a user' button at the top right and assign them an email, username, first name, last name, password and role. Once the ClimWeb user logs in to their account they will be able to edit this information to their preference.
fr: Vous pouvez ajouter un nouvel utilisateur en utilisant le bouton « Ajouter un utilisateur » en haut à droite et lui attribuer un email, un nom d'utilisateur, un prénom, un nom, un mot de passe et un rôle. Une fois que l'utilisateur du ClimWeb se connectera à son compte, il pourra modifier ces informations selon ses préférences.

source: ![Add Users](../../_static/images/users_and_roles/add_user.png "Add Users")
fr: ![Ajouter des utilisateurs](../../_static/images/users_and_roles/add_user.png "Ajouter des utilisateurs")

source: Add Users
fr: Ajouter des utilisateurs

source: Select multiple users by checking the checkbox to the left of each user row, then use the bulk action bar at the bottom to perform an action on all selected users.
fr: Sélectionnez plusieurs utilisateurs en cochant la case à gauche de chaque ligne d'utilisateur, puis utilisez la barre d'action groupée en bas pour effectuer une action sur tous les utilisateurs sélectionnés.

source: ![Select Users](../../_static/images/users_and_roles/select_users.png "Select Users")
fr: ![Sélectionner des utilisateurs](../../_static/images/users_and_roles/select_users.png "Sélectionner des utilisateurs")

source: Select Users
fr: Sélectionnez les utilisateurs

source: Clicking on a user’s name opens their profile in an edit screen. From here, you can then edit that user's details. It is also possible to change users’ passwords from their edit screen, but it is worth encouraging your users to use the Forgotten password link on the login screen instead. This should save you some time!
fr: Cliquer sur le nom d’un utilisateur ouvre son profil dans un écran d’édition. À partir de là, vous pouvez modifier les détails de cet utilisateur. Il est également possible de modifier les mots de passe des utilisateurs à partir de leur écran d’édition, mais il vaut la peine d’encourager vos utilisateurs à utiliser plutôt le lien Mot de passe oublié sur l’écran de connexion. Cela devrait vous faire gagner du temps !

source: Managing Roles
fr: Gestion des rôles

source: To manage (add, edit, delete) roles, select from settings, groups as below. Each group corresponds to a role with permissions.
fr: Pour gérer (ajouter, modifier, supprimer) des rôles, sélectionnez parmi les paramètres et les groupes comme ci-dessous. Chaque groupe correspond à un rôle avec des autorisations.

source: ![Manage Roles](../../_static/images/users_and_roles/manage_roles.png "Manage Roles")
fr: ![Gérer les rôles](../../_static/images/users_and_roles/manage_roles.png "Gérer les rôles")

source: Manage Roles
fr: Gérer les rôles

source: ![List Roles](../../_static/images/users_and_roles/list_roles.png "List Roles")
fr: ![Liste des rôles](../../_static/images/users_and_roles/list_roles.png "Liste des rôles")

source: List Roles
fr: Répertorier les rôles

source: To edit a role and assign different permissions, click on the group. This will navigate to a seperate page where you can manage the permissions of the role.
fr: Pour modifier un rôle et attribuer différentes autorisations, cliquez sur le groupe. Cela mènera à une page séparée où vous pourrez gérer les autorisations du rôle.

source: ![Edit Roles](../../_static/images/users_and_roles/edit_role.png "Edit Roles")
fr: ![Modifier les rôles](../../_static/images/users_and_roles/edit_role.png "Modifier les rôles")

source: Edit Roles
fr: Modifier les rôles

source: Configure Settings
fr: Configurer les paramètres
