Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: **Feature Block Items** - this section allows addition of a series of alternating blocks containing an image, title, description and call to action button.
fr: ** Éléments de blocs de fonctions ** - Cette section permet l'ajout d'une série de blocs alternés contenant une image, un titre, une description et un bouton d'appel à l'action.

source: ![Feature Block Sections](../../_static/images/services/feature_block_section.png "Projects Sections")
fr: ! [Sections de blocs de fonctions] (../../_ statique / images / services / fonctionnalités_block_section.png "Projets sections")
sw: ! [Sehemu za kuzuia sehemu] (../../_ tuli/picha/huduma/kipengele_block_section.png "sehemu za miradi"))

source: Feature Block Sections
fr: Sections de blocs de fonctionnalités
sw: Sehemu za kuzuia sehemu

source: **Youtube playlist** - this section enables selection of an existing youtube playlist with videos related to this service.
fr: ** YouTube Playlist ** - Cette section permet la sélection d'une liste de lecture YouTube existante avec des vidéos liées à ce service.
sw: ** Orodha ya kucheza ya YouTube ** - Sehemu hii inawezesha uteuzi wa orodha ya kucheza ya YouTube iliyopo na video zinazohusiana na huduma hii.

source: **Applications** - this section enables selection of an existing system applications related to this service.
fr: ** Applications ** - Cette section permet la sélection des applications système existantes liées à ce service.
sw: ** Maombi ** - Sehemu hii inawezesha uteuzi wa programu zilizopo zinazohusiana na huduma hii.

source: Projects, Events, News and Publications are linked to the service in their respective pages.
fr: Les projets, les événements, les nouvelles et les publications sont liés au service dans leurs pages respectives.
sw: Miradi, hafla, habari na machapisho zinaunganishwa na huduma katika kurasa zao.

source: ![Creating pages](../../_static/images/pages/page_hierarchy.png "Creating pages")
fr: ! [Création de pages] (../../_ statique / images / pages / page_hierarchy.png "Création de pages")
sw: ! [Kuunda Kurasa] (../../_ tuli/picha/kurasa/ukurasa_hierarchy.png "Kuunda Kurasa")

source: Creating pages
fr: Création de pages
sw: Kuunda kurasa

source: The section below gives an overall guide on the concept of a page and managing pages together with their elements. However, if you would prefer a guide to manage specific pages refer to sections listed below.
fr: La section ci-dessous donne un guide global sur le concept d'une page et la gestion des pages avec leurs éléments. Cependant, si vous préférez un guide pour gérer des pages spécifiques, reportez-vous aux sections énumérées ci-dessous.
sw: Sehemu hapa chini inatoa mwongozo wa jumla juu ya wazo la ukurasa na kurasa za kusimamia pamoja na vitu vyao. Walakini, ikiwa ungependelea mwongozo wa kusimamia kurasa maalum rejea sehemu zilizoorodheshwa hapa chini.

source: Creating new pages
fr: Création de nouvelles pages
sw: Kuunda kurasa mpya

source: To create a new page, click … Actions and select the Add child page option. This creates a child page of the section you are currently in. In this case, a child page of the Breads page. The **Home Page** is the top most page in the hierarchy.
fr: Pour créer une nouvelle page, cliquez sur… Actions et sélectionnez l'option Ajouter une page Child. Cela crée une page enfant de la section dans laquelle vous vous trouvez actuellement. Dans ce cas, une page enfant de la page Breads. La ** page d'accueil ** est la plus haute page de la hiérarchie.
sw: Ili kuunda ukurasa mpya, bonyeza… Vitendo na uchague chaguo la Ukurasa wa Ongeza. Hii inaunda ukurasa wa watoto wa sehemu uliyonayo sasa. Katika kesi hii, ukurasa wa watoto wa ukurasa wa mikate. Ukurasa wa nyumbani ** ndio ukurasa wa juu zaidi katika uongozi.

source: ![Creating pages](../../_static/images/pages/create_page.png "Creating pages")
fr: ! [Création de pages] (../../_ statique / images / pages / create_page.png "Création de pages")
sw: ! [Kuunda Kurasa] (../../_ tuli/picha/kurasa/kuunda_page.png "Kuunda Kurasa")

source: Edit Existing pages
fr: Modifier les pages existantes
sw: Hariri kurasa zilizopo

source: You can access an existing page's edit screen in three ways.
fr: Vous pouvez accéder à l'édition de modification d'une page existante de trois manières.
sw: Unaweza kupata skrini ya hariri ya ukurasa uliopo kwa njia tatu.

source: First, by clicking … **Actions** and then select the Edit option from the dropdown.
fr: Tout d'abord, en cliquant sur… ** Actions **, puis sélectionnez l'option Modifier dans la liste déroulante.
sw: Kwanza, kwa kubonyeza… ** Vitendo ** na kisha uchague chaguo la Hariri kutoka kwa kushuka.

source: Second, by clicking the page's title if you are accessing the page from its **parent's Explorer page** or in search results.
fr: Deuxièmement, en cliquant sur le titre de la page si vous accédez à la page à partir de sa page Explorer de ** Parent ** ou dans les résultats de recherche.
sw: Pili, kwa kubonyeza kichwa cha ukurasa ikiwa unapata ukurasa huo kutoka kwa ukurasa wake wa mtoaji wa mzazi ** au katika matokeo ya utaftaji.

source: Last, if you are accessing the page from the Explorer page of its parent, you can **hover over the page** and then click Edit.
fr: Enfin, si vous accédez à la page à partir de la page Explorer de son parent, vous pouvez ** sur la page **, puis cliquez sur Modifier.
sw: Mwishowe, ikiwa unapata ukurasa kutoka kwa ukurasa wa Explorer wa mzazi wake, unaweza ** juu ya ukurasa ** na kisha bonyeza Hariri.

source: On the edit screen, you can find the title of the page you are editing at the top of the page. If the page is already published, then you can find a link to the live version of the page at the top right of the page. To change the title of the page, click the title field and enter a new title.
fr: Sur l'écran d'édition, vous pouvez trouver le titre de la page que vous modifiez en haut de la page. Si la page est déjà publiée, vous pouvez trouver un lien vers la version en direct de la page en haut à droite de la page. Pour modifier le titre de la page, cliquez sur le champ de titre et entrez un nouveau titre.
sw: Kwenye skrini ya hariri, unaweza kupata kichwa cha ukurasa unaohariri juu ya ukurasa. Ikiwa ukurasa tayari umechapishwa, basi unaweza kupata kiunga cha toleo la moja kwa moja la ukurasa upande wa juu wa ukurasa. Ili kubadilisha kichwa cha ukurasa, bonyeza uwanja wa kichwa na ingiza kichwa kipya.

source: ![Edit pages](../../_static/images/pages/Edit_page_1.png "Edit pages")
fr: ! [Modifier les pages] (../../_ statique / images / pages / edit_page_1.png "édition pages")
sw: ! [Hariri kurasa] (../../_ tuli/picha/kurasa/hariri_page_1.png "hariri kurasa")

source: Edit pages
fr: Modifier les pages
sw: Hariri kurasa

source: While on the edit screen, you can perform several actions, such as copying, moving, or deleting a page. To perform any of these actions, click … Actions at the top of the edit screen and select the applicable option from the dropdown.
fr: Pendant que sur l'écran d'édition, vous pouvez effectuer plusieurs actions, telles que la copie, le déplacement ou la suppression d'une page. Pour effectuer l'une de ces actions, cliquez sur… Actions en haut de l'écran d'édition et sélectionnez l'option applicable dans la liste déroulante.
sw: Wakati uko kwenye skrini ya hariri, unaweza kufanya vitendo kadhaa, kama kunakili, kusonga, au kufuta ukurasa. Ili kufanya yoyote ya vitendo hivi, bonyeza… Vitendo juu ya skrini ya Hariri na uchague chaguo linalotumika kutoka kwa kushuka.

source: Search Engine Optimization
fr: Optimisation des moteurs de recherche
sw: Utaftaji wa injini za utaftaji

source: To promote your page for search engine optimization, using the promote tab set the title tag and meta description. This will ecnourage web crawlers to correctly index your page and rank it higher in search results for related topics. Under the promote tab, the slug is created automatically from the page's initial title
fr: Pour promouvoir votre page pour l'optimisation des moteurs de recherche, en utilisant l'onglet promotion, définissez la balise de titre et la méta description. Cela éclatera les robots Web pour indexer correctement votre page et le classer plus haut dans les résultats de recherche pour des sujets connexes. Sous l'onglet Promouvoir, la limace est créée automatiquement à partir du titre initial de la page
sw: Ili kukuza ukurasa wako kwa utaftaji wa injini za utaftaji, kwa kutumia kichupo cha Kukuza Weka lebo ya kichwa na maelezo ya meta. Hii itaongeza watambaaji wa wavuti ili kuashiria kwa usahihi ukurasa wako na kuiweka juu katika matokeo ya utaftaji wa mada zinazohusiana. Chini ya kichupo cha kukuza, slug imeundwa moja kwa moja kutoka kwa kichwa cha ukurasa wa kwanza

source: ![Search Engine Optimization](../../_static/images/pages/Seo_1.png "Search Engine Optimization")
fr: ! [Optimisation des moteurs de recherche] (../../_ statique / images / pages / seo_1.png "Optimisation du moteur de recherche")
sw: ! [Utaftaji wa injini za utaftaji] (../../_ tuli/picha/kurasa/seo_1.png "Utaftaji wa injini za utaftaji"))

source: Create and edit comments
fr: Créer et modifier les commentaires
sw: Unda na hariri maoni

source: To toggle on commenting mode, click Comments at the top of the edit screen page. Once commenting mode is on, you can create a new comment or reply to a comment by hovering over any commentable field to reveal the add comment icon.
fr: Pour faire basculer le mode de commentaire, cliquez sur les commentaires en haut de la page Edit Screen. Une fois le mode de commentaire, vous pouvez créer un nouveau commentaire ou répondre à un commentaire en survolant n'importe quel champ commentable pour révéler l'icône Ajouter un commentaire.
sw: Ili kubadilisha hali ya maoni, bonyeza maoni juu ya ukurasa wa skrini ya Hariri. Mara tu hali ya kutoa maoni ikiwa imewashwa, unaweza kuunda maoni mpya au kujibu maoni kwa kusonga juu ya uwanja wowote wa maoni kufunua ikoni ya maoni.

source: ![Add comment](../../_static/images/pages/add_comment.png "Add comment")
fr: ! [Ajouter un commentaire] (../../_ statique / images / pages / add_comment.png "Ajouter un commentaire")
sw: ! [Ongeza maoni] (../../_ tuli/picha/kurasa/add_comment.png "ongeza maoni")

source: Add comment
fr: Ajouter des commentaires
sw: Ongeza maoni

source: If there is no pre-existing comment in the field, click the add comment icon to create a new comment. However, if there is an existing comment, clicking either the field button or the comment brings the comment thread into focus. This allows you to add new replies.
fr: S'il n'y a pas de commentaire préexistant dans le domaine, cliquez sur l'icône Ajouter un commentaire pour créer un nouveau commentaire. Cependant, s'il y a un commentaire existant, en cliquant sur le bouton de champ ou le commentaire met au point le fil de commentaire. Cela vous permet d'ajouter de nouvelles réponses.
sw: Ikiwa hakuna maoni yaliyokuwepo kwenye uwanja, bonyeza picha ya Ongeza maoni kuunda maoni mpya. Walakini, ikiwa kuna maoni yaliyopo, kubonyeza kitufe cha uwanja au maoni huleta nyuzi ya maoni. Hii hukuruhusu kuongeza majibu mapya.

source: ![Add comment](../../_static/images/pages/save_comment.png "Add comment")
fr: ! [Ajouter un commentaire] (../../_ statique / images / pages / sauve_comment.png "Ajouter un commentaire")
sw: ! [Ongeza maoni] (../../_ tuli/picha/kurasa/kuokoa_comment.png "ongeza maoni")

source: The arrow to the right of the comments icon shows the comment notifications panel, where you can enable or disable email notifications for other users' comments on the page.
fr: La flèche à droite de l'icône des commentaires montre le panneau de notifications de commentaires, où vous pouvez activer ou désactiver les notifications par e-mail pour les commentaires des autres utilisateurs sur la page.
sw: Mshale upande wa kulia wa ikoni ya maoni unaonyesha jopo la arifa za maoni, ambapo unaweza kuwezesha au kulemaza arifa za barua pepe kwa maoni ya watumiaji wengine kwenye ukurasa.

source: ![Reveal comment](../../_static/images/pages/reveal_comment.png "Reveal comment")
fr: ! [Révèlent commentaire] (../../_ statique / images / pages / révélation_comment.png "révéler comment")
sw: ! [Mfunuo maoni] (..

source: Reveal comment
fr: Révéler un commentaire
sw: Onyesha maoni

source: You will always receive email notifications for threads you are part of, unless you opt out of all comment notifications in your account settings. All participants in a thread will receive email notifications for new replies, even if they no longer have permission to edit the page.
fr: Vous recevrez toujours des notifications par e-mail pour les threads dont vous faites partie, à moins que vous ne choisissiez toutes les notifications de commentaires dans les paramètres de votre compte. Tous les participants à un fil recevront des notifications par e-mail pour de nouvelles réponses, même s'ils n'ont plus la permission de modifier la page.
sw: Utapokea arifa za barua pepe kila wakati kwa nyuzi ambazo ni sehemu yake, isipokuwa utachagua arifa zote za maoni katika mipangilio ya akaunti yako. Washiriki wote kwenye uzi watapokea arifa za barua pepe kwa majibu mapya, hata ikiwa hawana ruhusa ya kuhariri ukurasa.

source: Manage Page History
fr: Gérer l'historique des pages
sw: Dhibiti historia ya ukurasa

source: it is possible to retrieve a version of the content you previously saved as a draft or published. You can do this by hovering over a page on the Explorer page and clicking More from the resulting dropdown options. Alternatively, you can access the page history screen by clicking the History icon in the top-right corner when editing a page.
fr: Il est possible de récupérer une version du contenu que vous avez précédemment enregistré en tant que projet ou publié. Vous pouvez le faire en survolant une page sur la page Explorer et en cliquant davantage à partir des options déroulantes résultantes. Alternativement, vous pouvez accéder à l'écran de l'historique de la page en cliquant sur l'icône de l'historique dans le coin supérieur droit lors de la modification d'une page.
sw: Inawezekana kupata toleo la yaliyomo hapo awali kama rasimu au kuchapishwa. Unaweza kufanya hivyo kwa kusonga juu ya ukurasa kwenye ukurasa wa Explorer na kubonyeza zaidi kutoka kwa chaguzi zinazosababisha kushuka. Vinginevyo, unaweza kufikia skrini ya historia ya ukurasa kwa kubonyeza ikoni ya historia kwenye kona ya juu-kulia wakati wa kuhariri ukurasa.

source: ![Acess Page History](../../_static/images/pages/page_history.png "Access Page History")
fr: ! [Historique de la page d'access] (../../_ statique / images / pages / page_history.png "Historique de la page d'accès")

source: Acess Page History
fr: Historique de la page d'access
sw: Historia ya Ukurasa wa Acess

source: On the page's history screen, you can see all the actions previously done on that particular page and the users that carried out the actions. Also, you can see the date or time that the action occurred.
fr: Sur l'écran de l'historique de la page, vous pouvez voir toutes les actions effectuées précédemment sur cette page particulière et les utilisateurs qui ont effectué les actions. En outre, vous pouvez voir la date ou l'heure à laquelle l'action s'est produite.
sw: Kwenye skrini ya historia ya ukurasa, unaweza kuona vitendo vyote vilivyofanywa hapo awali kwenye ukurasa huo na watumiaji ambao walifanya vitendo. Pia, unaweza kuona tarehe au wakati ambao hatua hiyo ilitokea.

source: You can also search for specific versions of your content on the page history screen by applying a filter.
fr: Vous pouvez également rechercher des versions spécifiques de votre contenu sur l'écran de l'historique de la page en appliquant un filtre.
sw: Unaweza pia kutafuta matoleo maalum ya yaliyomo kwenye skrini ya historia ya ukurasa kwa kutumia kichujio.

source: ![View History](../../_static/images/pages/view_page_history.png "View Page History")
fr: ! [Affichage de l'histoire] (../../_ statique / images / pages / View_page_history.png "Historique de la page de la page")
sw: ! [Tazama historia] (../../_ tuli/picha/kurasa/view_page_history.png "Historia ya ukurasa"))

source: View History
fr: Voir l'histoire
sw: Angalia historia

source: If you want to compare different draft versions, hover over the draft and click Compare with previous version or Compare with current version.
fr: Si vous souhaitez comparer différentes versions provoquées, survolez le brouillon et cliquez sur Comparer avec la version précédente ou comparer la version actuelle.
sw: Ikiwa unataka kulinganisha matoleo tofauti ya rasimu, tembea juu ya rasimu na ubonyeze kulinganisha na toleo la zamani au kulinganisha na toleo la sasa.

source: To replace the current version of the draft with a previous version, hover over the preferred version of your draft on the page history screen and click Review this version. Then click Replace current version located at the bottom of the screen. This action appears as a Revert action on the page history screen and you can always go back to review it.
fr: Pour remplacer la version actuelle du projet par une version précédente, survolez la version préférée de votre brouillon sur l'écran de l'historique de la page et cliquez sur Revoir cette version. Cliquez ensuite sur Remplacer la version actuelle située en bas de l'écran. Cette action apparaît comme une action de retour sur l'écran de l'historique de la page et vous pouvez toujours revenir en revue.
sw: Ili kuchukua nafasi ya toleo la sasa la rasimu na toleo la zamani, zunguka toleo linalopendekezwa la rasimu yako kwenye skrini ya historia ya ukurasa na ubonyeze hakiki toleo hili. Kisha bonyeza Badilisha toleo la sasa lililo chini ya skrini. Kitendo hiki kinaonekana kama hatua ya kurudi kwenye skrini ya historia ya ukurasa na unaweza kurudi tena ili kuipitia.

source: ![Review Page Version](../../_static/images/pages/review_page_version.png "Review Page Version")
fr: ! [Version de la page de révision] (../../_ statique / images / pages / examen_page_version.png "Review page version")
sw: ! [Toleo la ukurasa wa hakiki] (../../_ tuli/picha/kurasa/hakiki_page_version.png "toleo la ukurasa wa ukaguzi"))

source: Review Page Version
fr: Version de la page de révision
sw: Mapitio ya ukurasa wa ukurasa

source: Workflow
fr: Flux de travail
sw: Mtiririko wa kazi

source: If the page is currently in a workflow, then you can see an additional indicator underneath the title showing the current workflow task. Clicking this shows more information about the page's progress through the workflow and any comments left by reviewers.
fr: Si la page est actuellement dans un workflow, vous pouvez voir un indicateur supplémentaire sous le titre montrant la tâche de workflow actuelle. Cliquez sur cela montre plus d'informations sur les progrès de la page via le flux de travail et les commentaires laissés par les critiques.
sw: Ikiwa ukurasa kwa sasa uko kwenye mtiririko wa kazi, basi unaweza kuona kiashiria cha ziada chini ya kichwa kinachoonyesha kazi ya sasa ya kazi. Kubonyeza hii inaonyesha habari zaidi juu ya maendeleo ya ukurasa kupitia mtiririko wa kazi na maoni yoyote yaliyoachwa na wahakiki.

source: If you have permission to perform moderation actions, for example, approval or requesting changes on the current task. In that case, you can see additional options in the action bar at the bottom of the page
fr: Si vous avez la permission d'effectuer des actions de modération, par exemple, l'approbation ou la demande de modifications sur la tâche actuelle. Dans ce cas, vous pouvez voir des options supplémentaires dans la barre d'action en bas de la page
sw: Ikiwa una ruhusa ya kufanya vitendo vya wastani, kwa mfano, idhini au kuomba mabadiliko kwenye kazi ya sasa. Katika hali hiyo, unaweza kuona chaguzi za ziada kwenye bar ya hatua chini ya ukurasa

source: Copy pages
fr: Copier les pages
sw: Kurasa za nakala

source: Sometimes, you don't need to create a new page from scratch. For example, you may have several pages that are similar in terms of structure but differ in content. In that case, you can copy an existing page and only change the required parts.
fr: Parfois, vous n'avez pas besoin de créer une nouvelle page à partir de zéro. Par exemple, vous pouvez avoir plusieurs pages similaires en termes de structure mais diffèrent en contenu. Dans ce cas, vous pouvez copier une page existante et ne modifier que les pièces requises.
sw: Wakati mwingine, hauitaji kuunda ukurasa mpya kutoka mwanzo. Kwa mfano, unaweza kuwa na kurasa kadhaa ambazo zinafanana katika suala la muundo lakini hutofautiana katika yaliyomo. Katika hali hiyo, unaweza kunakili ukurasa uliopo na ubadilishe tu sehemu zinazohitajika.

source: ![Copy Page](../../_static/images/pages/copy_page.png "Copy Page")
fr: ! [Page de copie] (../../_ statique / images / pages / copy_page.png "Page de copie")
sw: ! [Ukurasa wa nakala] (../../_ tuli/picha/kurasa/nakala_page.png "ukurasa wa nakala"))

source: Copy Page
fr: Page de copie
sw: Ukurasa wa nakala

source: To copy an existing page, hover over a page in an Explorer page, then click More and select Copy. Selecting Copy from the dropdown takes you to a form where you can enter the title and slug of the copy and also choose its parent page. You then get the option to publish the copy right away and an option to mark the copy as an alias of the original page. Once you have completed the form, click Copy this page.
fr: Pour copier une page existante, survolez une page dans une page Explorer, puis cliquez plus et sélectionnez Copier. La sélection de la copie dans la liste déroulante vous amène à un formulaire où vous pouvez saisir le titre et la lutte contre la copie et également choisir sa page parent. Vous obtenez ensuite l'option de publier la copie immédiatement et une option pour marquer la copie comme un alias de la page d'origine. Une fois que vous avez rempli le formulaire, cliquez sur Copier cette page.
sw: Ili kunakili ukurasa uliopo, tembea juu ya ukurasa katika ukurasa wa Explorer, kisha bonyeza zaidi na uchague Nakili. Chagua nakala kutoka kwa kushuka hukuchukua kwa fomu ambayo unaweza kuingiza kichwa na slug ya nakala na pia uchague ukurasa wake wa mzazi. Halafu unapata chaguo la kuchapisha nakala hiyo mara moja na chaguo la kuweka alama kama nakala ya ukurasa wa asili. Mara tu umekamilisha fomu, bonyeza Nakili Ukurasa huu.

source: ![Copy Page](../../_static/images/pages/copy_page_2.png "Copy Page")
fr: ! [Page de copie] (../../_ statique / images / pages / copy_page_2.png "Page de copie")
sw: ! [Ukurasa wa nakala] (../../_ tuli/picha/kurasa/nakala_page_2.png "ukurasa wa nakala")

source: Congratulations, you just copied a page. You can now find your copied page on the Explorer page.
fr: Félicitations, vous venez de copier une page. Vous pouvez maintenant trouver votre page copiée sur la page Explorer.
sw: Hongera, ulinakili ukurasa tu. Sasa unaweza kupata ukurasa wako ulionakiliwa kwenye ukurasa wa Explorer.

source: When copying a page, you have the option to mark it as an alias. The content of an aliased page always stays in sync with the original.
fr: Lors de la copie d'une page, vous avez la possibilité de le marquer comme un alias. Le contenu d'une page aliasée reste toujours en synchronisation avec l'original.
sw: Wakati wa kunakili ukurasa, unayo fursa ya kuiweka alama kama jina. Yaliyomo katika ukurasa ulioandaliwa daima hukaa katika kusawazisha na asili.
