Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: **Easy to Use:** One of the key features of Wagtail is its intuitive, user-friendly interface. This makes it easy for content editors to manage websites without having to learn the complexities and technicalities of the underlying framework.
fr: ** Facile à utiliser: ** L'une des principales caractéristiques de la bergeronnette est son interface intuitive et conviviale. Cela permet aux éditeurs de contenu de gérer facilement les sites Web sans avoir à apprendre les complexités et les détails techniques du cadre sous-jacent.
sw: ** Rahisi kutumia: ** Moja ya sifa muhimu za Wagtail ni interface yake ya kawaida, ya kirafiki. Hii inafanya iwe rahisi kwa wahariri wa yaliyomo kusimamia tovuti bila kuwa na kujifunza ugumu na ufundi wa mfumo wa msingi.

source: **Flexibility:** Wagtail is flexible when it comes to creating and managing websites. It allows for quick development of highly customized websites with complex layouts, content, and features, based on what the content editors need.
fr: ** La flexibilité: ** Câne de bergerons est flexible lorsqu'il s'agit de créer et de gérer des sites Web. Il permet un développement rapide de sites Web hautement personnalisés avec des mises en page complexes, du contenu et des fonctionnalités, en fonction de ce dont les éditeurs de contenu ont besoin.
sw: ** Kubadilika: ** Wagtail ni rahisi kubadilika linapokuja suala la kuunda na kusimamia tovuti. Inaruhusu maendeleo ya haraka ya wavuti zilizobinafsishwa sana na mpangilio tata, yaliyomo, na huduma, kulingana na kile wahariri wa yaliyomo wanahitaji.

source: **Extensibility:** Wagtail is designed to be easily extended with a wide variety of plugins, themes, components, and other features. This allows to add new features, customise the look and feel of their website, and extend the functionality of the ClimWeb.
fr: ** Extensibilité: ** La queue de chandelle est conçue pour être facilement étendue avec une grande variété de plugins, de thèmes, de composants et d'autres fonctionnalités. Cela permet d'ajouter de nouvelles fonctionnalités, de personnaliser l'apparence de leur site Web et d'étendre les fonctionnalités de l'escalade.
sw: ** Upanuzi: ** Wagtail imeundwa kupanuliwa kwa urahisi na anuwai ya programu -jalizi, mada, vifaa, na huduma zingine. Hii inaruhusu kuongeza huduma mpya, kubinafsisha sura na kuhisi ya wavuti yao, na kupanua utendaji wa Clipweb.

source: **Security:** Wagtail is designed with security in mind. It comes with Django's built-in security features such as user authentication, input validation, and protection against common attack methods.
fr: ** Sécurité: ** Colgail est conçu avec la sécurité à l'esprit. Il est livré avec les fonctionnalités de sécurité intégrées de Django telles que l'authentification des utilisateurs, la validation d'entrée et la protection contre les méthodes d'attaque courantes.
sw: ** Usalama: ** Wagtail imeundwa na usalama akilini. Inakuja na huduma za usalama zilizojengwa ndani ya Django kama uthibitishaji wa mtumiaji, uthibitisho wa pembejeo, na kinga dhidi ya njia za kawaida za shambulio.

source: **Scalability:** Being based on Django, Wagtail is designed to be highly scalable, making it an ideal choice for websites with large amounts of content and users. It can handle large amounts of data without any performance issues, allowing developers to create websites that can grow as their user base increases.
fr: ** Évolutivité: ** Étant basé sur Django, des bergeraises sont conçues pour être très évolutives, ce qui en fait un choix idéal pour les sites Web avec de grandes quantités de contenu et d'utilisateurs. Il peut gérer de grandes quantités de données sans aucun problème de performances, permettant aux développeurs de créer des sites Web qui peuvent se développer à mesure que leur base d'utilisateurs augmente.
sw: ** Scalability: ** Kwa kuzingatia Django, Wagtail imeundwa kuwa mbaya sana, na kuifanya kuwa chaguo bora kwa wavuti zilizo na kiwango kikubwa cha yaliyomo na watumiaji. Inaweza kushughulikia idadi kubwa ya data bila maswala yoyote ya utendaji, ikiruhusu watengenezaji kuunda tovuti ambazo zinaweza kukua kadiri msingi wa watumiaji unavyoongezeka.

source: **Enterprise features out of the box:** Wagtail includes user and group permissions, content and moderation workflows, reports, content editing history tracking, and other features that website administrators and teams need.
fr: ** Fonctionnalités d'entreprise Out of the Box: ** Wagtail comprend les autorisations d'utilisateur et de groupe, le contenu et les workflows de travail, les rapports, le suivi de l'historique d'édition de contenu et d'autres fonctionnalités dont les administrateurs et les équipes de site Web ont besoin.
sw: ** Vipengele vya Biashara nje ya sanduku: ** Wagtail ni pamoja na ruhusa za watumiaji na kikundi, yaliyomo na kazi za wastani, ripoti, ufuatiliaji wa historia ya yaliyomo, na huduma zingine ambazo wasimamizi wa wavuti na timu zinahitaji.

source: **Experience of the development team:** The current development team of the NMHSs ClimWeb has extensive experience in developing Wagtail and Django based projects. This makes it quick to implement new features and functionality
fr: ** Expérience de l'équipe de développement: ** L'équipe de développement actuelle du NMHSS Climweb possède une vaste expérience dans le développement de projets basés sur des bergeronnettes et des Django. Cela fait rapidement d'implémentation de nouvelles fonctionnalités et fonctionnalités
sw: ** Uzoefu wa timu ya maendeleo: ** Timu ya sasa ya maendeleo ya NMHSS Clipweb ina uzoefu mkubwa katika kukuza miradi ya wagtail na Django. Hii inafanya iwe haraka kutekeleza huduma mpya na utendaji

source: Development Approach
fr: Approche de développement
sw: Njia ya maendeleo

source: We use the Django/Wagtail modular approach of developing “Django applications” to provide a set of features and functionality. A Django/Wagtail application is a Python package that provides some set of features. Applications may be reused in various projects.
fr: Nous utilisons l'approche modulaire django / bergeronnette de développement des «applications Django» pour fournir un ensemble de fonctionnalités et de fonctionnalités. Une application Django / Worktail est un package Python qui fournit un ensemble de fonctionnalités. Les demandes peuvent être réutilisées dans divers projets.
sw: Tunatumia njia ya kawaida ya Django/Wagtail ya kukuza "Maombi ya Django" kutoa seti ya huduma na utendaji. Maombi ya Django/Wagtail ni kifurushi cha Python ambacho hutoa seti fulani za huduma. Maombi yanaweza kutumika tena katika miradi mbali mbali.

source: Applications include some combination of Django models, views, templates, template tags, static files, URLS, middleware etc. These are then wired to the project with INSTALLED_APPS settings. An application thus, in this context, is a set of code that interacts with various parts of the framework.
fr: Les applications incluent une combinaison de modèles Django, de vues, de modèles, de balises de modèle, de fichiers statiques, d'URL, de middleware, etc. Ceux-ci sont ensuite câblés au projet avec les paramètres installés_apps. Une application ainsi, dans ce contexte, est un ensemble de code qui interagit avec diverses parties du cadre.
sw: Maombi ni pamoja na mchanganyiko fulani wa mifano ya Django, maoni, templeti, vitambulisho vya template, faili za tuli, URL, middleware nk. Hizi basi zinafungwa kwa mradi na mipangilio ya kusanikishwa_apps. Maombi kwa hivyo, katika muktadha huu, ni seti ya nambari ambayo inaingiliana na sehemu mbali mbali za mfumo.

source: The NMHS ClimWeb is thus designed with a set of internal applications that provide functionality for different webpages of the functional website. These are organized under the pages directory of the ClimWeb source code. Each sub directory of the pages corresponds to a section on the website that can allows to create one or more related pages of that section
fr: Le NMHS Climweb est ainsi conçu avec un ensemble d'applications internes qui fournissent des fonctionnalités pour différentes pages Web du site Web fonctionnel. Ceux-ci sont organisés dans le cadre du répertoire des pages du code source de climages. Chaque sous-répertoire des pages correspond à une section du site Web qui peut permettre de créer une ou plusieurs pages connexes de cette section
sw: Clipweb ya NMHS kwa hivyo imeundwa na seti ya matumizi ya ndani ambayo hutoa utendaji kwa kurasa tofauti za wavuti ya kazi. Hizi zimepangwa chini ya saraka ya kurasa ya nambari ya chanzo cha Clipweb. Kila saraka ndogo ya kurasa inalingana na sehemu kwenye wavuti ambayo inaweza kuruhusu kuunda kurasa moja au zaidi zinazohusiana na sehemu hiyo

source: More specialized functionality is developed as external Wagtail applications that can be plugged into the code project. These are then installed as Python packages published on the Python Package Index (PyPI) , which is a repository of software for the Python programming language.
fr: Des fonctionnalités plus spécialisées sont développées en tant qu'applications externes à bergeronnerie qui peuvent être branchées sur le projet de code. Ceux-ci sont ensuite installés sous forme de packages Python publiés sur l'index de package Python (PYPI), qui est un référentiel de logiciels pour le langage de programmation Python.
sw: Utendaji maalum zaidi huandaliwa kama programu za nje za wagtail ambazo zinaweza kuingizwa kwenye mradi wa msimbo. Hizi basi zimewekwa kama vifurushi vya Python vilivyochapishwa kwenye Kielelezo cha Python Package (PYPI), ambayo ni kumbukumbu ya programu ya lugha ya programu ya Python.

source: Functionality Packages
fr: Packages de fonctionnalités
sw: Vifurushi vya utendaji

source: [CAP Composer:](https://github.com/wmo-raf/cap-composer) Common Alerting Protocol (CAP) composing and publishing tool that provides functionality to create and publish CAP formatted alerts.
fr: [CAP Composer:] (https://github.com/wmo-raf/cap-composer) outil de composition et de publication de protocole d'alerte commun (CAP) qui fournit des fonctionnalités pour créer et publier des alertes formatées CAP.

source: [Forecast Manager](https://github.com/wmo-raf/forecastmanager) – Interface for managing NMHSs City Forecasts
fr: [Gestionnaire de prévisions] (https://github.com/wmo-raf/forecastManager) - Interface pour gérer les prévisions de la ville de NMHSS
sw: [Meneja wa utabiri] (https://github.com/wmo-raf/forecastmanager)-Kiunganishi cha kusimamia utabiri wa jiji la NMHSS

source: [GeoManager](https://github.com/erick-otenyo/geomanager) - Provides an interactive interface for managing and publishing Geo-referenced (GIS) datasets
fr: [Geomomager] (https://github.com/erick-otenyo/geomanager) - fournit une interface interactive pour gérer et publier des ensembles de données géo-référencés (SIG)

source: [Administrative Boundary Manager:](https://github.com/erick-otenyo/adm-boundary-manager) Provides functionality to load, manage and visualize boundaries for a country
fr: [Directeur des limites administratives:] (https://github.com/erick-otenyo/adm-boundary-manager) fournit des fonctionnalités pour charger, gérer et visualiser les limites d'un pays

source: [WebStories Editor](https://github.com/erick-otenyo/wagtail-webstories-editor) - Provides functionality to create and publish [Google Web Stories](https://creators.google/en-us/content-creation-products/own-your-content/web-stories/)
fr: [Éditeur de WebStories] (https://github.com/erick-otenyo/wagtail-webstories-editor) - fournit des fonctionnalités pour créer et publier [Google Web Stories] (https://reators.google/en-us/content-cretion-productts/owat-yent/web-stories/)

source: [Surveys Creator](https://github.com/erick-otenyo/wagtail-surveyjs) – Provides functionality to create and publish surveys directly in the ClimWeb, visualization and analysis of the results using interactive graphics
fr: [Créateur des enquêtes] (https://github.com/erick-otenyo/wagtail-surveyjs) - fournit des fonctionnalités pour créer et publier des enquêtes directement dans l'escalade, la visualisation et l'analyse des résultats à l'aide de graphiques interactifs

source: Third party tools integration packages
fr: Packages d'intégration d'outils tiers
sw: Vifurushi vya Ujumuishaji wa Vyombo vya Tatu

source: [Mailchimp Integration:](https://github.com/erick-otenyo/wagtail-mailchimp-integration) Integrate [Mailchimp](https://mailchimp.com/) into Wagtail Projects
fr: [MailChimp Integration:] (https://github.com/erick-otenyo/wagtail-mailchimp-integration) Intégrer [MailChimp] (https://mailchimp.com/) dans des projets de berce-partout

source: [Mautic Integration:](https://github.com/erick-otenyo/wagtail-mautic-integration) Integration of [Mautic](https://www.mautic.org/) forms in Wagtail Projects.
fr: [Mautic Integration:] (https://github.com/erick-otenyo/wagtail-mautic-integration) Intégration de [Mautic] (https://www.moutic.org/) dans les projets en billewtail.

source: Online Meetings
fr: Réunions en ligne
sw: Mikutano ya mkondoni

source: [Zoom Integration:](https://github.com/erick-otenyo/wagtail-zoom-integration) Integrate [Zoom](https://zoom.us/) Events (meetings or webinars) registration to form pages created with Wagtail
fr: [Zoom Integration:] (https://github.com/erick-otenyo/wagtail-zoom-integration) Intégrer [zoom] (https://zoom.us/) Événements (réunions ou webinaires) Enregistrement pour former des pages créées avec Wagtail

source: User Interface Frameworks and Libraries
fr: Frameworks et bibliothèques d'interface utilisateur
sw: Mfumo wa Maingiliano ya Mtumiaji na Maktaba

source: Templating - [Django based templates](https://docs.djangoproject.com/en/5.0/topics/templates/)
fr: Templage - [Templates basés sur Django] (https://docs.djangoproject.com/en/5.0/topics/templates/)
sw: Templating - [templates za msingi wa django] (https://docs.djangoproject.com/en/5.0/topics/templates/)

source: CSS Framework - [Bulma](https://bulma.io/)
fr: Framework CSS - [Bulma] (https://bulma.io/)
sw: Mfumo wa CSS - [Bulma] (https://bulma.io/)

source: JavaScript Library - [JQuery](https://jquery.com/)
fr: Bibliothèque JavaScript - [jQuery] (https://jquery.com/)
sw: Maktaba ya JavaScript - [jQuery] (https://jquery.com/)

source: Web Mapping Library - [MapLibre GL JS](https://maplibre.org/)
fr: Bibliothèque de mappage Web - [Maplibre GL JS] (https://maplibre.org/)
sw: Maktaba ya Ramani ya Wavuti - [MAPLIBRE GL JS] (https://maplibre.org/)

source: SVG Icon Sources - [Font Awesome](https://fontawesome.com/) , [Ocha Humanitarian Icons](https://web.brand.unocha.org/svg-icon-library)
fr: Svg Icon Sources - [Font Awesome] (https://fontawesome.com/), [icônes humanitaires ocha] (https://web.brand.unocha.org/svg-icon-library)
sw: Vyanzo vya icon ya SVG-[font kushangaza] (https://fontawesome.com/), [ocha icons za kibinadamu] (https://web.brand.unocha.org/svg-icon-library)

source: Developing new functionality
fr: Développer de nouvelles fonctionnalités
sw: Kuendeleza utendaji mpya

source: A modular approach is used when developing new functionality to be included in the ClimWeb. The new functionality should be developed in isolation as a Wagtail Python package and published on PyPi for installation using Pip.
fr: Une approche modulaire est utilisée lors du développement de nouvelles fonctionnalités pour être incluses dans l'escalade. La nouvelle fonctionnalité doit être développée isolément en tant que package Python en bergeron et publiée sur PYPI pour l'installation à l'aide de PIP.
sw: Njia ya kawaida hutumiwa wakati wa kukuza utendaji mpya ili kujumuishwa kwenye kupanda. Utendaji mpya unapaswa kuendelezwa kwa kutengwa kama kifurushi cha Wagtail Python na kuchapishwa kwenye PYPI kwa usanikishaji kwa kutumia PIP.

source: We follow the following steps in general:
fr: Nous suivons les étapes suivantes en général:
sw: Tunafuata hatua zifuatazo kwa ujumla:

source: Explore existing packages in the Wagtail/Django community that provide similar functionality.
fr: Explorez les forfaits existants dans la communauté des bergeronnettes / Django qui offrent des fonctionnalités similaires.
sw: Chunguza vifurushi vilivyopo kwenye jamii ya Wagtail/Django ambayo hutoa utendaji sawa.

source: If an existing package exists and cannot be directly integrated into the ClimWeb, we try to customize as much as we can on top of this package, to make it interoperable. Otherwise, we use it directly
fr: Si un package existant existe et ne peut pas être directement intégré dans l'escalade, nous essayons de personnaliser autant que possible en plus de ce package, pour le rendre interopérable. Sinon, nous l'utilisons directement
sw: Ikiwa kifurushi kilichopo kinapatikana na hakiwezi kuunganishwa moja kwa moja kwenye ClimWeb, tunajaribu kubinafsisha kadri tuwezavyo juu ya kifurushi hiki, ili kuifanya iweze kushirikiana. Vinginevyo, tunatumia moja kwa moja

source: If we cannot find existing packages, then we develop the package from scratch. The idea is to avoid reinvention of the wheel where possible.
fr: Si nous ne trouvons pas les packages existants, nous développons le package à partir de zéro. L'idée est d'éviter la réinvention de la roue dans la mesure du possible.
sw: Ikiwa hatuwezi kupata vifurushi vilivyopo, basi tunaendeleza kifurushi kutoka mwanzo. Wazo ni kuzuia urekebishaji wa gurudumu inapowezekana.

source: Production Deployment
fr: Déploiement de la production
sw: Kupelekwa kwa uzalishaji

source: [Docker](https://www.docker.com/) is used to containerize the different components of the ClimWeb.
fr: [Docker] (https://www.docker.com/) est utilisé pour conteneuriser les différents composants de l'escalade.
sw: [Docker] (https://www.docker.com/) hutumiwa kuweka vifaa tofauti vya kupanda.

source: Other containers used include
fr: Les autres conteneurs utilisés comprennent
sw: Vyombo vingine vinavyotumiwa ni pamoja na

source: [PostgreSQL](https://github.com/postgis/docker-postgis) with PostGIS extension as the database
fr: [PostgreSQL] (https://github.com/postgis/docker-postgis) avec extension PostGis comme base de données
sw: [PostgreSQL] (https://github.com/postgis/docker-postgis) na ugani wa postgis kama hifadhidata

source: [Nginx](https://hub.docker.com/_/nginx) as the webserver and web proxy
fr: [Nginx] (https://hub.docker.com/_/nginx) en tant que serveur Web et proxy Web
sw: [Nginx] (https://hub.docker.com/_/nginx) kama webserver na wakala wa wavuti

source: [Memcached](https://hub.docker.com/_/memcached) as the caching system for web requests
fr: [Memcached] (https://hub.docker.com/_/memcached) comme système de mise en cache pour les demandes Web
sw: [Memcached] (https://hub.docker.com/_/memcached) kama mfumo wa caching kwa maombi ya wavuti

source: [Eclipse Mosquitto](https://hub.docker.com/_/eclipse-mosquitto) as the MQTT message broker. Mainly used for CAP alerts messaging
fr: [Eclipse Mosquitto] (https://hub.docker.com/_/eclipse-mosquitto) en tant que courtier de messages MQTT. Messagerie principalement utilisée pour les alertes CAP
sw: [Eclipse Mosquitto] (https://hub.docker.com/_/eclipse-mosquitto) kama broker ya ujumbe wa MQTT. Inatumika hasa kwa ujumbe wa arifu za cap

source: These are put into a docker compose configuration file, used to deploy the project using Docker Compose.
fr: Ceux-ci sont placés dans un fichier de configuration Docker Compose, utilisé pour déployer le projet à l'aide de Docker Compose.
sw: Hizi zinawekwa kwenye faili ya usanidi wa Docker, inayotumika kupeleka mradi kwa kutumia Docker Compose.

source: An initialization repository is provided that brings together all the different components into one project. This can be accessed at [https://github.com/wmo-raf/nmhs-cms-init](https://github.com/wmo-raf/nmhs-cms-init) . An installation guide is provided in the README file of the repository.
fr: Un référentiel d'initialisation est prévu qui rassemble tous les différents composants dans un seul projet. Ceci peut être accessible sur [https://github.com/wmo-raf/nmhs-cms-nit DMAD (https://github.com/wmo-raf/nmhs-cms-init). Un guide d'installation est fourni dans le fichier ReadMe du référentiel.
sw: Jalada la uanzishaji hutolewa ambalo huleta pamoja vifaa vyote tofauti katika mradi mmoja. Hii inaweza kupatikana katika [https://github.com/wmo-raf/nmhs-cms-ninit ahreattts://github.com/wmo-raf/nmhs-cms-ninit). Mwongozo wa ufungaji hutolewa katika faili ya ReadMe ya hazina.

source: Managing Updates
fr: Gérer les mises à jour
sw: Kusimamia sasisho

source: New releases with bug fixes and feature updates are periodically published on the [nmhs-cms repository releases](https://github.com/wmo-raf/nmhs-cms/releases).
fr: Les nouvelles versions avec les corrections de bogues et les mises à jour des fonctionnalités sont publiées périodiquement sur les versions du référentiel [NMHS-CMS] (https://github.com/wmo-raf/nmhs-cms/releases).
sw: Matoleo mapya na marekebisho ya mdudu na sasisho za kipengele huchapishwa mara kwa mara kwenye toleo la [NMHS-CMS Repository] (https://github.com/wmo-raf/nmhs-cms/releases).

source: When there is a new release, The ClimWeb Admin interface will show a message indicating that there is a new release. The Website administrator can then choose to upgrade to the new version, after going through the release notes that accompany every release.
fr: Lorsqu'il y a une nouvelle version, l'interface d'administration de Climpweb affichera un message indiquant qu'il y a une nouvelle version. L'administrateur du site Web peut ensuite choisir de passer à la nouvelle version, après avoir parcouru les notes de publication qui accompagnent chaque version.
sw: Wakati kuna kutolewa mpya, interface ya msimamizi wa ClipWeb itaonyesha ujumbe unaoonyesha kuwa kuna kutolewa mpya. Msimamizi wa wavuti anaweza kuchagua kusasisha kwa toleo jipya, baada ya kupitia maelezo ya kutolewa ambayo yanaambatana na kila kutolewa.

source: The upgrade is through a click of a button, that triggers a docker build process with the new versions. Once the new version is built successfully, the container is restarted with the new version effected.
fr: La mise à niveau se fait par un clic de bouton, qui déclenche un processus de construction Docker avec les nouvelles versions. Une fois la nouvelle version construite avec succès, le conteneur est redémarré avec la nouvelle version effectuée.
sw: Sasisho ni kupitia kubonyeza kitufe, ambacho husababisha mchakato wa ujenzi wa Docker na matoleo mapya. Mara tu toleo jipya likijengwa kwa mafanikio, chombo kinaanzishwa tena na toleo jipya lililotekelezwa.

source: ![ClimWeb Update Button](../_static/images/technology/upgrade_button.png "ClimWeb Upgrade Button")
fr: ! [Bouton de mise à jour de Climweb] (../_ statique / images / technologie / upgrade_button.png "Bouton de mise à niveau de Climweb")

source: ClimWeb Update Button
fr: Bouton de mise à jour de l'entraînement
sw: Kitufe cha sasisho la kupanda

source: In rare cases where the automatic build trigger fails, the system admins are trained to manually perform the upgrade
fr: Dans de rares cas où le déclencheur de construction automatique échoue, les administrateurs du système sont formés pour effectuer manuellement la mise à niveau
sw: Katika hali adimu ambapo trigger ya ujenzi wa moja kwa moja inashindwa, washirika wa mfumo hufundishwa kufanya sasisho kwa mikono

source: Security in Django/Wagtail
fr: Sécurité à Django / Seconde
sw: Usalama katika Django/Wagtail
