Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: The Image type is used to include an image or video in the survey for presentation purposes only. This type does not generate a value to be saved in the survey results.
fr: Le type d'image est utilisé pour inclure une image ou une vidéo dans l'enquête à des fins de présentation uniquement. Ce type ne génère pas de valeur à enregistrer dans les résultats de l'enquête.
sw: Aina ya picha hutumiwa kujumuisha picha au video kwenye uchunguzi kwa madhumuni ya uwasilishaji tu. Aina hii haitoi thamani ya kuokolewa katika matokeo ya uchunguzi.

source: The HTML type can be used to format text, include links, and insert media or custom elements into the survey. This type is solely for presentation purposes and does not produce a value to be saved in the survey results. However, it is important to note that HTML content can be susceptible to security breaches. Therefore, make sure that any links inserted lead to trusted resources.
fr: Le type HTML peut être utilisé pour formater du texte, inclure des liens et insérer des supports ou des éléments personnalisés dans l'enquête. Ce type est uniquement à des fins de présentation et ne produit pas de valeur à enregistrer dans les résultats de l'enquête. Cependant, il est important de noter que le contenu HTML peut être sensible aux violations de sécurité. Par conséquent, assurez-vous que les liens insérés conduisent à des ressources de confiance.
sw: Aina ya HTML inaweza kutumika kuunda maandishi, ni pamoja na viungo, na kuingiza media au vitu maalum kwenye uchunguzi. Aina hii ni kwa madhumuni ya uwasilishaji na haitoi dhamana ya kuokolewa katika matokeo ya uchunguzi. Walakini, ni muhimu kutambua kuwa yaliyomo ya HTML yanaweza kuhusika na uvunjaji wa usalama. Kwa hivyo, hakikisha kwamba viungo vyovyote vilivyoingizwa vinaongoza kwa rasilimali zinazoaminika.

source: The Expression type is used to calculate values and present them to respondents. It can be utilized to sum up scores of previous responses, display current date and time, find an average value, and so on. The calculated value is then saved in the survey results. In the example image provided, the Expression type concatenates the first and last names to display a full name. To define an expression in a survey question, type it into the Expression field found in the General category. Your expression can refer to other survey questions (such as {question1} + {question2}) or use pre-built calculation functions.
fr: Le type d'expression est utilisé pour calculer les valeurs et les présenter aux répondants. Il peut être utilisé pour résumer les scores des réponses précédentes, afficher la date et l'heure actuelles, trouver une valeur moyenne, etc. La valeur calculée est ensuite enregistrée dans les résultats de l'enquête. Dans l'exemple d'image fournie, le type d'expression concatène les prénoms et les noms de famille pour afficher un nom complet. Pour définir une expression dans une question d'enquête, tapez-la dans le champ d'expression trouvé dans la catégorie générale. Votre expression peut se référer à d'autres questions d'enquête (telles que {question1} + {question2}) ou utiliser des fonctions de calcul pré-construites.
sw: Aina ya kujieleza hutumiwa kuhesabu maadili na kuwasilisha kwa washiriki. Inaweza kutumiwa kumaliza alama za majibu ya zamani, kuonyesha tarehe na wakati wa sasa, kupata thamani ya wastani, na kadhalika. Thamani iliyohesabiwa basi imehifadhiwa katika matokeo ya uchunguzi. Katika mfano wa picha iliyotolewa, aina ya kujieleza inaunganisha majina ya kwanza na ya mwisho kuonyesha jina kamili. Ili kufafanua usemi katika swali la uchunguzi, chapa kwenye uwanja wa kujieleza unaopatikana katika jamii ya jumla. Usemi wako unaweza kurejelea maswali mengine ya uchunguzi (kama vile {swali1} + {swali2}) au tumia kazi za hesabu zilizojengwa kabla.

source: ![Expression](../../_static/images/surveys/question-types-expression.png "Expression")
fr: ! [Expression] (../../_ statique / images / enquêtes / questions-types-expression.png "expression")

source: **File**
fr: **Déposer**
sw: ** faili **

source: The File type is used to enable respondents to upload files. They can drag and drop one or several files into the designated area or select files using the browser's Upload File dialog window. Once uploaded, the files are saved in the survey results as base64-encoded strings.
fr: Le type de fichier est utilisé pour permettre aux répondants de télécharger des fichiers. Ils peuvent faire glisser et déposer un ou plusieurs fichiers dans la zone désignée ou sélectionner des fichiers à l'aide de la boîte de dialogue de fichiers de téléchargement du navigateur. Une fois téléchargés, les fichiers sont enregistrés dans les résultats de l'enquête sous forme de chaînes codées de base64.
sw: Aina ya faili hutumiwa kuwezesha waliohojiwa kupakia faili. Wanaweza kuvuta na kuacha faili moja au kadhaa kwenye eneo lililotengwa au kuchagua faili kwa kutumia dirisha la mazungumzo ya faili ya kivinjari. Mara baada ya kupakiwa, faili huhifadhiwa katika matokeo ya uchunguzi kama kamba za msingi wa base64.

source: ![File](../../_static/images/surveys/question-types-file.png "File")
fr: ! [Fichier] (../../_ statique / images / enquêtes / question-type-file.png "fichier")

source: File
fr: Déposer
sw: Faili

source: **Single-Choice Matrix**
fr: ** Matrice à choix unique **
sw: ** Matrix ya chaguo moja **

source: The Single-Choice Matrix type exhibits radio buttons arranged in rows and columns. Respondents can choose only one radio button within each row.
fr: Le type de matrice à choix unique présente des boutons radio disposés en lignes et colonnes. Les répondants ne peuvent choisir qu'un seul bouton radio dans chaque ligne.
sw: Aina ya chaguo moja la matrix inaonyesha vifungo vya redio vilivyopangwa katika safu na nguzo. Waliohojiwa wanaweza kuchagua kitufe kimoja cha redio ndani ya kila safu.

source: ![Single-Choice Matrix](../../_static/images/surveys/question-types-matrix-single-choice.png "Single-Choice Matrix")
fr: ! [Matrice à choix unique] (../../_ statique / images / enquêtes / questions-types-Matrix-Single-Choice.png "matrice à choix unique")

source: Single-Choice Matrix
fr: Matrice à choix unique
sw: Matrix ya chaguo moja

source: **Multiple-Choice Matrix**
fr: ** Matrice à choix multiple **
sw: ** Matrix ya chaguo nyingi **

source: The Multiple-Choice Matrix type displays rows and columns. Respondents use these editors to select a desired value in each cell. The following image illustrates the Multiple-Choice Matrix type with the default Dropdown editors.
fr: Le type de matrice à choix multiple affiche des lignes et des colonnes. Les répondants utilisent ces éditeurs pour sélectionner une valeur souhaitée dans chaque cellule. L'image suivante illustre le type de matrice à choix multiples avec les éditeurs déroulants par défaut.
sw: Aina ya chaguo-nyingi ya matrix inaonyesha safu na safu. Waliohojiwa hutumia wahariri hawa kuchagua thamani inayotaka katika kila seli. Picha ifuatayo inaonyesha aina ya chaguo-nyingi za matrix na wahariri wa kushuka kwa default.

source: ![Surveys](../../_static/images/surveys/question-types-matrix-multiple-choices.png "Surveys")
fr: ! [Enquêtes] (../../_ statique / images / enquêtes / questions-types-matrix-multiple-choices.png "enquêtes")

source: **Dynamic Matrix**
fr: ** Matrice dynamique **

source: The Dynamic Matrix type is similar to a [Multiple-Choice Matrix](https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix), but respondents can add and remove matrix rows.
fr: Le type de matrice dynamique est similaire à une [matrice de choice multiple] (https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix), mais les répondants peuvent ajouter et supprimer des lignes matricielles.
sw: Aina ya nguvu ya matrix ni sawa na [matrix ya chaguo-nyingi] (https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix), lakini wahojiwa wanaweza kuongeza na kuondoa safu za matrix.

source: ![Dynamic Matrix](../../_static/images/surveys/question-types-matrix-dynamic-rows.png "Dynamic Matrix")
fr: ! [Matrice dynamique] (../../_ statique / images / enquêtes / questions-types-matrix-dynamic-rows.png "Dynamic Matrix")

source: Dynamic Matrix
fr: Matrice dynamique
sw: Matrix ya nguvu

source: **Multiple Text**
fr: ** Texte multiple **
sw: ** maandishi mengi **

source: Respondents enter their answers into multiple single-line text editors. Use the Multiple Text type for open-ended questions that require more than one short answer.
fr: Les répondants entrent dans leurs réponses en plusieurs éditeurs de texte à une seule ligne. Utilisez le type de texte multiple pour les questions ouvertes qui nécessitent plus d'une réponse courte.
sw: Waliohojiwa huingiza majibu yao katika wahariri wa maandishi ya safu moja. Tumia aina nyingi za maandishi kwa maswali yaliyofunguliwa ambayo yanahitaji jibu zaidi ya moja.

source: ![Multiple Text](../../_static/images/surveys/question-types-multiple-text.png "Multiple Text")
fr: ! [Texte multiple] (../../_ statique / images / enquêtes / question-type-multiple-text.png "multiple texte")

source: Multiple Text
fr: Texte multiple
sw: Maandishi mengi

source: **Panel**
fr: **Panneau**
sw: ** Jopo **

source: The Panel type is a container for other questions and panels. Use this type to group several questions or panels and control them all together.
fr: Le type de panneau est un conteneur pour d'autres questions et panneaux. Utilisez ce type pour regrouper plusieurs questions ou panneaux et contrôlez-les tous ensemble.
sw: Aina ya jopo ni chombo cha maswali na paneli zingine. Tumia aina hii kuweka maswali kadhaa au paneli na kuzidhibiti zote pamoja.

source: **Dynamic Panel**
fr: ** Panneau dynamique **
sw: ** Jopo la Nguvu **

source: The Dynamic Panel type is a template panel that can contain multiple questions. Respondents can add and remove panels based on the template.
fr: Le type de panneau dynamique est un panneau de modèle qui peut contenir plusieurs questions. Les répondants peuvent ajouter et supprimer des panneaux en fonction du modèle.
sw: Aina ya jopo la nguvu ni jopo la template ambalo linaweza kuwa na maswali mengi. Waliohojiwa wanaweza kuongeza na kuondoa paneli kulingana na template.

source: ![Dynamic Panel](../../_static/images/surveys/question-types-dynamic-panel.png "Dynamic Panel")
fr: ! [Panneau dynamique] (../../_ statique / images / enquêtes / questions-types-dynamiques-Panel.png "Panneau dynamique")
sw: ! [Jopo la nguvu] (../../_ tuli/picha/uchunguzi/maswali-aina-dynamic-panel.png "paneli ya nguvu"))

source: Dynamic Panel
fr: Panneau dynamique
sw: Jopo la Nguvu

source: In progress...
fr: En cours...
sw: Katika Maendeleo ...

source: Content Assets
fr: Actifs de contenu
sw: Mali ya yaliyomo

source: Flexible Pages (Flex Page)
fr: Pages flexibles (page flexible)
sw: Kurasa zinazobadilika (ukurasa wa kubadilika)

source: This is a type of content page that offers a high degree of customization and flexibility in terms of layout and content structure. Unlike other pages above, which have a fixed set of predefined fields, a Flex Page allows you to add various content blocks and sections to create dynamic and richly structured pages.
fr: Il s'agit d'un type de page de contenu qui offre un degré élevé de personnalisation et de flexibilité en termes de disposition et de structure de contenu. Contrairement aux autres pages ci-dessus, qui ont un ensemble fixe de champs prédéfinis, une page Flex vous permet d'ajouter divers blocs et sections de contenu pour créer des pages dynamiques et richement structurées.
sw: Hii ni aina ya ukurasa wa yaliyomo ambayo hutoa kiwango cha juu cha ubinafsishaji na kubadilika katika suala la mpangilio na muundo wa yaliyomo. Tofauti na kurasa zingine hapo juu, ambazo zina seti maalum ya uwanja uliofafanuliwa, ukurasa wa Flex hukuruhusu kuongeza vizuizi na sehemu mbali mbali ili kuunda kurasa zenye nguvu na zenye utajiri.

source: With a Flex Page, you have the flexibility to add, rearrange, and customize these content blocks within the page editor. This enables you to build complex and unique page layouts without the need for technical expertise or assistance from developers.
fr: Avec une page Flex, vous avez la flexibilité d'ajouter, de réorganiser et de personnaliser ces blocs de contenu dans l'éditeur de page. Cela vous permet de créer des dispositions de pages complexes et uniques sans avoir besoin d'expertise technique ou d'assistance des développeurs.
sw: Ukiwa na ukurasa wa kubadilika, unayo kubadilika ya kuongeza, kupanga upya, na kubinafsisha vizuizi hivi vya yaliyomo ndani ya hariri ya ukurasa. Hii hukuwezesha kujenga mpangilio wa ukurasa ngumu na wa kipekee bila hitaji la utaalam wa kiufundi au msaada kutoka kwa watengenezaji.

source: The ability to create Flex Pages is one of the features that make Wagtail a powerful and user-friendly ClimWeb. It allows website administrators and editors to have greater control over the presentation of content, making it easier to maintain a consistent design while accommodating diverse content needs across different pages of the website.
fr: La possibilité de créer des pages flexibles est l'une des fonctionnalités qui font de la queue de bergeronnette une montée puissante et conviviale. Il permet aux administrateurs et aux éditeurs de site Web d'avoir un plus grand contrôle sur la présentation du contenu, ce qui facilite le maintien d'une conception cohérente tout en répondant aux besoins de contenu divers sur différentes pages du site Web.
sw: Uwezo wa kuunda kurasa za kubadilika ni moja wapo ya huduma ambayo hufanya Wagtail kuwa ya nguvu na ya kupendeza ya watumiaji. Inaruhusu wasimamizi wa wavuti na wahariri kuwa na udhibiti mkubwa juu ya uwasilishaji wa yaliyomo, na kuifanya iwe rahisi kudumisha muundo thabiti wakati wa kushughulikia mahitaji tofauti ya yaliyomo katika kurasa tofauti za wavuti.

source: Create a Flex Page
fr: Créer une page Flex
sw: Unda ukurasa wa kubadilika

source: To create this page navigate to the 'pages' item on the explorer menu as shown below and click on the pages item at the top.
fr: Pour créer cette page, accédez à l'élément «Pages» dans le menu Explorer comme indiqué ci-dessous et cliquez sur l'élément Pages en haut.
sw: Ili kuunda ukurasa huu nenda kwa kipengee cha 'Kurasa' kwenye menyu ya Explorer kama inavyoonyeshwa hapa chini na bonyeza kitu cha kurasa hapo juu.

source: ![Pages Explorer](../../_static/images/pages/pages_explorer.png "Pages Explorer")
fr: ! [Pages Explorer] (../../_ statique / images / pages / pages_explorer.png "pages explorateurs")

source: Pages Explorer
fr: Explorateur de pages
sw: Kurasa za kurasa

source: Hover over the Home item and click 'Add Child Page'
fr: Survolez l'élément d'accueil et cliquez sur «Ajouter une page enfant»
sw: Hover juu ya kitu cha nyumbani na ubonyeze 'Ongeza Ukurasa wa Mtoto'

source: ![Add Child Page](../../_static/images/pages/add_child_page.png "Add Child Page")
fr: ! [Ajouter une page enfant] (../../_ statique / images / pages / add_child_page.png "Ajouter une page enfant")
sw: ! [Ongeza ukurasa wa mtoto] (../../_ tuli/picha/kurasa/add_child_page.png "Ongeza ukurasa wa watoto")

source: Add Child Page
fr: Ajouter une page d'enfant
sw: Ongeza ukurasa wa mtoto

source: Select Flex Page from the type of pages provided.
fr: Sélectionnez la page Flex dans le type de pages fournies.
sw: Chagua ukurasa wa Flex kutoka aina ya kurasa zilizotolewa.

source: ![Add Flex Page](../../_static/images/flex_page/add_flex_page.png "Add Flex Page")
fr: ! [Ajouter une page Flex] (../../_ statique / images / flex_page / add_flex_page.png "Ajouter la page flex")

source: Add Flex Page
fr: Ajouter la page Flex
sw: Ongeza ukurasa wa Flex

source: Sections of a Flex Page
fr: Sections d'une page flexible
sw: Sehemu za ukurasa wa kubadilika

source: The main sections of the flex page include the **page title, banner and content** section.
fr: Les sections principales de la page Flex incluent le titre ** Page, la bannière et le contenu ** Section.
sw: Sehemu kuu za ukurasa wa Flex ni pamoja na kichwa cha ukurasa wa **, bendera na yaliyomo **.

source: ![Flex Page Sections](../../_static/images/flex_page/flex_page_sections.png "Flex Page Sections")
fr: ! [Sections de page Flex] (../../_ statique / images / flex_page / flex_page_sections.png "Sections de page flexible")
sw: ! [Sehemu za ukurasa wa Flex] (../../_ tuli/picha/flex_page/flex_page_sections.png "Sehemu za ukurasa wa Flex"))

source: Flex Page Sections
fr: Sections de page flexibles
sw: Sehemu za ukurasa wa Flex

source: The **content section** contains a set of resuable and reorderable blocks, i.e
fr: La ** Section de contenu ** contient un ensemble de blocs résolus et réorganisables, c'est-à-dire
sw: Sehemu ya yaliyomo

source: ![Flex Page Sections](../../_static/images/flex_page/content_panel_sections.png "Flex Page Sections")
fr: ! [Sections de page Flex] (../../_ statique / images / flex_page / contenu_panel_sections.png "sections de page flexible")
sw: ! [Sehemu za ukurasa wa Flex] (../../_ tuli/picha/flex_page/yaliyomo_panel_sections.png "sehemu za ukurasa wa kubadilika")))

source: Title and Text Block
fr: Titre et bloc de texte
sw: Kichwa na maandishi ya maandishi

source: ![Flex Page Sections](../../_static/images/flex_page/title_text.png "Flex Page Sections")
fr: ! [Sections de page Flex] (../../_ statique / images / flex_page / title_text.png "Sections de page flexible")
sw: ! [Sehemu za ukurasa wa Flex] (../../_ tuli/picha/flex_page/kichwa_text.png "Sehemu za ukurasa wa Flex"))

source: Title, Text and Image Block
fr: Titre, texte et bloc d'image
sw: Kichwa, maandishi na block ya picha

source: ![Flex Page Sections](../../_static/images/flex_page/title_text_image.png "Flex Page Sections")
fr: ! [Sections de page Flex] (../../_ statique / images / flex_page / title_text_image.png "Sections de page flexible")
sw: ! [Sehemu za ukurasa wa Flex] (../../_ tuli/picha/flex_page/kichwa_text_image.png "Sehemu za ukurasa wa Flex"))

source: Accordion Block ![Flex Page Sections](../../_static/images/flex_page/accordion.png "Flex Page Sections")
fr: Bloc de l'accordéon! [Sections de page Flex] (../../_ statique / images / flex_page / accordéon.png "Sections de page flexible")
sw: Accordion block! [Sehemu za ukurasa wa Flex] (../../_ tuli/picha/flex_page/accordion.png "Sehemu za ukurasa wa Flex"))

source: Table Block ![Flex Page Sections](../../_static/images/flex_page/table.png "Flex Page Sections")
fr: Bloc de table! [Sections de page Flex] (../../_ statique / images / flex_page / table.png "Sections de page flexible")
sw: Jedwali la kuzuia!

source: News
fr: Nouvelles
sw: Habari

source: Creation of news
fr: Création de nouvelles
sw: Uumbaji wa habari

source: The creation of news follows the steps below:
fr: La création de nouvelles suit les étapes ci-dessous:
sw: Uundaji wa habari unafuata hatua hapa chini:

source: Create a news type
fr: Créer un type d'actualités
sw: Unda aina ya habari

source: Create a news listing page
fr: Créer une page d'information sur les nouvelles
sw: Unda ukurasa wa orodha ya habari

source: Create a news page
fr: Créer une page d'information
sw: Unda ukurasa wa habari

source: News Creation Example Scenario
fr: Exemple de création de nouvelles scénario
sw: Mfano wa uundaji wa habari

source: Assume you would like to have news on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous aimeriez avoir des nouvelles sur le site Web, la façon pratique de le faire en utilisant les étapes ci-dessus serait:
sw: Fikiria ungependa kuwa na habari kwenye wavuti, njia ya vitendo ya kuifanya kwa kutumia hatua hapo juu itakuwa:

source: Step 1: Create an news type
fr: Étape 1: Créez un type d'actualités
sw: Hatua ya 1: Unda aina ya habari

source: To create a news type, navigate to the 'Snippets' section on the explorer menu and select 'News Types' as below:
fr: Pour créer un type d'actualités, accédez à la section «Extraits» du menu Explorer et sélectionnez «Types d'actualités» comme ci-dessous:
sw: Ili kuunda aina ya habari, nenda kwa sehemu ya 'Snippets' kwenye menyu ya Explorer na uchague 'aina za habari' kama ilivyo hapo chini:

source: ![News Explorer](../../_static/images/news/news_explorer.png "News Explorer")
fr: ! [News Explorer] (../../_ statique / images / news / news_explorer.png "News Explorer")
sw: ! [News Explorer] (../../_ tuli/picha/habari/habari_explorer.png "Habari Explorer")

source: News Explorer
fr: Explorer
sw: Habari Explorer

source: Click on 'Add news Type' to create a new news type.
fr: Cliquez sur «Ajouter un type d'actualités» pour créer un nouveau type d'actualités.
sw: Bonyeza kwenye 'Ongeza Aina ya Habari' kuunda aina mpya ya habari.

source: ![News Type](../../_static/images/news/add_news_type.png "News Type")
fr: ! [Type d'actualités] (../../_ statique / images / news / add_news_type.png "Type de nouvelles")
sw: ! [Aina ya habari] (../../_ tuli/picha/habari/add_news_type.png "aina ya habari"))

source: News Type
fr: Type d'actualités
sw: Aina ya habari

source: Provide news type name and choose an icon and save.
fr: Fournissez le nom du type d'actualités et choisissez une icône et enregistrez.
sw: Toa jina la aina ya habari na uchague ikoni na uhifadhi.

source: ![News Type](../../_static/images/news/news_type.png "News Type")
fr: ! [Type d'actualités] (../../_ statique / images / news / news_type.png "Type d'actualités")
sw: ! [Aina ya habari] (../../_ tuli/picha/habari/habari_type.png "aina ya habari")

source: Step 2: Create a news listing page
fr: Étape 2: Créez une page d'information sur les nouvelles
sw: Hatua ya 2: Unda ukurasa wa orodha ya habari

source: A listing page is a page that holds a list of pages. For example, a news Listing page would hold one or more news. It lists the banner, latest featured news and all other news.
fr: Une page d'inscription est une page qui contient une liste de pages. Par exemple, une page d'inscription de nouvelles tiendrait une ou plusieurs nouvelles. Il répertorie la bannière, les dernières nouvelles en vedette et toutes les autres nouvelles.
sw: Ukurasa wa orodha ni ukurasa ambao una orodha ya kurasa. Kwa mfano, ukurasa wa orodha ya habari ungeshikilia habari moja au zaidi. Inaorodhesha bendera, habari za hivi karibuni zilizoonyeshwa na habari zingine zote.

source: ![News List Preview](../../_static/images/news/news_list_preview.png "News List Preview")
fr: ! [Aperçu de la liste des nouvelles] (../../_ statique / images / news / news_list_preview.png "Preview de la liste des nouvelles")

source: News List Preview
fr: Aperçu de la liste des nouvelles
sw: Hakikisho la orodha ya habari

source: This option will only appear if no news listing page already exists as there can only be on instance/occurrrence of a news listing page.
fr: Cette option n'apparaîtra que si aucune page d'inscription d'informations n'existe déjà car il ne peut y avoir que sur l'instance / l'occurrence d'une page d'information.
sw: Chaguo hili litaonekana tu ikiwa hakuna ukurasa wa orodha ya habari tayari upo kwani kunaweza kuwa na mfano/tukio la ukurasa wa orodha ya habari.

source: Select news List Page from the type of pages provided.
fr: Sélectionnez la page de la liste des nouvelles dans le type de pages fournies.
sw: Chagua Ukurasa wa Orodha ya Habari kutoka kwa aina ya kurasa zilizotolewa.

source: ![Add News List Page](../../_static/images/news/add_news_list.png "Add News List Page")
fr: ! [Ajouter une page de liste d'actualités] (../../_ statique / images / news / add_news_list.png "Ajouter une page de liste de nouvelles")
sw: ! [Ongeza ukurasa wa orodha ya habari] (../../_ tuli/picha/habari/add_news_list.png "Ongeza ukurasa wa orodha ya habari")
