Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: **Goals** - includes a heading, descripiton and optional image of one or more goals
fr: ** Objectifs ** - Comprend un titre, une descripon et une image facultative d'un ou plusieurs objectifs
sw: ** Malengo ** - Ni pamoja na kichwa, maelezo na picha ya hiari ya malengo moja au zaidi

source: ![Goals Sections](../../../_static/images/projects/goals_section.png "Goals Sections")
fr: ! [Sections d'objectifs] (../../../_ statique / images / projets / buts_section.png "sections d'objectifs")
sw: ! [Sehemu za malengo] (../../../_ tuli/picha/miradi/malengo_section.png "sehemu za malengo"))

source: Goals Sections
fr: Sections d'objectifs
sw: Sehemu za malengo

source: **Feature Block** - includes a heading, descripiton, call to action link and text and optional image of one or more features
fr: ** Bloc de fonctions ** - Comprend une rubrique, descripon, un lien d'action à l'action et un texte et une image facultative d'une ou plusieurs fonctionnalités

source: ![Feature Block Sections](../../../_static/images/projects/feature_block_section.png "Feature Block Sections")
fr: ! [Sections de blocs de fonctions] (../../../_ statique / images / projets / fonctionnalités_block_section.png "sections de bloc de fonctionnalité")

source: **Youtube Playlist**
fr: ** Playlist YouTube **
sw: ** Orodha ya kucheza ya YouTube **

source: **Project Materials** - section for adding document or image for materials relating to the project.
fr: ** MATÉRIAUX DU PROJET ** - Section pour ajouter un document ou une image pour les matériaux relatifs au projet.
sw: ** Vifaa vya Mradi ** - Sehemu ya kuongeza hati au picha ya vifaa vinavyohusiana na mradi.

source: ![Project Materials Sections](../../../_static/images/projects/project_materials_section.png "Project Materials Sections")
fr: ! [Sections de matériel de projet] (../../../_ statique / images / projets / project_materials_section.png "Sections de matériaux de projet")

source: Project Materials Sections
fr: Sections de matériaux du projet
sw: Sehemu za Vifaa vya Mradi

source: **Partners** - list of partners related to the project.
fr: ** Partners ** - Liste des partenaires liés au projet.
sw: ** Washirika ** - Orodha ya washirika wanaohusiana na mradi.

source: ![Partners Sections](../../../_static/images/projects/partners_section.png "Partners Sections")
fr: ! [Sections des partenaires] (../../../_ statique / images / projets / partenaires_section.png "Sections partenaires")
sw: ! [Sehemu za Washirika] (../../../_ tuli/picha/miradi/washirika_section.png "Sehemu za Washirika"))

source: Partners Sections
fr: Sections de partenaires
sw: Sehemu za washirika

source: Tenders
fr: Appels d'offre
sw: Zabuni

source: Create a Tenders Listing Page
fr: Créer une page de liste d'offres
sw: Unda ukurasa wa orodha ya zabuni

source: To create a vacancy page, navigate to organisation page and create a child page from it selecting the Tenders page.
fr: Pour créer une page de vacance, accédez à la page de l'organisation et créez une page enfant à partir de la sélection des appels d'offres.
sw: Ili kuunda ukurasa wa nafasi, nenda kwa ukurasa wa shirika na uunda ukurasa wa watoto kutoka kwa kuchagua ukurasa wa zabuni.

source: ![Tenders List page](../../../_static/images/about/add_about_page.png "Tenders List page")
fr: ! [Page de liste des appels d'offres] (../../../_ static / images / about / add_about_page.png "Page de liste des offres")
sw: ! [Ukurasa wa orodha ya zabuni] (..

source: Tenders List page
fr: Page de liste des appels d'offres
sw: Ukurasa wa orodha ya zabuni

source: The Tenders List page is divided into various sections.
fr: La page de liste des appels d'offres est divisée en différentes sections.
sw: Ukurasa wa orodha ya zabuni imegawanywa katika sehemu mbali mbali.

source: ![Tenders List page](../../../_static/images/tenders/tender_sections.png "Tenders List page")
fr: ! [Page de liste des appels d'offres] (../../../_ Static / Images / Tenders / Tender_Sections.png "Page de liste des offres")
sw: ! [Ukurasa wa orodha ya zabuni] (../../../_ tuli/picha/zabuni/zabuni_sections.png "orodha ya orodha")))))))

source: **Other Settings** - this holds information on Tenders per page and text to appear when no vacancy is open.
fr: ** Autres paramètres ** - Cela contient des informations sur les appels d'offres par page et le texte pour apparaître lorsqu'aucune vacance n'est ouverte.
sw: ** Mipangilio mingine ** - Hii inashikilia habari juu ya zabuni kwa kila ukurasa na maandishi kuonekana wakati hakuna nafasi iliyofunguliwa.

source: Create a Tenders Page
fr: Créer une page d'offres
sw: Unda ukurasa wa zabuni

source: To create a Tenders page, navigate to Tenders listing page and create a child page.
fr: Pour créer une page d'appel d'offres, accédez à la page de liste des appels d'offres et créez une page enfant.
sw: Ili kuunda ukurasa wa zabuni, nenda kwenye ukurasa wa orodha ya zabuni na uunda ukurasa wa mtoto.

source: ![Tenders page](../../../_static/images/tenders/add_tender_item.png "Tenders page")
fr: ! [Page d'offres] (../../../_ static / images / tende / add_tender_item.png "Page de tendres")

source: Tenders page
fr: Page d'offres
sw: Ukurasa wa zabuni

source: ![Tenders page](../../../_static/images/tenders/tender_item_sections.png "Tenders page")
fr: ! [Page d'offres] (../../../_ statique / images / tendeurs / tendre_item_sections.png "Page de tendres")

source: **Date of Posting** - the date the vacancy was posted on
fr: ** Date de publication ** - La date à laquelle le poste a été publié sur
sw: ** Tarehe ya Kutuma ** - Tarehe ambayo nafasi iliwekwa kwenye

source: **Duty Station** - the duty station for the vacancy
fr: ** Station des droits ** - la station de service pour la vacance
sw: ** Kituo cha Ushuru ** - Kituo cha Ushuru kwa nafasi hiyo

source: **Duration** - the work duration of the job
fr: ** Durée ** - La durée du travail du travail
sw: ** Muda ** - Muda wa kazi wa kazi

source: **Job Description** - long text describing the job
fr: ** Description du poste ** - Texte long décrivant le travail
sw: ** Maelezo ya kazi ** - Nakala ndefu inayoelezea kazi

source: **Application Deadline** - when the application closes
fr: ** Date limite d'application ** - Lorsque la demande se ferme
sw: ** Tarehe ya mwisho ya Maombi ** - Wakati programu inafunga

source: **Downloadable Job Description Document** - Optional downloadable job description document
fr: ** Document de description de poste téléchargeable ** - Document de description de travail téléchargeable en option
sw: ** Hati ya Maelezo ya Kazi inayoweza kupakuliwa ** - Hati ya Maelezo ya Kazi ya Kupakuliwa

source: Vacancies
fr: Postes vacants
sw: Nafasi za kazi

source: Create a Vacancy Listing Page
fr: Créer une page d'inscription de vacance
sw: Unda ukurasa wa orodha ya nafasi

source: To create a vacancy page, navigate to organisation page and create a child page from it selecting the vacancies page.
fr: Pour créer une page de vacance, accédez à la page de l'organisation et créez une page enfant à partir de la sélection des postes vacants.
sw: Ili kuunda ukurasa wa nafasi, nenda kwa ukurasa wa shirika na uunda ukurasa wa watoto kutoka kwake kuchagua ukurasa wa nafasi.

source: ![Vacancies List page](../../../_static/images/about/add_about_page.png "Vacancies List page")
fr: ! [Page de liste des vacanciers] (../../../_ statique / images / À propos / add_about_page.png "Page de liste des vacanciers")
sw: ! [Ukurasa wa orodha ya nafasi] (..

source: Vacancies List page
fr: Page de liste des postes vacants
sw: Ukurasa wa orodha ya nafasi za nafasi

source: The Vacancies List page is divided into various sections.
fr: La page de liste des postes vacants est divisée en différentes sections.
sw: Ukurasa wa orodha ya nafasi za nafasi umegawanywa katika sehemu mbali mbali.

source: ![Vacancies List page](../../../_static/images/vacancies/vacancy_sections.png "Vacancies List page")
fr: ! [Page de liste des vacanciers] (../../../_ statique / images / vacancies / vacancy_sections.png "Page de liste des vacanciers")
sw: ! [Ukurasa wa orodha ya nafasi] (..

source: **Other Settings** - this holds information on vacancies per page and text to appear when no vacancy is open.
fr: ** Autres paramètres ** - Cela contient des informations sur les postes vacants par page et le texte pour apparaître lorsqu'aucune vacance n'est ouverte.
sw: ** Mipangilio mingine ** - Hii inashikilia habari juu ya nafasi za kazi kwa kila ukurasa na maandishi kuonekana wakati hakuna nafasi iliyofunguliwa.

source: Create a Vacancies Page
fr: Créer une page de postes vacants
sw: Unda ukurasa wa nafasi

source: To create a vacancies page, navigate to vacancies listing page and create a child page.
fr: Pour créer une page de postes vacants, accédez à la page de liste des postes vacants et créez une page enfant.
sw: Ili kuunda ukurasa wa nafasi za kazi, nenda kwenye ukurasa wa orodha za nafasi na uunda ukurasa wa watoto.

source: ![Vacancies page](../../../_static/images/vacancies/add_vacancy_item.png "Vacancies page")
fr: ! [Page vacancies] (../../../_ statique / images / vacance / add_vacancy_item.png "Page vacancies")
sw: ! [Ukurasa wa nafasi] (..

source: Vacancies page
fr: Page de postes vacants
sw: Ukurasa wa nafasi

source: ![Vacancies page](../../../_static/images/vacancies/vacancy_item_sections.png "Vacancies page")
fr: ! [Page vacancies] (../../../_ statique / images / vacance / vacancy_item_sections.png "Page vacancies")
sw: ! [Ukurasa wa nafasi] (..

source: Workflows
fr: Flux de travail
sw: Mtiririko wa kazi

source: About workflows
fr: Sur les flux de travail
sw: Kuhusu kazi

source: Workflows allow you to configure how moderation works on your site. Workflows are sequences of tasks that require approval before completion. A completed workflow usually results in the publication of a page, depending on your website's settings.
fr: Les workflows vous permettent de configurer le fonctionnement de la modération sur votre site. Les flux de travail sont des séquences de tâches qui nécessitent l'approbation avant l'achèvement. Un flux de travail terminé se traduit généralement par la publication d'une page, en fonction des paramètres de votre site Web.
sw: Mtiririko wa kazi hukuruhusu kusanidi jinsi wastani unavyofanya kazi kwenye wavuti yako. Mtiririko wa kazi ni mlolongo wa kazi ambazo zinahitaji idhini kabla ya kukamilika. Mtiririko wa kazi uliokamilishwa kawaida husababisha kuchapishwa kwa ukurasa, kulingana na mipangilio ya wavuti yako.

source: To access the Workflow interface, go to **Settings > Workflows** from the left Sidebar.
fr: Pour accéder à l'interface de workflow, accédez à ** Paramètres> Workflows ** dans la barre latérale gauche.
sw: Ili kufikia interface ya utiririshaji wa kazi, nenda kwa Mipangilio ya **> Mtiririko wa kazi ** kutoka kwa upande wa kushoto.

source: Worklow explorer
fr: Explorateur de travail

source: From the Workflow interface, you can see all of the workflows on your site and the order of tasks in each. To create a new workflow, click Add a workflow from the Workflow interface.
fr: À partir de l'interface de workflow, vous pouvez voir tous les workflows sur votre site et l'ordre des tâches dans chacun. Pour créer un nouveau workflow, cliquez sur Ajouter un flux de travail à partir de l'interface de workflow.
sw: Kutoka kwa interface ya kazi, unaweza kuona mtiririko wote wa kazi kwenye wavuti yako na agizo la kazi katika kila moja. Ili kuunda mtiririko mpya wa kazi, bonyeza Ongeza mtiririko wa kazi kutoka kwa kigeuzio cha kazi.

source: Furthermore, the Workflow interface shows how many pages each workflow covers. If you click the number of pages, you can see a list of all the pages a workflow applies to.
fr: De plus, l'interface de flux de travail montre le nombre de pages que chaque flux de travail couvre. Si vous cliquez sur le nombre de pages, vous pouvez voir une liste de toutes les pages auxquelles un workflow s'applique.
sw: Kwa kuongezea, interface ya kazi inaonyesha ni kurasa ngapi kila kufurika kwa kazi. Ukibonyeza idadi ya kurasa, unaweza kuona orodha ya kurasa zote ambazo mtiririko wa kazi unatumika kwa.

source: ![Worklow interface](../../_static/images/workflows/list_workflows.png "Worklow interface")
fr: ! [Interface Worklow] (../../_ static / images / workflows / list_workflows.png "Worklow Interface")
sw: ! [Interface ya kazi] (../../_ tuli/picha/kazi/orodha

source: Worklow interface
fr: Interface Worklow
sw: Interface ya kazi

source: Edit workflows
fr: Modifier les workflows
sw: Hariri kazi za kazi

source: In the Workflow interface, click on the name of a workflow to edit it or to assign it to a part of the page tree.
fr: Dans l'interface de workflow, cliquez sur le nom d'un workflow pour le modifier ou pour l'attribuer à une partie de l'arborescence de page.
sw: Kwenye interface ya kazi, bonyeza juu ya jina la utiririshaji wa kazi ili kuibadilisha au kuigawa kwa sehemu ya mti wa ukurasa.

source: Click **Add task** under **Add tasks to your workflow** to add a task. When adding a task to a workflow, you can create a new task or reuse an existing one.
fr: Cliquez sur ** Ajouter une tâche ** sous ** Ajouter des tâches à votre flux de travail ** pour ajouter une tâche. Lorsque vous ajoutez une tâche à un flux de travail, vous pouvez créer une nouvelle tâche ou réutiliser une tâche existante.
sw: Bonyeza ** Ongeza Kazi ** Chini ya ** Ongeza kazi kwenye utiririshaji wako wa kazi ** ili kuongeza kazi. Wakati wa kuongeza kazi kwenye mtiririko wa kazi, unaweza kuunda kazi mpya au kutumia tena iliyopo.

source: To change a task in the workflow, hover over the task under **Add tasks to your workflow** and select **Choose another task** from the pop-up options.
fr: Pour modifier une tâche dans le flux de travail, survolez la tâche sous ** Ajoutez des tâches à votre flux de travail ** et sélectionnez ** Choisissez une autre tâche ** dans les options pop-up.
sw: Ili kubadilisha kazi katika utiririshaji wa kazi, tembea juu ya kazi chini ya ** Ongeza kazi kwenye utiririshaji wako wa kazi ** na uchague ** Chagua kazi nyingine ** kutoka kwa chaguzi za pop-up.

source: You can also reorder tasks in a workflow by hovering over a task under the **Add tasks to your workflow** and then clicking the up and down arrow.
fr: Vous pouvez également réorganiser les tâches dans un flux de travail en survolant une tâche sous les tâches ** Ajouter à votre flux de travail **, puis en cliquant sur la flèche haut et bas.
sw: Unaweza pia kupanga tena kazi katika utiririshaji wa kazi kwa kusonga juu ya kazi chini ya ** Ongeza kazi kwenye utiririshaji wako wa kazi na kisha kubonyeza mshale wa juu na chini.

source: Under **Assign your workflow to pages**, you can see a list of the pages assigned to a workflow. All child pages take the same workflow as their parents. So if the root page of your site gets assigned to a workflow, it becomes the default workflow. You may remove a page from the workflow by clicking **Delete** at the right of each entry. Also, you can change the page in an entry to another by clicking **Choose another page.**
fr: Sous ** Attribuez votre flux de travail aux pages **, vous pouvez voir une liste des pages attribuées à un workflow. Toutes les pages enfants prennent le même flux de travail que leurs parents. Donc, si la page racine de votre site est affectée à un workflow, elle devient le flux de travail par défaut. Vous pouvez supprimer une page du workflow en cliquant sur ** Supprimer ** à droite de chaque entrée. Vous pouvez également modifier la page dans une entrée en une autre en cliquant sur ** Choisissez une autre page. **
sw: Chini ya ** Toa utiririshaji wako kwa kurasa **, unaweza kuona orodha ya kurasa zilizopewa mtiririko wa kazi. Kurasa zote za watoto huchukua kazi sawa na wazazi wao. Kwa hivyo ikiwa ukurasa wa mizizi ya wavuti yako unapewa utiririshaji wa kazi, inakuwa kazi ya msingi. Unaweza kuondoa ukurasa kutoka kwa mtiririko wa kazi kwa kubonyeza ** Futa ** upande wa kulia wa kila kiingilio. Pia, unaweza kubadilisha ukurasa katika kiingilio kwa mwingine kwa kubonyeza ** Chagua ukurasa mwingine. **

source: The action menu at the bottom allows you to save your changes, or disable the workflow. Disabling a workflow cancels all pages currently in moderation in that workflow, and prevents others from starting it. If the workflow was previously disabled, then you get the option to enable it in the action menu.
fr: Le menu d'action en bas vous permet d'enregistrer vos modifications ou de désactiver le workflow. La désactivation d'un flux de travail annule toutes les pages actuellement avec modération dans ce flux de travail et empêche les autres de le démarrer. Si le flux de travail était auparavant désactivé, vous obtenez l'option pour l'activer dans le menu Action.
sw: Menyu ya hatua chini hukuruhusu kuokoa mabadiliko yako, au kulemaza mtiririko wa kazi. Kulemaza utiririshaji wa kazi kufuta kurasa zote kwa sasa kwa wastani katika utiririshaji huo, na kuzuia wengine kuanza. Ikiwa mtiririko wa kazi ulikuwa umezimwa hapo awali, basi unapata chaguo kuiwezesha kwenye menyu ya hatua.

source: Edit Worklow
fr: Modifier Worklow
sw: Hariri Worklow

source: Create and edit tasks
fr: Créer et modifier les tâches
sw: Unda na hariri kazi

source: To create a task, go to Settings > Workflows tasks from the Sidebar. This takes you to the Tasks interface, where you can see a list of the currently available tasks and which workflows use each task. Similar to workflows, you can click the name of an existing task to edit it. To add a new task, click Add a task.
fr: Pour créer une tâche, accédez à Paramètres> Tâches de workflows à partir de la barre latérale. Cela vous amène à l'interface tâches, où vous pouvez voir une liste des tâches actuellement disponibles et quels workflows utilisent chaque tâche. Semblable aux workflows, vous pouvez cliquer sur le nom d'une tâche existante pour la modifier. Pour ajouter une nouvelle tâche, cliquez sur Ajouter une tâche.
sw: Ili kuunda kazi, nenda kwa Mipangilio> Kazi za kazi kutoka kwa pembeni. Hii inakupeleka kwenye interface ya kazi, ambapo unaweza kuona orodha ya kazi zinazopatikana kwa sasa na ni kazi gani ya kazi hutumia kila kazi. Sawa na kazi, unaweza kubonyeza jina la kazi iliyopo kuibadilisha. Ili kuongeza kazi mpya, bonyeza Ongeza kazi.

source: ![Worklow Explorer](../../_static/images/workflows/workflow_tasks_explorer.png "Worklow Explorer")
fr: ! [Worklow Explorer] (../../_ statique / images / workflows / workflow_tasks_explorer.png "Worklow Explorer")
sw: ! [Worklow Explorer] (../../_ tuli/picha/kazi ya kazi/kazi ya kazi

source: Worklow Explorer
fr: Explorateur de travail

source: ![Worklow Task](../../_static/images/workflows/workflow_tasks.png "Worklow Tasks")
fr: ! [Tâche de travail] (../../_ statique / images / workflows / workflow_tasks.png "tâches de travail")

source: Worklow Task
fr: Tâche de travail
sw: Kazi ya kazi

source: When creating a task, if you have multiple task types available, then they are offered to you as options. By default, only group approval tasks are available. By creating a group approval task, you are able to select one or multiple groups. Members of any of these, as well as administrators, will be able to approve or reject moderation for this task.
fr: Lors de la création d'une tâche, si vous avez plusieurs types de tâches disponibles, ils vous sont proposés comme options. Par défaut, seules les tâches d'approbation de groupe sont disponibles. En créant une tâche d'approbation de groupe, vous pouvez sélectionner un ou plusieurs groupes. Les membres de l'un de ceux-ci, ainsi que les administrateurs, pourront approuver ou rejeter la modération pour cette tâche.
sw: Wakati wa kuunda kazi, ikiwa una aina nyingi za kazi zinazopatikana, basi hutolewa kwako kama chaguzi. Kwa msingi, kazi za idhini ya kikundi pekee zinapatikana. Kwa kuunda kazi ya idhini ya kikundi, unaweza kuchagua vikundi moja au vingi. Wajumbe wa yoyote ya haya, pamoja na wasimamizi, wataweza kupitisha au kukataa wastani wa kazi hii.

source: Edit Worklow Task
fr: Modifier la tâche Worklow
sw: Hariri kazi ya kazi

source: When editing a task, you may find that some fields, such as the name field, are uneditable. This is to ensure workflow history remains consistent. If you need to change the name of a task, then disable the old task, and create a new one with the name you need. Disabling a task causes any pages currently in moderation on that task to skip to the next task.
fr: Lorsque vous modifiez une tâche, vous pouvez constater que certains champs, tels que le champ de nom, sont non apparentés. Il s'agit de garantir que l'histoire du flux de travail reste cohérent. Si vous devez modifier le nom d'une tâche, désactivez l'ancienne tâche et créez-en une nouvelle avec le nom dont vous avez besoin. La désactivation d'une tâche entraîne des pages actuellement avec modération sur cette tâche pour passer à la tâche suivante.
sw: Wakati wa kuhariri kazi, unaweza kugundua kuwa sehemu zingine, kama vile uwanja wa jina, hazieleweki. Hii ni kuhakikisha historia ya utiririshaji inabaki thabiti. Ikiwa unahitaji kubadilisha jina la kazi, basi lemaza kazi ya zamani, na uunda mpya na jina unayohitaji. Kulemaza kazi husababisha kurasa zozote kwa sasa kwa kiasi juu ya kazi hiyo kuruka kwa kazi inayofuata.

source: Two-Factor Authentication (2FA)
fr: Authentification à deux facteurs (2FA)
sw: Uthibitishaji wa sababu mbili (2FA)

source: Setting Up Two-Factor Authentication (2FA) in Wagtail
fr: Configuration de l'authentification à deux facteurs (2FA) en bergeronnette
sw: Kuanzisha Uthibitishaji wa sababu mbili (2FA) katika Wagtail

source: Two-Factor Authentication (2FA) adds an extra layer of security to your Wagtail admin account. It requires both your password and a unique code generated by an authenticator app, making it harder for unauthorized users to access your account.
fr: L'authentification à deux facteurs (2FA) ajoute une couche supplémentaire de sécurité à votre compte d'administration à bergeron. Il nécessite à la fois votre mot de passe et un code unique généré par une application Authenticator, ce qui rend plus difficile pour les utilisateurs non autorisés d'accéder à votre compte.
sw: Uthibitishaji wa sababu mbili (2FA) unaongeza safu ya ziada ya usalama kwenye akaunti yako ya admin ya Wagtail. Inahitaji nywila yako na nambari ya kipekee inayotokana na programu ya uhakiki, na kuifanya iwe ngumu kwa watumiaji wasioidhinishwa kupata akaunti yako.

source: Step 1: Log in to the Wagtail Admin Panel
fr: Étape 1: Connectez-vous au panneau d'administration en bergeron
sw: Hatua ya 1: Ingia kwenye Jopo la Usimamizi wa Wagtail

source: Open your web browser and navigate to your Wagtail admin login page.
fr: Ouvrez votre navigateur Web et accédez à votre page de connexion d'administration à bergeron.
sw: Fungua kivinjari chako cha wavuti na nenda kwenye ukurasa wako wa kuingia wa Wagtail Admin.

source: Enter your username and password, then click **Log in**.
fr: Entrez votre nom d'utilisateur et votre mot de passe, puis cliquez sur ** Connectez-vous **.
sw: Ingiza jina lako la mtumiaji na nywila, kisha bonyeza ** Ingia **.

source: Step 2: Set Up an Authenticator App on your phone
fr: Étape 2: Configurez une application Authenticator sur votre téléphone
sw: Hatua ya 2: Sanidi programu ya kithibitishaji kwenye simu yako

source: To complete 2FA setup, you will need an authenticator app such as:
fr: Pour terminer la configuration 2FA, vous aurez besoin d'une application Authenticatrice telle que:
sw: Ili kukamilisha usanidi wa 2FA, utahitaji programu ya uhakiki kama vile:

source: ![2FA](../../_static/images/settings/2fa.png "2FA")
fr: ! [2fa] (../../_ statique / images / paramètres / 2fa.png "2fa")
sw: ! [2fa] (../../_ tuli/picha/mipangilio/2fa.png "2fa")
