Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: You can control access to specific sets of images and documents by setting up collections. By default, all images and documents belong to the root collection, but users with appropriate permissions can create new collections from the Collections interface. Go to Settings > Collections from the Wagtail Sidebar to access the Collections interface.
fr: Vous pouvez contrôler l'accès à des ensembles spécifiques d'images et de documents en configurant les collections. Par défaut, toutes les images et documents appartiennent à la collection racine, mais les utilisateurs avec des autorisations appropriées peuvent créer de nouvelles collections à partir de l'interface de collections. Accédez à Paramètres> Les collections de la barre latérale en bergeronnette pour accéder à l'interface des collections.
sw: Unaweza kudhibiti ufikiaji wa seti maalum za picha na hati kwa kusanidi makusanyo. Kwa msingi, picha na hati zote ni za mkusanyiko wa mizizi, lakini watumiaji walio na ruhusa sahihi wanaweza kuunda makusanyo mapya kutoka kwa interface ya makusanyo. Nenda kwa Mipangilio> Makusanyo kutoka kwa kando ya Wagtail ili kufikia interface ya makusanyo.

source: ![Collections Explorer](../../_static/images/collections/collections_explorer.png "Collections Explorer")
fr: ! [Collections Explorer] (../../_ statique / images / collections / collections_explorer.png "Collections Explorer")

source: ![Collections](../../_static/images/collections/collections.png "Collections")
fr: ! [Collections] (../../_ statique / images / collections / collections.png "Collections")
sw: ! [Makusanyo] (../../_ tuli/picha/makusanyo/makusanyo.png "makusanyo"))

source: Add a collection
fr: Ajouter une collection
sw: Ongeza mkusanyiko

source: To create a collection, click **Add a collection** from the Collections interface. Then enter a name in the **Name** field and select a parent. Click **Create** to complete the creation process.
fr: Pour créer une collection, cliquez sur ** Ajouter une collection ** à partir de l'interface collections. Entrez ensuite un nom dans le champ ** Nom ** et sélectionnez un parent. Cliquez sur ** Créer ** pour terminer le processus de création.
sw: Ili kuunda mkusanyiko, bonyeza ** Ongeza mkusanyiko ** kutoka kwa interface ya makusanyo. Kisha ingiza jina katika uwanja wa ** jina ** na uchague mzazi. Bonyeza ** Unda ** kukamilisha mchakato wa uundaji.

source: ![Add Collections](../../_static/images/collections/add_collection.png "Add Collections")
fr: ! [Ajouter des collections] (../../_ statique / images / collections / add_collection.png "Ajouter des collections")
sw: ! [Ongeza makusanyo] (../../_ tuli/picha/makusanyo/add_collection.png "ongeza makusanyo")

source: Add Collections
fr: Ajouter des collections
sw: Ongeza makusanyo

source: Add images or documents to a collection
fr: Ajouter des images ou des documents à une collection
sw: Ongeza picha au hati kwenye mkusanyiko

source: To add images to a collection, click Images from the Wagtail sidebar and select a collection from the Collections dropdown. Then click Add an image and follow the instructions on the screen.
fr: Pour ajouter des images à une collection, cliquez sur les images de la barre latérale en bergeron et sélectionnez une collection dans la liste déroulante des collections. Cliquez ensuite sur Ajouter une image et suivez les instructions de l'écran.
sw: Kuongeza picha kwenye mkusanyiko, bonyeza picha kutoka kwa kando ya Wagtail na uchague mkusanyiko kutoka kwa kushuka kwa makusanyo. Kisha bonyeza Ongeza picha na ufuate maagizo kwenye skrini.

source: ![Image to Collections](../../_static/images/collections/image_to_collection.png "Image to Collections")
fr: ! [Image aux collections] (../../_ statique / images / collections / image_to_collection.png "Image aux collections")
sw: ! [Picha kwa makusanyo] (../../_ tuli/picha/makusanyo/picha_to_collection.png "picha kwa makusanyo")

source: Image to Collections
fr: Image aux collections
sw: Picha kwa makusanyo

source: The process of adding documents to a collection is similar to that of images. Click Documents from the Sidebar and select a collection from the Collections dropdown. Then click Add a document and follow the instructions on the screen.
fr: Le processus d'ajout de documents à une collection est similaire à celui des images. Cliquez sur les documents dans la barre latérale et sélectionnez une collection dans la liste déroulante des collections. Cliquez ensuite sur Ajouter un document et suivez les instructions à l'écran.
sw: Mchakato wa kuongeza hati kwenye mkusanyiko ni sawa na ile ya picha. Bonyeza hati kutoka kwa pembeni na uchague mkusanyiko kutoka kwa kushuka kwa makusanyo. Kisha bonyeza Ongeza hati na ufuate maagizo kwenye skrini.

source: It's possible to add an image or document to a collection while editing them. To do this, click Images or Documents from the Sidebar and select the image or document you want to add to a collection by clicking it. Then choose a collection from the Collection dropdown in the edit screen.
fr: Il est possible d'ajouter une image ou un document à une collection lors de leur modification. Pour ce faire, cliquez sur des images ou des documents de la barre latérale et sélectionnez l'image ou le document que vous souhaitez ajouter à une collection en cliquant dessus. Choisissez ensuite une collection dans la liste déroulante de la collection dans l'écran Edit.
sw: Inawezekana kuongeza picha au hati kwenye mkusanyiko wakati wa kuhariri. Ili kufanya hivyo, bonyeza picha au hati kutoka kwa pembeni na uchague picha au hati unayotaka kuongeza kwenye mkusanyiko kwa kubonyeza. Kisha chagua mkusanyiko kutoka kwa kushuka kwa mkusanyiko kwenye skrini ya Hariri.

source: ![Image to Collections](../../_static/images/collections/image_to_collection2.png "Image to Collections")
fr: ! [Image aux collections] (../../_ statique / images / collections / image_to_collection2.png "Image aux collections")
sw: ! [Picha kwa makusanyo] (../../_ tuli/picha/makusanyo/picha_to_collection2.png "picha kwa makusanyo")

source: You can also select a collection as part of uploading multiple images or documents.
fr: Vous pouvez également sélectionner une collection dans le cadre du téléchargement de plusieurs images ou documents.
sw: Unaweza pia kuchagua mkusanyiko kama sehemu ya kupakia picha nyingi au hati.

source: Privacy settings
fr: Paramètres de confidentialité
sw: Mipangilio ya faragha

source: To set permissions to determine who is able to view documents within a collection, go to **Settings > Collections** and select a collection. Then click **Privacy** preceding the collection name.
fr: Pour définir des autorisations pour déterminer qui est en mesure d'afficher des documents dans une collection, accédez à ** Paramètres> Collections ** et sélectionnez une collection. Puis cliquez sur ** Privacy ** précédant le nom de la collection.
sw: Ili kuweka ruhusa ili kuamua ni nani anayeweza kuona hati ndani ya mkusanyiko, nenda kwa Mipangilio ya **> makusanyo ** na uchague mkusanyiko. Kisha bonyeza ** faragha ** kabla ya jina la ukusanyaji.

source: ![Collection Privacy](../../_static/images/collections/collection_privacy.png "Collection Privacy")
fr: ! [Collection Privacy] (../../_ statique / images / collections / collection_privacy.png "Collection Privacy")
sw: ! [Mkusanyiko wa faragha] (../../_ tuli/picha/makusanyo/mkusanyiko_privacy.png "faragha ya ukusanyaji")

source: Collection Privacy
fr: Confidentialité de la collection
sw: Faragha ya ukusanyaji

source: Clicking Privacy gives you a pop-up modal from which you can select the level of privacy for the collection.
fr: Cliquer sur la confidentialité vous donne un modal contextuel à partir duquel vous pouvez sélectionner le niveau de confidentialité pour la collection.
sw: Kubonyeza faragha hukupa modal ya pop-up ambayo unaweza kuchagua kiwango cha faragha kwa mkusanyiko.

source: ![Collection Privacy Options](../../_static/images/collections/collection_privacy_options.png "Collection Privacy Options")
fr: ! [Collection Options de confidentialité] (../../_ statique / images / collections / collection_privacy_options.png "Collection Options de confidentialité")
sw: ! [Chaguzi za faragha za ukusanyaji] (../../_ tuli/picha/makusanyo/ukusanyaji_privacy_options.png "Chaguzi za faragha za ukusanyaji"))

source: Collection Privacy Options
fr: Collection Options de confidentialité
sw: Chaguzi za faragha za ukusanyaji

source: The permissions set on a collection apply to that collection and all collections below it in the hierarchy. Therefore, if you make the root collection private, all documents on the site become private. Permissions set in other collections only apply to those collections.
fr: Les autorisations définies sur une collection s'appliquent à cette collection et à toutes les collections en dessous dans la hiérarchie. Par conséquent, si vous rendez la collection de racines privée, tous les documents sur le site deviennent privés. Les autorisations fixées dans d'autres collections ne s'appliquent qu'à ces collections.
sw: Ruhusa zilizowekwa kwenye mkusanyiko zinatumika kwenye mkusanyiko huo na makusanyo yote chini yake katika uongozi. Kwa hivyo, ikiwa unafanya mkusanyiko wa mizizi kuwa ya kibinafsi, hati zote kwenye Tovuti zinakuwa za kibinafsi. Ruhusa zilizowekwa katika makusanyo mengine hutumika tu kwenye makusanyo hayo.

source: Privacy settings added to a collection are only enforced for documents within the collection. Privacy settings do not apply to images.
fr: Les paramètres de confidentialité ajoutés à une collection ne sont appliqués que pour les documents dans la collection. Les paramètres de confidentialité ne s'appliquent pas aux images.
sw: Mipangilio ya faragha iliyoongezwa kwenye mkusanyiko inatekelezwa tu kwa hati zilizo ndani ya mkusanyiko. Mipangilio ya faragha haitumiki kwa picha.

source: You can manage documents such as PDF files from the Documents interface. To access the Documents interface, click Documents in the Sidebar. This interface allows you to add documents to and remove documents from the Admin interface.
fr: Vous pouvez gérer des documents tels que les fichiers PDF à partir de l'interface Documents. Pour accéder à l'interface des documents, cliquez sur les documents dans la barre latérale. Cette interface vous permet d'ajouter des documents et de supprimer des documents de l'interface d'administration.
sw: Unaweza kusimamia hati kama faili za PDF kutoka kwa interface ya hati. Ili kufikia interface ya hati, bonyeza hati kwenye kando ya pembeni. Sura hii hukuruhusu kuongeza hati na kuondoa hati kutoka kwa interface ya admin.

source: ![Manage Documents](../../_static/images/documents/manage_documents.png "Manage Documents")
fr: ! [Gérer les documents] (../../_ statique / images / documents / manage_documents.png "Gérer les documents")
sw: ! [Dhibiti hati] (../../_ tuli/picha/hati/usimamizi_documents.png "Dhibiti hati")

source: Manage Documents
fr: Gérer les documents
sw: Dhibiti hati

source: Add documents by clicking Add documents at the top right of the documents interface. Search for previously added documents by entering the title of the document in the search bar. The results automatically update as you type. You can also filter the results by Collection by selecting a collection from the Collection dropdown preceding the documents list.
fr: Ajoutez des documents en cliquant sur Ajouter des documents en haut à droite de l'interface Documents. Recherchez des documents précédemment ajoutés en entrant le titre du document dans la barre de recherche. Les résultats se mettent automatiquement à jour au fur et à mesure que vous tapez. Vous pouvez également filtrer les résultats par collection en sélectionnant une collection dans la liste déroulante de la collection précédant la liste des documents.
sw: Ongeza hati kwa kubonyeza Ongeza hati kwenye haki ya juu ya kiunganisho cha hati. Tafuta hati zilizoongezwa hapo awali kwa kuingiza kichwa cha hati kwenye bar ya utaftaji. Matokeo husasisha kiotomatiki unapoandika. Unaweza pia kuchuja matokeo kwa mkusanyiko kwa kuchagua mkusanyiko kutoka kwa kushuka kwa mkusanyiko uliotangulia orodha ya hati.

source: ![Select Documents](../../_static/images/documents/select_documents.png "Select Documents")
fr: ! [Sélectionner des documents] (../../_ statique / images / documents / select_documents.png "SELECT DOCUMENTS")
sw: ! [Chagua Hati] (../../_ tuli/picha/hati/select_documents.png "Chagua Hati")

source: Select Documents
fr: Sélectionner des documents
sw: Chagua hati

source: Select multiple documents by clicking the checkbox on the left side of each document, then use the bulk actions bar at the bottom to perform an action on all selected documents.
fr: Sélectionnez plusieurs documents en cliquant sur la case à cocher sur le côté gauche de chaque document, puis utilisez la barre des actions en vrac en bas pour effectuer une action sur tous les documents sélectionnés.
sw: Chagua hati nyingi kwa kubonyeza kisanduku cha kushoto upande wa kushoto wa kila hati, kisha utumie bar ya vitendo vya wingi chini kufanya hatua kwenye hati zote zilizochaguliwa.

source: If you want to edit a document, click the title of the document. Doing this takes you to the edit screen.
fr: Si vous souhaitez modifier un document, cliquez sur le titre du document. Cela vous amène à l'écran d'édition.
sw: Ikiwa unataka kuhariri hati, bonyeza kichwa cha hati. Kufanya hii hukuchukua kwenye skrini ya hariri.

source: ![Edit Documents](../../_static/images/documents/edit_document.png "Edit Documents")
fr: ! [Modifier les documents] (../../_ statique / images / documents / edit_document.png "modifier les documents")
sw: ! [Hariri hati] (../../_ tuli/picha/hati/hariri_document.png "Hariri Hati"))

source: Edit Documents
fr: Modifier les documents
sw: Hariri hati

source: When editing a document, you can replace the file associated with that document record. This means you can update documents without having to update the pages they're on. Changing the file changes it on all pages that use the document. You can also change the collection of the document by clicking on the Collection dropdown on the edit page and selecting a new collection of your choice. Add or remove tags using the Tags field on the edit screen. Once you are done editing a document, save your edits by clicking Save at the bottom of the edit screen.
fr: Lors de la modification d'un document, vous pouvez remplacer le fichier associé par cet enregistrement de document. Cela signifie que vous pouvez mettre à jour des documents sans avoir à mettre à jour les pages sur lesquelles ils sont. La modification du fichier le modifie sur toutes les pages qui utilisent le document. Vous pouvez également modifier la collection du document en cliquant sur la liste déroulante de la collection sur la page d'édition et en sélectionnant une nouvelle collection de votre choix. Ajoutez ou supprimez des balises à l'aide du champ Tags sur l'écran d'édition. Une fois que vous avez terminé la modification d'un document, enregistrez vos modifications en cliquant sur Enregistrer en bas de l'écran d'édition.
sw: Wakati wa kuhariri hati, unaweza kubadilisha faili inayohusiana na rekodi hiyo ya hati. Hii inamaanisha unaweza kusasisha hati bila kusasisha kurasa walizo kwenye. Kubadilisha faili hubadilisha kwenye kurasa zote zinazotumia hati. Unaweza pia kubadilisha mkusanyiko wa hati hiyo kwa kubonyeza kushuka kwa ukusanyaji kwenye ukurasa wa hariri na kuchagua mkusanyiko mpya wa chaguo lako. Ongeza au ondoa vitambulisho kwa kutumia uwanja wa vitambulisho kwenye skrini ya hariri. Mara tu ukimaliza kuhariri hati, okoa mabadiliko yako kwa kubonyeza Hifadhi chini ya skrini ya Hariri.

source: To completely delete a document and its record, select the document by clicking the checkbox at the left-hand side of the document record row in the Documents interface. Then click Delete from the action bar displayed at the bottom of the Documents interface.
fr: Pour supprimer complètement un document et son enregistrement, sélectionnez le document en cliquant sur la case à cocher sur le côté gauche de la ligne d'enregistrement du document dans l'interface Documents. Cliquez ensuite sur Supprimer de la barre d'action affichée en bas de l'interface Documents.
sw: Ili kufuta kabisa hati na rekodi yake, chagua hati hiyo kwa kubonyeza kisanduku cha upande wa kushoto wa safu ya rekodi ya hati kwenye kigeuzi cha Hati. Kisha bonyeza Futa kutoka kwa bar ya hatua iliyoonyeshwa chini ya kigeuzi cha hati.

source: ![Delete Documents](../../_static/images/documents/delete_document.png "Delete Documents")
fr: ! [Supprimer des documents] (../../_ statique / images / documents / delete_document.png "Delete Documents")
sw: ! [Futa hati] (../../_ tuli/picha/hati/DELETE_DOCUMENT.PNG "Futa hati"))

source: Delete Documents
fr: Supprimer des documents
sw: Futa hati

source: You can also delete a document and its record from the edit screen when editing a document by clicking Delete document at the bottom of the edit screen.
fr: Vous pouvez également supprimer un document et son enregistrement de l'écran d'édition lors de la modification d'un document en cliquant sur Supprimer le document en bas de l'écran d'édition.
sw: Unaweza pia kufuta hati na rekodi yake kutoka kwa skrini ya Hariri wakati wa kuhariri hati kwa kubonyeza hati ya kufuta chini ya skrini ya Hariri.

source: Deleted documents cannot be recovered.
fr: Les documents supprimés ne peuvent pas être récupérés.
sw: Hati zilizofutwa haziwezi kupatikana.

source: Forms
fr: Formes
sw: Fomu

source: Add, edit, and remove images
fr: Ajouter, modifier et supprimer des images
sw: Ongeza, hariri, na uondoe picha

source: If you want to edit, add, or remove images from the Admin interface outside of the individual pages, you can do so from the Images interface. To access the Images interface, click Images in the Sidebar.
fr: Si vous souhaitez modifier, ajouter ou supprimer des images de l'interface d'administration en dehors des pages individuelles, vous pouvez le faire à partir de l'interface d'images. Pour accéder à l'interface d'images, cliquez sur les images dans la barre latérale.
sw: Ikiwa unataka kuhariri, kuongeza, au kuondoa picha kutoka kwa interface ya admin nje ya kurasa za mtu binafsi, unaweza kufanya hivyo kutoka kwa interface ya picha. Ili kufikia interface ya picha, bonyeza picha kwenye pembeni.

source: ![Manage Images](../../_static/images/icons_and_images/manage_images.png "Manage Images")
fr: ! [Gérer les images] (../../_ statique / images / icons_and_images / manage_images.png "Gérer les images")
sw: ! [Dhibiti picha] (../../_ tuli/picha/icons_and_images/usimamizi_images.png "Dhibiti picha")

source: Manage Images
fr: Gérer les images
sw: Dhibiti picha

source: It is possible to select multiple images from the Images interface at once. To do this, select the checkbox on the top left of each image block, then use the bulk actions bar at the bottom to perform an action on all selected images.
fr: Il est possible de sélectionner plusieurs images dans l'interface d'images à la fois. Pour ce faire, sélectionnez la case à cocher en haut à gauche de chaque bloc d'image, puis utilisez la barre des actions en vrac en bas pour effectuer une action sur toutes les images sélectionnées.
sw: Inawezekana kuchagua picha nyingi kutoka kwa interface ya picha mara moja. Ili kufanya hivyo, chagua kisanduku cha kuangalia upande wa kushoto wa kila block ya picha, kisha utumie bar ya vitendo vya wingi chini kufanya hatua kwenye picha zote zilizochaguliwa.

source: ![Select Images](../../_static/images/icons_and_images/select_images.png "Select Images")
fr: ! [Sélectionner des images] (../../_ static / images / icons_and_images / select_images.png "sélectionner des images")
sw: ! [Chagua Picha] (../../_ tuli/picha/icons_and_images/select_images.png "Chagua Picha")

source: Select Images
fr: Sélectionner des images
sw: Chagua picha

source: Also, the ClimWeb allows you to edit the data associated with an image by clicking on the image to access its edit screen. Image data includes the title, the file, the collection associated with it, the associated tags, and the focal area.
fr: En outre, le Clipweb vous permet de modifier les données associées à une image en cliquant sur l'image pour accéder à son écran d'édition. Les données d'image incluent le titre, le fichier, la collection qui y est associée, les balises associées et la zone focale.
sw: Pia, ClimWeb hukuruhusu kuhariri data inayohusiana na picha kwa kubonyeza picha ili kufikia skrini yake ya hariri. Takwimu za picha ni pamoja na kichwa, faili, mkusanyiko unaohusishwa nayo, vitambulisho vinavyohusika, na eneo la kuzingatia.

source: Changing the image file when editing an image updates the image without updating the pages on which it appears.
fr: La modification du fichier image lors du montage d'une image met à jour l'image sans mettre à jour les pages sur lesquelles il apparaît.
sw: Kubadilisha faili ya picha wakati wa kuhariri picha husasisha picha bila kusasisha kurasa ambazo inaonekana.

source: Edit Images
fr: Modifier les images
sw: Hariri picha

source: Changing the file will change it on all pages that use the image.
fr: La modification du fichier le modifiera sur toutes les pages qui utilisent l'image.
sw: Kubadilisha faili itabadilisha kwenye kurasa zote zinazotumia picha.

source: Set the focal area of an image
fr: Définir la zone focale d'une image
sw: Weka eneo la picha

source: The Images interface allows you to set a focal area, which can affect how your image displays to visitors on the front end. If you crop your images in some way to make them fit into a specific shape, then the focal area defines the centre point from which you crop the images.
fr: L'interface d'images vous permet de définir une zone focale, ce qui peut affecter la façon dont votre image s'affiche aux visiteurs à l'avant. Si vous recadrez vos images d'une manière ou d'une autre pour les faire s'intégrer dans une forme spécifique, la zone focale définit le point central à partir duquel vous recadrez les images.
sw: Sura ya Picha hukuruhusu kuweka eneo la kuzingatia, ambalo linaweza kuathiri jinsi picha yako inavyoonyesha kwa wageni upande wa mbele. Ikiwa unapanda picha zako kwa njia fulani ili kuwafanya iwe sawa katika sura fulani, basi eneo la kuzingatia linafafanua hatua ya katikati ambayo unapanda picha.

source: You can set the focal area of an image by clicking the image to access its edit screen. Then drag a marquee around the most significant element of the image, and then click Save to save it. Once you set the focal area of an image and save it, you can see the most significant element of the image on the front end.
fr: Vous pouvez définir la zone focale d'une image en cliquant sur l'image pour accéder à son écran d'édition. Faites ensuite glisser un chapiteau autour de l'élément le plus important de l'image, puis cliquez sur Enregistrer pour l'enregistrer. Une fois que vous avez défini la zone focale d'une image et la sauvegarder, vous pouvez voir l'élément le plus significatif de l'image à l'avant.
sw: Unaweza kuweka eneo la msingi la picha kwa kubonyeza picha ili kufikia skrini yake ya hariri. Kisha vuta jumba karibu na kitu muhimu zaidi cha picha, kisha ubonyeze Hifadhi ili uihifadhi. Mara tu ukiweka eneo la picha na kuihifadhi, unaweza kuona kitu muhimu zaidi cha picha kwenye mwisho wa mbele.

source: To remove the focal area, click Remove focal area in the edit screen.
fr: Pour supprimer la zone focale, cliquez sur Supprimer la zone focale dans l'écran d'édition.
sw: Kuondoa eneo la kuzingatia, bonyeza Ondoa eneo la kuzingatia kwenye skrini ya Hariri.

source: Snippets
fr: Extraits

source: Using Snippets
fr: En utilisant des extraits
sw: Kutumia viunzi
