Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: This is useful when you want a page to be available in multiple places. For example, if you have a page about Publications as a child page of Home, and you want to make the Publications page available in the Pastries section.
fr: Ceci est utile lorsque vous souhaitez qu'une page soit disponible à plusieurs endroits. Par exemple, si vous avez une page sur les publications en tant que page d'enfants de la maison, et que vous souhaitez rendre la page Publications disponible dans la section Pastries.
sw: Hii ni muhimu wakati unataka ukurasa kupatikana katika maeneo mengi. Kwa mfano, ikiwa una ukurasa kuhusu machapisho kama ukurasa wa watoto wa nyumbani, na unataka kufanya ukurasa wa machapisho kupatikana katika sehemu ya keki.

source: Creating an alias for an existing page is similar to creating a copy. Hover over a page in the Explorer page, click More, and then select Copy. Selecting Copy takes you to the copy page form. On the copy page form, choose another page as the parent page by clicking Choose another page.
fr: La création d'un alias pour une page existante est similaire à la création d'une copie. Survolez une page dans la page Explorer, cliquez plus, puis sélectionnez Copier. La sélection de la copie vous amène au formulaire de page de copie. Dans le formulaire de page Copier, choisissez une autre page comme page parent en cliquant sur Choisissez une autre page.
sw: Kuunda jina la ukurasa uliopo ni sawa na kuunda nakala. Tembea juu ya ukurasa katika ukurasa wa Explorer, bonyeza zaidi, kisha uchague Nakili. Chagua nakala inakuchukua kwa fomu ya ukurasa wa nakala. Kwenye fomu ya ukurasa wa nakala, chagua ukurasa mwingine kama ukurasa wa mzazi kwa kubonyeza chagua ukurasa mwingine.

source: Then, click the Alias checkbox and click Copy this page to complete the aliasing.
fr: Ensuite, cliquez sur la case à cocher Alias ​​et cliquez sur Copier cette page pour compléter l'alias.
sw: Kisha, bonyeza kisanduku cha ukaguzi wa Alias ​​na ubonyeze Nakili Ukurasa huu ili kukamilisha kutengwa.

source: ![Alias Page](../../_static/images/pages/alias_page.png "Alias Page")
fr: ! [Page d'alias] (../../_ statique / images / pages / alias_page.png "page d'alias")

source: Alias Page
fr: Page d'alias
sw: Ukurasa wa Alias

source: Congratulations, you just aliased a page. You can now find your aliased page on the Explorer page of the parent page.
fr: Félicitations, vous venez d'alias une page. Vous pouvez maintenant trouver votre page aliasée sur la page Explorer de la page parent.
sw: Hongera, umeweka tu ukurasa. Sasa unaweza kupata ukurasa wako uliowekwa kwenye ukurasa wa Explorer wa ukurasa wa mzazi.

source: If you try to edit the aliased page, you get a notification that it's an alias of another page. To edit an aliased page, you have two options:
fr: Si vous essayez de modifier la page aliasée, vous obtenez une notification selon laquelle il s'agit d'un alias d'une autre page. Pour modifier une page aliasée, vous avez deux options:
sw: Ukijaribu kuhariri ukurasa ulioandaliwa, unapata arifa kuwa ni jina la ukurasa mwingine. Ili kuhariri ukurasa ulioandaliwa, una chaguzi mbili:

source: Edit the original page. This option changes both the original page and the aliased page.
fr: Modifiez la page d'origine. Cette option modifie à la fois la page d'origine et la page aliasée.
sw: Hariri ukurasa wa asili. Chaguo hili hubadilisha ukurasa wa asili na ukurasa ulioandaliwa.

source: Convert the alias page to an ordinary page, which is a copy of the original. If you choose this option, you must make manual changes to the alias page in order for it to be in sync with the original page.
fr: Convertissez la page Alias ​​en une page ordinaire, qui est une copie de l'original. Si vous choisissez cette option, vous devez apporter des modifications manuelles à la page Alias ​​pour qu'elle soit synchronisée avec la page d'origine.
sw: Badilisha ukurasa wa Alias ​​kuwa ukurasa wa kawaida, ambao ni nakala ya asili. Ukichagua chaguo hili, lazima ufanye mabadiliko ya mwongozo kwenye ukurasa wa Alias ​​ili iwe katika kusawazisha na ukurasa wa asili.

source: About Page
fr: À propos de la page
sw: Kuhusu ukurasa

source: Create an About Page
fr: Créer une page à propos
sw: Unda ukurasa kuhusu

source: The creation of this page assumes you have already created an organisation index page which is the parent page of this page. To create an organisation index page, please refer to [Managing Organisation Page](./Manage-Organisation).
fr: La création de cette page suppose que vous avez déjà créé une page d'index d'organisation qui est la page parent de cette page. Pour créer une page d'index de l'organisation, veuillez vous référer à [Gérer la page de l'organisation] (./ Manage-Organisation).
sw: Uundaji wa ukurasa huu unadhani tayari umeunda ukurasa wa index wa shirika ambao ni ukurasa wa mzazi wa ukurasa huu. Ili kuunda ukurasa wa index ya shirika, tafadhali rejelea [Ukurasa wa Kusimamia Ukurasa] (./ Usimamizi-shirika).

source: To create an about page, navigate to organisation page and create a child page from it selecting the about page.
fr: Pour créer une page à propos, accédez à la page de l'organisation et créez une page enfant à partir de la sélection de la page À propos.
sw: Ili kuunda ukurasa wa Kuhusu, nenda kwa Ukurasa wa Shirika na uunda ukurasa wa watoto kutoka kwa kuchagua ukurasa wa Kuhusu.

source: ![About page](../../../_static/images/about/add_about_page.png "About page")
fr: ! [À propos de la page] (../../../_ statique / images / about / add_about_page.png "À propos de la page")
sw: ! [Kuhusu ukurasa] (../../../_ tuli/picha/kuhusu/add_about_page.png "kuhusu ukurasa")

source: About page
fr: À propos de la page
sw: Kuhusu ukurasa

source: ![About page](../../../_static/images/about/select_about_page.png "About page")
fr: ! [À propos de la page] (../../../_ statique / images / À propos / select_about_page.png "À propos de la page")
sw: ! [Kuhusu ukurasa] (../../../_ tuli/picha/kuhusu/kuchagua_about_page.png "kuhusu ukurasa")

source: The About page is divided into various sections.
fr: La page À propos est divisée en différentes sections.
sw: Ukurasa wa karibu umegawanywa katika sehemu mbali mbali.

source: ![About page](../../../_static/images/about/about_sections.png "About page")
fr: ! [À propos de la page] (../../../_ statique / images / about / about_sections.png "À propos de la page")
sw: ! [Kuhusu ukurasa] (../../../_ tuli/picha/kuhusu/karibu_sections.png "kuhusu ukurasa")

source: The sections include:
fr: Les sections comprennent:
sw: Sehemu hizo ni pamoja na:

source: **Banner Section** - this contains the banner image, title, subtitle and call to action button. If no banner image is provided then this section will not be displayed
fr: ** Section de bannières ** - Cela contient l'image de la bannière, le titre, le sous-titre et le bouton d'appel à l'action. Si aucune image de bannière n'est fournie, cette section ne sera pas affichée
sw: ** Sehemu ya mabango ** - Hii ina picha ya mabango, kichwa, subtitle na wito kwa kitufe cha hatua. Ikiwa hakuna picha ya mabango iliyotolewa basi sehemu hii haitaonyeshwa

source: ![Banner Sections](../../../_static/images/about/banner_section.png "Banner Sections")
fr: ! [Sections de bannières] (../../../_ statique / images / about / banner_section.png "sections de bannières")

source: ![Introduction Sections](../../../_static/images/about/introduction_section.png "Introduction Sections")
fr: ! [Sections d'introduction] (../../../_ statique / images / À propos / introduction_section.png "Sections d'introduction")
sw: ! [Sehemu za utangulizi] (../../../_ tuli/picha/karibu/utangulizi_section.png "sehemu za utangulizi"))

source: **Mission and Vision Section** - this is the organisation's mission and vision
fr: ** Mission and Vision Section ** - Ceci est la mission et la vision de l'organisation
sw: ** Sehemu ya Misheni na Maono ** - Hii ndio dhamira na maono ya shirika

source: ![Mission & Vision Sections](../../../_static/images/about/mission_vision_section.png "Mission & Vision Sections")
fr: ! [Sections de mission et de vision] (../../../_ statique / images / À propos / mission_vision_section.png "sections de mission et de vision")

source: Mission & Vision Sections
fr: Sections de mission et de vision
sw: Sehemu za Misheni na Maono

source: **Organisation Structure Section** - this contains a heading description and image of the organisational structure.
fr: ** Section de la structure de l'organisation ** - Ceci contient une description de la tête et une image de la structure organisationnelle.
sw: ** Sehemu ya muundo wa shirika ** - Hii ina maelezo ya kichwa na picha ya muundo wa shirika.

source: ![Organisation Structure Sections](../../../_static/images/about/organisation_structure_section.png "Organisation Structure Sections")
fr: ! [Sections de structure d'organisation] (../../../_ statique / images / about / organisation_structure_section.png "Sections de structure d'organisation")

source: Organisation Structure Sections
fr: Sections de structure d'organisation
sw: Sehemu za muundo wa shirika

source: **Historical Timeline Section** - the historical timeline section allows for narration of the history of the organisation grouping the milestones on an yearly basis.
fr: ** Section de chronologie historique ** - La section chronologique historique permet la narration de l'histoire de l'organisation regroupant les étapes chaque année.
sw: ** Sehemu ya Kihistoria ya Kihistoria ** - Sehemu ya kihistoria ya kihistoria inaruhusu hadithi ya historia ya shirika linaloweka hatua muhimu kila mwaka.

source: ![Historical Timeline Sections](../../../_static/images/about/history_timeline_section.png "Historical Timeline Sections")
fr: ! [Sections de chronologie historique] (../../../_ statique / images / À propos / historique_timeline_section.png "Sections de chronologie historiques")
sw: ! [Sehemu za kihistoria za nyakati] (..

source: Historical Timeline Sections
fr: Sections de chronologie historique
sw: Sehemu za kihistoria za nyakati

source: **Additional Materials** - any additional material including documents or images relating to the organisation can be added here for download.
fr: ** Matériaux supplémentaires ** - Tout matériel supplémentaire comprenant des documents ou des images relatifs à l'organisation peut être ajouté ici pour télécharger.
sw: ** Vifaa vya ziada ** - Nyenzo yoyote ya ziada ikiwa ni pamoja na hati au picha zinazohusiana na shirika zinaweza kuongezwa hapa kwa kupakuliwa.

source: ![Additional Materials](../../../_static/images/about/additional_material.png "Additional Materials")
fr: ! [Matériaux supplémentaires] (../../../_ statique / images / about / addition_material.png "Matériaux supplémentaires")
sw: ! [Vifaa vya ziada] (../../../_ tuli/picha/kuhusu/ziada_material.png "vifaa vya ziada")

source: Additional Materials
fr: Matériaux supplémentaires
sw: Vifaa vya ziada

source: ![Feature Block Sections](../../../_static/images/services/feature_block_section.png "Projects Sections")
fr: ! [Sections de blocs de fonctions] (../../../_ statique / images / services / fonctionnalités_block_section.png "Projets sections")
sw: ! [Sehemu za kuzuia sehemu] (../../../_ tuli/picha/huduma/kipengele_block_section.png "Sehemu za miradi")))

source: **Bottom Call to action Section** - call to action button at the bottom of the page.
fr: ** Section d'appel inférieure à l'action ** - bouton d'appel à l'action en bas de la page.
sw: ** Simu ya chini kwa sehemu ya hatua ** - Piga simu kwa kitufe cha hatua chini ya ukurasa.

source: ![Bottom CTA Sections](../../../_static/images/about/bottom_cta_section.png "Bottom CTA Sections")
fr: ! [Sections CTA inférieures] (../../../_ statique / images / À propos / bottom_cta_section.png "Sections CTA inférieures")

source: Bottom CTA Sections
fr: Sections CTA inférieures
sw: Sehemu za chini za CTA

source: Organisation Pages
fr: Pages d'organisation
sw: Kurasa za shirika

source: ![Organisation page](../../../_static/images/organisation/organisation_preview.png "Organisation page")
fr: ! [Page d'organisation] (../../../_ statique / images / organisation / organisation_preview.png "Page d'organisation")
sw: ! [Ukurasa wa shirika] (../../../_ tuli/picha/shirika/shirika_preview.png "ukurasa wa shirika")

source: The Organisational Index page lists the pages below:
fr: La page d'index organisationnelle répertorie les pages ci-dessous:
sw: Ukurasa wa index ya shirika huorodhesha kurasa hapa chini:

source: To create the overall organisation page that houses the pages above, begin by adding a child page to the home page and selecting 'Organisation Index Page'.
fr: Pour créer la page d'organisation globale qui abrite les pages ci-dessus, commencez par ajouter une page d'enfant à la page d'accueil et la sélection de la «page d'index de l'organisation».
sw: Ili kuunda ukurasa wa jumla wa shirika ambao una kurasa hapo juu, anza kwa kuongeza ukurasa wa watoto kwenye ukurasa wa nyumbani na uchague 'Ukurasa wa Index wa Shirika'.

source: ![Organisation page](../../../_static/images/organisation/add_organisation_page.png "Organisation page")
fr: ! [Page d'organisation] (../../../_ statique / images / organisation / add_organisation_page.png "Page d'organisation")
sw: ! [Ukurasa wa shirika] (../../../_ tuli/picha/shirika/add_organisation_page.png "ukurasa wa shirika")

source: ![Organisation page](../../../_static/images/organisation/select_organisation_page.png "Organisation page")
fr: ! [Page d'organisation] (../../../_ statique / images / organisation / select_organisation_page.png "Page d'organisation")
sw: ! [Ukurasa wa shirika] (../../../_ tuli/picha/shirika/kuchagua_organisation_page.png "ukurasa wa shirika")

source: Populate the form with page title and listing heading as below:
fr: Remplissez le formulaire avec le titre de la page et la liste des listes comme ci-dessous:
sw: Panga fomu na kichwa cha ukurasa na orodha ya kichwa kama ilivyo hapo chini:

source: ![Organisation page](../../../_static/images/organisation/organisation_page.png "Organisation page")
fr: ! [Page d'organisation] (../../../_ statique / images / organisation / organisation_page.png "Page d'organisation")
sw: ! [Ukurasa wa shirika] (../../../_ tuli/picha/shirika/shirika_page.png "ukurasa wa shirika")

source: This option will only appear if an 'Organisation Index Page' does not already exist as only one instance of this page is allowed. If it already exists proceed to prepare the other pages listed above.
fr: Cette option n'apparaîtra que si une «page d'index d'organisation» n'existe pas déjà car une seule instance de cette page est autorisée. S'il existe déjà, procurez-vous pour préparer les autres pages énumérées ci-dessus.
sw: Chaguo hili litaonekana tu ikiwa 'ukurasa wa index ya shirika' haipo tayari kama mfano mmoja tu wa ukurasa huu unaruhusiwa. Ikiwa tayari ipo itaendelea kuandaa kurasa zingine zilizoorodheshwa hapo juu.

source: Partners Page
fr: Page des partenaires
sw: Ukurasa wa Washirika

source: The steps to create a partners page are:
fr: Les étapes pour créer une page de partenaires sont:
sw: Hatua za kuunda ukurasa wa Washirika ni:

source: Create a list of partners
fr: Créer une liste de partenaires
sw: Unda orodha ya washirika

source: Create a partners page
fr: Créer une page de partenaires
sw: Unda ukurasa wa Washirika

source: 1. Create a list of partners
fr: 1. Créez une liste de partenaires
sw: 1. Unda orodha ya washirika

source: To list partners begin by accessing the partners menu from snippets as shown below.
fr: Pour répertorier les partenaires, commencez par accéder au menu des partenaires à partir des extraits comme indiqué ci-dessous.
sw: Ili kuorodhesha washirika anza kwa kupata menyu ya Washirika kutoka kwa snippets kama inavyoonyeshwa hapa chini.

source: ![List Partners](../../../_static/images/partners/partners_explorer.png "List Partners")
fr: ! [Liste des partenaires] (../../../_ statique / images / partenaires / partenaires_explorer.png "Liste partenaires")
sw: ! [Washirika wa orodha] (../../../_ tuli/picha/washirika/washirika_explorer.png "washirika wa orodha"))))))

source: List Partners
fr: Liste des partenaires
sw: Washirika wa orodha

source: Click on add partners
fr: Cliquez sur Ajouter des partenaires
sw: Bonyeza Ongeza Washirika

source: ![Add Partners](../../../_static/images/partners/add_partner.png "Add Partners")
fr: ! [Ajouter des partenaires] (../../../_ statique / images / partenaires / add_partner.png "Ajouter des partenaires")

source: Add Partners
fr: Ajouter des partenaires
sw: Ongeza washirika

source: Provide the partner name, logo, link to website and any other relevant info in the form.
fr: Fournissez le nom du partenaire, le logo, le lien vers le site Web et toute autre information pertinente dans le formulaire.
sw: Toa jina la mwenzi, nembo, kiunga kwa Tovuti na habari nyingine yoyote muhimu katika fomu.

source: ![Partners](../../../_static/images/partners/partner.png "Partners")
fr: ! [Partenaires] (../../../_ statique / images / partenaires / partenaire.png "partenaires")
sw: ! [Washirika] (../../../_ tuli/picha/washirika/mwenzi.png "washirika"))

source: Partners
fr: Partenaires
sw: Washirika

source: Repeat this process to list more partners
fr: Répétez ce processus pour répertorier plus de partenaires
sw: Rudia mchakato huu kuorodhesha washirika zaidi

source: 2. Create a partners page
fr: 2. Créer une page de partenaires
sw: 2. Unda ukurasa wa Washirika

source: To create a partner page, navigate to organisation page and create a child page from it selecting the about page.
fr: Pour créer une page de partenaire, accédez à la page de l'organisation et créez une page enfant à partir de la sélection de la page À propos.
sw: Ili kuunda ukurasa wa washirika, nenda kwa ukurasa wa shirika na uunda ukurasa wa watoto kutoka kwa kuchagua ukurasa wa Kuhusu.

source: ![Partner page](../../../_static/images/partners/add_partner_page.png "Partner page")
fr: ! [Page de partenaire] (../../../_ statique / images / partenaires / add_partner_page.png "page partenaire")
sw: ! [Ukurasa wa mwenzi] (../../../_ tuli/picha/washirika/add_partner_page.png "ukurasa wa mshirika")

source: Partner page
fr: Page de partenaire
sw: Ukurasa wa mwenzi

source: The Partners page contains the sections below:
fr: La page des partenaires contient les sections ci-dessous:
sw: Ukurasa wa Washirika una sehemu hapa chini:

source: ![Partner page](../../../_static/images/partners/partner_sections.png "Partner page")
fr: ! [Page de partenaire] (../../../_ statique / images / partenaires / partenaire_sections.png "page partenaire")
sw: ! [Ukurasa wa mwenzi] (../../../_ tuli/picha/washirika/mwenzi_sections.png "ukurasa wa mwenzi")

source: ![Banner Sections](../../../_static/images/partners/banner_section.png "Banner Sections")
fr: ! [Sections de bannières] (../../../_ statique / images / partenaires / bannière_section.png "sections de bannières")
sw: ! [Sehemu za mabango] (../../../_ tuli/picha/washirika/banner_section.png "Sehemu za mabango")

source: ![Introduction Sections](../../../_static/images/partners/introduction_section.png "Introduction Sections")
fr: ! [Sections d'introduction] (../../../_ statique / images / partenaires / introduction_section.png "Sections d'introduction")
sw: ! [Sehemu za utangulizi] (../../../_ tuli/picha/washirika/utangulizi_section.png "sehemu za utangulizi"))

source: **Partners Call to Action Section**
fr: ** SECTION DE CALL à l'action des partenaires **
sw: ** Washirika wanaita sehemu ya hatua **

source: ![Partner CTA Sections](../../../_static/images/partners/partner_cta.png "Partner CTA Sections")
fr: ! [Sections CTA partenaires] (../../../_ statique / images / partenaires / partenaire_cta.png "Sections CTA partenaires")
sw: ! [Sehemu za Mshirika CTA] (..

source: Partner CTA Sections
fr: Sections partenaires CTA
sw: Sehemu za CTA

source: All listed partners in step 1 will be displayed automatically on the partners page.
fr: Tous les partenaires répertoriés à l'étape 1 seront affichés automatiquement sur la page des partenaires.
sw: Washirika wote waliotajwa katika hatua ya 1 wataonyeshwa kiatomati kwenye ukurasa wa Washirika.

source: Projects
fr: Projets
sw: Miradi

source: Create a Projects Listing Page
fr: Créer une page d'inscription de projets
sw: Unda ukurasa wa orodha ya miradi

source: To create a project listing page, navigate to organisation page and create a child page from it selecting the projects listing page.
fr: Pour créer une page de liste de projets, accédez à la page de l'organisation et créez une page enfant à partir de la sélection de la page de liste des projets.
sw: Ili kuunda ukurasa wa orodha ya mradi, nenda kwa ukurasa wa shirika na uunda ukurasa wa watoto kutoka kwa kuchagua ukurasa wa orodha ya miradi.

source: ![Projects List page](../../../_static/images/about/add_about_page.png "Projects List page")
fr: ! [Page de liste des projets] (../../../_ statique / images / À propos / add_about_page.png "Page de liste des projets")
sw: ! [Ukurasa wa Orodha ya Miradi] (..

source: Projects List page
fr: Page de liste des projets
sw: Ukurasa wa orodha ya miradi

source: The Projects Listing page is divided into various sections.
fr: La page de liste des projets est divisée en différentes sections.
sw: Ukurasa wa orodha ya miradi imegawanywa katika sehemu mbali mbali.

source: ![Projects List page](../../../_static/images/projects/project_sections.png "Projects List page")
fr: ! [Page de liste des projets] (../../../_ statique / images / projets / project_sections.png "Page de liste des projets")
sw: ! [Ukurasa wa Orodha ya Miradi] (..

source: **Other Settings** - this holds information on Projects per page.
fr: ** Autres paramètres ** - Cela contient des informations sur les projets par page.
sw: ** Mipangilio mingine ** - Hii inashikilia habari juu ya miradi kwa kila ukurasa.

source: Create a Projects Page
fr: Créer une page de projets
sw: Unda ukurasa wa Miradi

source: To create a project page, navigate to project listing page and create a child page.
fr: Pour créer une page de projet, accédez à la page de liste des projets et créez une page enfant.
sw: Ili kuunda ukurasa wa mradi, nenda kwenye ukurasa wa orodha ya mradi na uunda ukurasa wa watoto.

source: ![Projects page](../../../_static/images/projects/add_project_item.png "Projects page")
fr: ! [Page des projets] (../../../_ statique / images / projets / add_project_item.png "PAGE DE PROJETS")
sw: ! [Ukurasa wa miradi] (../../../_ tuli/picha/miradi/add_project_item.png "ukurasa wa miradi"))))))

source: Projects page
fr: Page des projets
sw: Ukurasa wa miradi

source: ![Projects page](../../../_static/images/projects/project_item_sections.png "Projects page")
fr: ! [Page des projets] (../../../_ statique / images / projets / project_item_sections.png "Page de projets")
sw: ! [Ukurasa wa miradi] (../../../_ tuli/picha/miradi/mradi_item_sections.png "miradi ya miradi")))))))

source: **Services** - this is a list of services linked to the project. ![Services Sections](../../../_static/images/projects/services_section.png "Services Sections")
fr: ** Services ** - Il s'agit d'une liste de services liés au projet. ! [Sections de services] (../../../_ statique / images / projets / services_section.png "Sections de services")
sw: ** Huduma ** - Hii ni orodha ya huduma zilizounganishwa na mradi. ! [Sehemu za huduma] (../../../_ tuli/picha/miradi/huduma_section.png "Sehemu za Huduma"))

source: Services Sections
fr: Sections de services
sw: Sehemu za huduma

source: **Projects full name, short name, begin and end date**
fr: ** Projets Nom complet, nom court, début et fin de la date **
sw: ** miradi jina kamili, jina fupi, anza na tarehe ya mwisho **
