Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: **Countries have recognized the ClimWeb's potential to significantly enhance service provision and elevate visibility** not only among their public but also across line ministries and other stakeholders at the national, regional, and global levels. The ClimWeb is expected to foster greater public trust in the products and warnings, enhance national visibility, and improve institutional positioning within government structures. Additionally, its integration with digital marketing tools like email marketing and social media is anticipated to spur user growth. The ClimWeb has also been designed to optimize the utilization of satellite products, amplify the impact and visibility of warnings, and enable more effective comparison of national, regional and global forecast, and monitoring products.
fr: ** Les pays ont reconnu le potentiel de l'ascension pour améliorer considérablement la prestation de services et augmenter la visibilité ** non seulement parmi leur public mais aussi dans les ministères de ligne et d'autres parties prenantes aux niveaux national, régional et mondial. Le montée devrait favoriser une plus grande confiance du public dans les produits et les avertissements, améliorer la visibilité nationale et améliorer le positionnement institutionnel au sein des structures gouvernementales. De plus, son intégration avec des outils de marketing numérique comme le marketing par e-mail et les médias sociaux devrait stimuler la croissance des utilisateurs. Le montée a également été conçue pour optimiser l'utilisation des produits satellites, amplifier l'impact et la visibilité des avertissements et permettre une comparaison plus efficace des prévisions nationales, régionales et mondiales et de surveillance des produits.
sw: ** Nchi zimetambua uwezo wa ClipWeb wa kuongeza kwa kiasi kikubwa utoaji wa huduma na kuinua mwonekano ** sio tu kati ya umma wao lakini pia katika wizara za mstari na wadau wengine katika ngazi za kitaifa, kikanda, na ulimwengu. Clipweb inatarajiwa kukuza uaminifu mkubwa wa umma katika bidhaa na maonyo, kuongeza mwonekano wa kitaifa, na kuboresha msimamo wa kitaasisi ndani ya miundo ya serikali. Kwa kuongeza, ujumuishaji wake na zana za uuzaji za dijiti kama uuzaji wa barua pepe na media ya kijamii inatarajiwa kukuza ukuaji wa watumiaji. ClimWeb pia imeundwa kuongeza utumiaji wa bidhaa za satelaiti, kukuza athari na mwonekano wa maonyo, na kuwezesha kulinganisha kwa ufanisi zaidi kwa utabiri wa kitaifa, kikanda na ulimwengu, na bidhaa za kuangalia.

source: **Given the crucial role of a website as an institution's global interface, it is recommended that the ClimWeb be made broadly accessible to NMHSs across Africa**. The WMO's continued technical support in customizing and adopting the ClimWeb is essential. A professional, user-friendly, and service-oriented website will bolster NMHSs' presence and demonstrate their value at the national level, potentially leading to increased funding and recognition from national governments.
fr: ** Compte tenu du rôle crucial d'un site Web en tant qu'interface mondiale d'une institution, il est recommandé que l'escalade soit largement accessible aux NMHS à travers l'Afrique **. Le support technique continu de l'OMM dans la personnalisation et l'adoption de l'escalade est essentiel. Un site Web professionnel, convivial et axé sur les services renforcera la présence de NMHSS et démontrera sa valeur au niveau national, conduisant potentiellement à une augmentation du financement et de la reconnaissance des gouvernements nationaux.
sw: ** Kwa kuzingatia jukumu muhimu la wavuti kama kiufundi cha kimataifa cha taasisi, inashauriwa kwamba Clipweb iweze kupatikana kwa NMHSS kote Afrika **. Msaada wa kiufundi wa WMO unaoendelea katika kubinafsisha na kupitisha ClimWeb ni muhimu. Wavuti ya kitaalam, ya kupendeza, na inayoelekezwa kwa huduma itaongeza uwepo wa NMHSS na kuonyesha thamani yao katika kiwango cha kitaifa, na kusababisha kuongezeka kwa ufadhili na kutambuliwa kutoka kwa serikali za kitaifa.

source: Licensing and Operational Guidelines
fr: Lignes de licence et directives opérationnelles
sw: Miongozo ya Leseni na Utendaji

source: Adopting a Free Open Software System (FOSS) License for the ClimWeb is recommended, catering to the diverse needs of NMHSs. While the ClimWeb is specifically tailored for meteorological services, it should be noted that WMO offers it without any liability or warranty. NMHSs are encouraged to employ the ClimWeb according to their preferences, with the assurance of continued assistance from WMO and its partners in areas of installation and staff training.
fr: L'adoption d'une licence gratuite de système de logiciel ouvert (FOSS) pour l'escalade est recommandée, répondant aux divers besoins du NMHSS. Bien que l'escalade soit spécifiquement adaptée aux services météorologiques, il convient de noter que WMO l'offre sans aucune responsabilité ni garantie. Les NMHS sont encouragés à employer le climail en fonction de leurs préférences, avec l'assurance de l'assistance continue de la WMO et de ses partenaires dans les domaines de l'installation et de la formation du personnel.
sw: Kupitisha leseni ya mfumo wa bure wa programu (FOSS) ya ClimWeb inapendekezwa, ikizingatia mahitaji anuwai ya NMHSS. Wakati ClimWeb imeundwa mahsusi kwa huduma za hali ya hewa, ikumbukwe kwamba WMO inatoa bila dhima yoyote au dhamana. NMHSS inahimizwa kuajiri ClimWeb kulingana na upendeleo wao, na uhakikisho wa msaada unaoendelea kutoka kwa WMO na washirika wake katika maeneo ya ufungaji na mafunzo ya wafanyikazi.

source: Establishing a Community of Practice and Digital Public Good
fr: Établir une communauté de pratique et de bien public numérique
sw: Kuanzisha jamii ya mazoezi na nzuri ya umma ya dijiti

source: **In recognition of its transformative potential, the ClimWeb should be declared a "Digital Public Good."** This status will enhance its global visibility and utility. Furthermore, establishing a community of practice, comprising experts from various fields including ICT, climate science, and social sciences is crucial. This community will play a pivotal role in ensuring the ClimWeb's continuous development, adapting it to the evolving challenges in climate services. A " Digital Public Good" refers to digital products, typically software, data, AI models, standards, or content, that adhere to specific criteria of openness and inclusivity. These goods are designed to foster collaboration and inclusivity, often focusing on solving societal challenges especially in areas such as climate, healthcare, education, and governance. The annexe contains further information on the criteria for digital public goods.
fr: ** En reconnaissance de son potentiel transformateur, l'escalade doit être déclarée «bien publique numérique». ** Ce statut améliorera sa visibilité mondiale et son utilité. En outre, l'établissement d'une communauté de pratique, comprenant des experts de divers domaines, notamment les TIC, les sciences du climat et les sciences sociales, est crucial. Cette communauté jouera un rôle central pour assurer le développement continu de l'escalade, en l'adaptant aux défis en évolution des services climatiques. Un «bien public numérique» fait référence à des produits numériques, généralement des logiciels, des données, des modèles d'IA, des normes ou du contenu, qui adhèrent à des critères spécifiques d'ouverture et d'inclusivité. Ces biens sont conçus pour favoriser la collaboration et l'inclusivité, se concentrant souvent sur la résolution des défis sociétaux, en particulier dans des domaines tels que le climat, les soins de santé, l'éducation et la gouvernance. L'annexe contient plus d'informations sur les critères de biens publics numériques.
sw: ** Kwa kutambua uwezo wake wa mabadiliko, Clipweb inapaswa kutangazwa kuwa "nzuri ya umma ya dijiti." ** Hali hii itaongeza mwonekano wake wa ulimwengu na matumizi. Kwa kuongezea, kuanzisha jamii ya mazoezi, inajumuisha wataalam kutoka nyanja mbali mbali ikiwa ni pamoja na ICT, sayansi ya hali ya hewa, na sayansi ya kijamii ni muhimu. Jamii hii itachukua jukumu muhimu katika kuhakikisha maendeleo endelevu ya Clipweb, na kuibadilisha na changamoto zinazoibuka katika huduma za hali ya hewa. "Umma mzuri wa dijiti" inamaanisha bidhaa za dijiti, kawaida programu, data, mifano ya AI, viwango, au yaliyomo, ambayo hufuata vigezo maalum vya uwazi na umoja. Bidhaa hizi zimetengenezwa kukuza ushirikiano na umoja, mara nyingi huzingatia kutatua changamoto za kijamii haswa katika maeneo kama hali ya hewa, huduma ya afya, elimu, na utawala. Kiambatisho kina habari zaidi juu ya vigezo vya bidhaa za umma za dijiti.

source: **To ensure sustainable maintenance and iteration of the system functionalities and technologies we recommend developing a community of practice** made of ICT, climate and social science experts from NMHSs, Regional Climate Centers, Global Producing Centers, Satellite Agencies, Universities and any relevant institutions leading in innovation in climate services.
fr: ** Pour garantir la maintenance et l'itération durables des fonctionnalités et technologies du système, nous recommandons de développer une communauté de pratique ** Fabriqué en TIC, en climat et en sciences sociales des NMHS, des centres de climat régionaux, des centres de production mondiaux, des agences satellites, des universités et des institutions pertinentes menant à l'innovation dans les services climatiques.
sw: ** Ili kuhakikisha matengenezo endelevu na iteration ya utendaji wa mfumo na teknolojia tunapendekeza kukuza jamii ya mazoezi ** iliyotengenezwa na ICT, wataalam wa hali ya hewa na sayansi ya kijamii kutoka NMHSS, vituo vya hali ya hewa, vituo vya uzalishaji wa ulimwengu, mashirika ya satelaiti, vyuo vikuu na taasisi zozote zinazoongoza katika uvumbuzi katika huduma za hali ya hewa.

source: Global Accessibility and Contribution to Early Warning Systems
fr: Accessibilité et contribution mondiales aux systèmes d'alerte précoce
sw: Ufikiaji wa ulimwengu na mchango kwa mifumo ya tahadhari ya mapema

source: **Expanding the ClimWeb’s reach beyond Africa is vital, aligning with the goals of the UN's Early Warning for All Initiative**. The ClimWeb, with its advanced tools and integrations, can significantly enhance early warning systems globally, thereby contributing to improved disaster preparedness and response.
fr: ** Élargir la portée de l'ascension au-delà de l'Afrique est vital, s'aligner sur les objectifs de l'alerte précoce de l'ONU pour toute initiative **. Le montée, avec ses outils et intégrations avancés, peut améliorer considérablement les systèmes d'alerte précoce à l'échelle mondiale, contribuant ainsi à une meilleure préparation aux catastrophes et à la réponse.
sw: ** Kupanua ufikiaji wa Clipweb zaidi ya Afrika ni muhimu, kuendana na malengo ya onyo la mapema la UN kwa mpango wote **. Clipweb, pamoja na zana zake za hali ya juu na ujumuishaji, inaweza kuongeza mifumo ya tahadhari mapema ulimwenguni, na hivyo inachangia kuboresha utayari wa janga na majibu.

source: Enhanced Visibility and Resource Accessibility
fr: Visibilité améliorée et accessibilité des ressources
sw: Kuonekana kwa kujulikana na upatikanaji wa rasilimali

source: **To maximize its impact, the ClimWeb's code and user guides should be made widely accessible**. A dedicated landing page, alongside distribution through partner organizations' websites and networks, will ensure ease of access and usability. This step is crucial in promoting transparency, user engagement, and the system's widespread adoption.
fr: ** Pour maximiser son impact, le code et les guides utilisateur de l'escalade doivent être rendus largement accessibles **. Une page de destination dédiée, aux côtés de la distribution par le biais de sites Web et de réseaux des organisations partenaires, garantira une facilité d'accès et une convivialité. Cette étape est cruciale pour promouvoir la transparence, l'engagement des utilisateurs et l'adoption généralisée du système.
sw: ** Ili kuongeza athari zake, nambari za ClipWeb na miongozo ya watumiaji inapaswa kupatikana kupatikana **. Ukurasa wa kutua uliojitolea, pamoja na usambazaji kupitia wavuti za mashirika ya washirika na mitandao, itahakikisha urahisi wa ufikiaji na utumiaji. Hatua hii ni muhimu katika kukuza uwazi, ushiriki wa watumiaji, na kupitishwa kwa mfumo.

source: Resources
fr: Ressources
sw: Rasilimali

source: [ClimWeb Pitch](https://wmoomm-my.sharepoint.com/:b:/g/personal/gochieng_wmo_int/EWTk5L0QQ1dAmg3XFvdTzbQBdUjD4kvdQyDV_Dnm7DrVFQ)
fr: [Pitch de Clipweb] (https://wmoomm-my.sharepoint.com/:b:/g/personal/gochieng_wmo_int/ewtk5l0qq1damg3xfvdtzbqbdujd4kvdqydv_dnm7drvfq)

source: [Installation guide](https://github.com/wmo-raf/nmhs-cms-init)
fr: [Guide d'installation] (https://github.com/wmo-raf/nmhs-cms-nit)
sw: [Mwongozo wa Ufungaji] (https://github.com/wmo-raf/nmhs-cms-ninit)

source: [Customization training parts](https://wmoomm-my.sharepoint.com/:b:/g/personal/gochieng_wmo_int/EXeqk659MglNsoNABgpku-UBa2HZFZj56WxUMYQEY58jeg)
fr: [Pièces de formation sur la personnalisation] (https://wmoomm-my.sharepoint.com/:b:/g/personal/gochieng_wmo_int/exeqk659mglnsonabgpku-uba2hzfzj56wxumyqey58jeg)

source: [Customization video Tutorials](https://wmoomm-my.sharepoint.com/:f:/g/personal/gochieng_wmo_int/Eg92KovWP0xBm3P8coKyX6IBrQDlTXsqirP1uUCDi-yfhQ)
fr: [Tutoriels vidéo de personnalisation] (https://wmoomm-my.sharepoint.com/:f:/g/personal/gochieng_wmo_int/eg92kovwp0xbm3p8cokyx6ibrqdltxsqirp1uucdi-yfhq)

source: Rationale
fr: Raisonnement
sw: Hoja

source: Supporting the achievement of WMO’s Long Term Goals and implementation of flagship initiatives in Africa
fr: Soutenir la réalisation des objectifs à long terme de l'OMM et la mise en œuvre des initiatives phares en Afrique
sw: Kuunga mkono kufanikiwa kwa malengo ya muda mrefu ya WMO na utekelezaji wa mipango ya bendera barani Afrika

source: To cover everyone on earth with early warnings by 2027
fr: Pour couvrir tout le monde sur Terre avec les premiers avertissements d'ici 2027
sw: Kufunika kila mtu duniani na maonyo ya mapema ifikapo 2027

source: Supporting the Global Multi-hazard Alert System (GMAS) for Africa
fr: Soutenir le Système d'alerte multi-Hazard Global (GMAS) pour l'Afrique
sw: Kusaidia Mfumo wa tahadhari ya Global Hazard (GMAs) kwa Afrika

source: Digital transformation of NMHSs in the region
fr: Transformation numérique de NMHSS dans la région
sw: Mabadiliko ya dijiti ya NMHSS katika mkoa

source: In February 2023, the eighteenth session of the Regional Association I (RA I) took note of the recommendation from the Regional Conference on the emerging needs of NMHSs in Africa on digital transformation and requested in [Decision 13 (RA I-18)](https://library.wmo.int/viewer/57803/?offset=1#page=56&viewer=picture&o=bookmark&n=0&q=) the Secretary-General and Technical Commissions to support regional activities to close the gaps in the region. In this context, thereafter, **the World Meteorological Organization (WMO) Regional Office for Africa developed a Content Management System (ClimWeb) as a website template specifically designed to aid the digital transformation of National Meteorological and Hydrological Services (NMHSs) in Africa.**
fr: En février 2023, la dix-huitième session de l'Association régionale I (RA I) a pris note de la recommandation de la Conférence régionale sur les besoins émergents du NMHSS en Afrique sur la transformation numérique et a demandé dans [la décision 13 (RA I-18)] (https://library.wmo.int/viewer/57803/?offset=1#page=56&viewer=picture&o=bookmark&n=0&q=) Les commissions du secrétaire général et techniques pour soutenir les activités régionales pour conclure les lacs de la région. Dans ce contexte, par la suite, ** L'Office régional pour l'Afrique de l'Organisation météorologique mondiale (WMO) a développé un système de gestion de contenu (Clipweb) en tant que modèle de site Web spécialement conçu pour faciliter la transformation numérique des services météorologiques et hydrologiques nationaux (NMHS) en Afrique. **
sw: Mnamo Februari 2023, kikao cha kumi na nane cha Chama cha Mkoa I (RA I) kiligundua pendekezo kutoka kwa Mkutano wa Mkoa juu ya mahitaji yanayoibuka ya NMHSS barani Afrika juu ya mabadiliko ya dijiti na ombi katika [Uamuzi 13 (RA I-18)] (https://library.wmo.int/viewer/57803/?offset=1#page=56&viewer=Picture&o=Bookmark&n=0&q=) Katibu wakuu na Tume za Ufundi kusaidia shughuli za kikanda ili kufunga mapengo katika mkoa huo. Katika muktadha huu, baadaye, ** Ofisi ya Mkoa wa Meteorological World (WMO) kwa Afrika ilitengeneza mfumo wa usimamizi wa maudhui (CLIMWEB) kama template ya wavuti iliyoundwa mahsusi kusaidia mabadiliko ya dijiti ya huduma za hali ya hewa za kitaifa na hydrological (NMHSS) barani Afrika. **

source: Supporting key United Nations conventions and initiatives
fr: Soutenir les principales conventions et initiatives des Nations Unies
sw: Kuunga mkono mikusanyiko na mipango muhimu ya Umoja wa Mataifa

source: The Paris Agreement on Climate Change (2015) and NDCs
fr: The Paris Accord on Climate Change (2015) et NDCS
sw: Mkataba wa Paris juu ya Mabadiliko ya Tabianchi (2015) na NDCS

source: The United Nations Framework Convention on Climate Change (UNFCCC)
fr: La Convention sur le cadre des Nations Unies sur le changement climatique (CCNUCC)
sw: Mkutano wa Mfumo wa Umoja wa Mataifa juu ya Mabadiliko ya Tabianchi (UNFCCC)

source: The Sendai Framework for Disaster Risk Reduction
fr: Le cadre Sendai pour la réduction des risques de catastrophe
sw: Mfumo wa Sendai wa kupunguza hatari ya janga

source: The UN Sustainable Development Goals (UN SDGs)
fr: Les objectifs de développement durable des Nations Unies (OND des Nations Unies)
sw: Malengo ya Maendeleo Endelevu ya UN (UN SDGs)

source: The Convention on Biological Diversity (CBD)
fr: La Convention sur la diversité biologique (CBD)
sw: Mkutano wa Tofauti za Biolojia (CBD)

source: The United Nations Convention to Combat Desertification (UNCCD)
fr: La Convention des Nations Unies pour lutter contre la désertification (UNCCD)
sw: Mkutano wa Umoja wa Mataifa Kupambana na Jangwa (UNCCD)

source: Supporting African policies and plans
fr: Soutenir les politiques et plans africains
sw: Kusaidia sera na mipango ya Kiafrika

source: African Union's Climate Change Strategy (2020-2030)
fr: Stratégie de changement climatique de l'Union africaine (2020-2030)
sw: Mkakati wa Mabadiliko ya Tabianchi ya Afrika (2020-2030)

source: African Union's Agenda 2063 "The Africa We Want"
fr: Afrique de l'Union africaine 2063 "L'Afrique que nous voulons"
sw: Ajenda ya Jumuiya ya Afrika 2063 "Afrika Tunayotaka"

source: African Union's Digital Transformation Strategy for Africa (2020-2030)
fr: Stratégie de transformation numérique de l'Union africaine pour l'Afrique (2020-2030)
sw: Mkakati wa Mabadiliko ya Dijiti ya Afrika kwa Afrika (2020-2030)

source: Climate Change, Disaster Risk Reduction, Environment, and Food Security strategies by Regional Economic Commissions ( AMU, CEN-SAD, COMESA, EAC, ECCAS, ECOWAS, IGAD, and SADC)
fr: Changement climatique, réduction des risques de catastrophe, environnement et stratégies de sécurité alimentaire par les commissions économiques régionales (AMU, CEN-SAD, COMEA, EAC, ECCAS, CECEAS, IGAD et SADC)
sw: Mabadiliko ya hali ya hewa, kupunguza hatari ya janga, mazingira, na mikakati ya usalama wa chakula na tume za kiuchumi za mkoa (AMU, CEN-SAD, CENTA, EAC, ECCAS, ECOWAS, IGAD, na SADC)

source: Technology
fr: Technologie
sw: Teknolojia

source: The ClimWeb includes tools and functionalities aimed at supporting the NMHSs in their daily website management activities, in providing information and services to their users.
fr: Le Clipweb comprend des outils et des fonctionnalités visant à soutenir le NMHSS dans leurs activités quotidiennes de gestion de sites Web, en fournissant des informations et des services à leurs utilisateurs.
sw: ClimWeb ni pamoja na zana na kazi zinazolenga kusaidia NMHSS katika shughuli zao za usimamizi wa wavuti, katika kutoa habari na huduma kwa watumiaji wao.

source: This section seeks to present the choice of technologies, development approach and present the packages that support the functionalities available on the ClimWeb at a high level.
fr: Cette section vise à présenter le choix des technologies, à approcher de développement et à présenter les packages qui soutiennent les fonctionnalités disponibles sur l'escalade à un niveau élevé.
sw: Sehemu hii inatafuta kuwasilisha uchaguzi wa teknolojia, mbinu ya maendeleo na kuwasilisha vifurushi ambavyo vinaunga mkono utendaji unaopatikana kwenye Clipweb kwa kiwango cha juu.

source: The developed ClimWeb is open-source and hosted on GitHub at [https://github.com/wmo-raf/nmhs-cms](https://github.com/wmo-raf/nmhs-cms)
fr: Le Clivebweb développé est ouvert et hébergé sur GitHub à [https://github.com/wmo-raf/nmhs-cms .(https://github.com/wmo-raf/nmhs-cms)
sw: ClipWeb iliyoandaliwa ni chanzo-wazi na mwenyeji wa GitHub kwa [https://github.com/wmo-raf/nmhs-cms ah

source: Base ClimWeb Framework
fr: Cadre de montée de base
sw: Mfumo wa msingi wa kupanda

source: The website template is built on top of the open-source [Wagtail](https://wagtail.org/) Framework. Wagtail itself is built on of [Django](https://www.djangoproject.com/) , which is a high-level Python web framework that encourages rapid development and clean, pragmatic design
fr: Le modèle de site Web est construit au-dessus du cadre de la source ouverte [https://wagtail.org/). Worktail lui-même est construit sur [django] (https://www.djangoproject.com/), qui est un cadre Web Python de haut niveau qui encourage le développement rapide et la conception pragmatique rapide et pragmatique
sw: Kiolezo cha wavuti kimejengwa juu ya chanzo-wazi [wagtail] (https://wagtail.org/) mfumo. Wagtail yenyewe imejengwa juu ya [Django] (https://www.djangoproject.com/), ambayo ni mfumo wa wavuti wa hali ya juu ambao unahimiza maendeleo ya haraka na safi, muundo wa pragmatic

source: ![ClimWeb Framework](../_static/images/technology/CMS_Framework.png "ClimWeb Framework")
fr: ! [Framework Climweb] (../_ Static / Images / Technology / CMS_Framework.png "Framework Climweb")

source: ClimWeb Framework
fr: Cadre de montée
sw: Mfumo wa kupanda

source: The following was taken into consideration when picking Wagtail as the framework of choice:
fr: Ce qui suit a été pris en considération lors de la sélection des bergeronnettes comme cadre de choix:
sw: Ifuatayo ilizingatiwa wakati wa kuchagua Wagtail kama mfumo wa chaguo:

source: **Python as the programming language**. The weather and climate domain requires a lot of interaction with scientific data. Python is one of the scripting languages that makes it easy to develop procedures for manipulating this kind of data. Developing a website using Python thus allows the flexibility of developing data-based functionalities
fr: ** Python comme langage de programmation **. Le domaine météorologique et climatique nécessite beaucoup d'interaction avec les données scientifiques. Python est l'une des langues de script qui facilite le développement de procédures pour manipuler ce type de données. Le développement d'un site Web utilisant Python permet ainsi la flexibilité de développer des fonctionnalités basées sur des données
sw: ** Python kama lugha ya programu **. Kikoa cha hali ya hewa na hali ya hewa kinahitaji mwingiliano mwingi na data ya kisayansi. Python ni moja wapo ya lugha ya maandishi ambayo inafanya iwe rahisi kukuza taratibu za kudhibiti aina hii ya data. Kuendeleza wavuti kwa kutumia Python kwa hivyo inaruhusu kubadilika kwa kukuza utendaji wa msingi wa data
