Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: **5. What with NMHSs services that do not have IT people**
fr: ** 5. Quoi avec les services NMHSS qui n'ont pas les gens de l'informatique **
sw: ** 5. Nini na huduma za NMHSS ambazo hazina watu wa IT **

source: A fundamental aspect considered during the design and development phase of the ClimWeb was to establish a clear and well-defined system for managing content and page structure. This involved creating a **user-friendly interface with a modern design and intuitive features,** aimed at providing users with a seamless and enjoyable experience. The objective was to enable users to easily locate content and utilize the ClimWeb **without the need for specialized IT skills**.
fr: Un aspect fondamental considéré pendant la phase de conception et de développement de l'escalade était d'établir un système clair et bien défini pour gérer le contenu et la structure des pages. Cela impliquait de créer une interface ** conviviale avec une conception moderne et des fonctionnalités intuitives ** visant à offrir aux utilisateurs une expérience transparente et agréable. L'objectif était de permettre aux utilisateurs de localiser facilement le contenu et d'utiliser le climail ** sans avoir besoin de compétences informatiques spécialisées **.
sw: Kipengele cha msingi kinachozingatiwa wakati wa muundo na hatua ya maendeleo ya ClimWeb ilikuwa kuanzisha mfumo wazi na ulioelezewa vizuri wa kusimamia yaliyomo na muundo wa ukurasa. Hii ilihusisha kuunda interface ya utumiaji wa ** na muundo wa kisasa na sifa za angavu, ** inayolenga kuwapa watumiaji uzoefu wa mshono na wa kufurahisha. Kusudi lilikuwa kuwezesha watumiaji kupata kwa urahisi yaliyomo na kutumia ClimWeb ** bila hitaji la ujuzi maalum wa IT **.

source: **6. Security risks?**
fr: ** 6. Risques de sécurité? **
sw: ** 6. Hatari za usalama? **

source: The ClimWeb, which is being built using open-source technologies, benefits from the advantage of having a community of developers who actively contribute to enhancing its security and stability. Furthermore, the ClimWeb offers robust **support for secure authentication mechanisms**, including username/password authentication, integration with third-party authentication systems such as OAuth, and the ability to implement custom authentication backends. Additionally, the ClimWeb performs **regular backups to safeguard the website's data** and enable its restoration in case of data loss. The NMHS are encouraged to share **only the final products** intended for the public.
fr: Le climail, qui est en cours de construction à l'aide de technologies open source, profite de l'avantage d'avoir une communauté de développeurs qui contribuent activement à améliorer sa sécurité et sa stabilité. En outre, le Clipweb offre une prise en charge robuste ** pour les mécanismes d'authentification sécurisés **, y compris l'authentification du nom d'utilisateur / mot de passe, l'intégration avec des systèmes d'authentification tiers tels que OAuth et la possibilité de mettre en œuvre des backends d'authentification personnalisés. De plus, le Clipweb effectue ** des sauvegardes régulières pour protéger les données du site Web ** et activer sa restauration en cas de perte de données. Les NMH sont encouragés à partager ** uniquement les produits finaux ** destinés au public.
sw: Climweb, ambayo inajengwa kwa kutumia teknolojia za chanzo-wazi, inafaidika na faida ya kuwa na jamii ya watengenezaji ambao wanachangia kikamilifu kuongeza usalama wake na utulivu. Kwa kuongezea, ClimWeb inatoa msaada wa nguvu ** kwa mifumo salama ya uthibitishaji **, pamoja na jina la mtumiaji/uthibitisho wa nenosiri, kuunganishwa na mifumo ya uthibitishaji wa mtu wa tatu kama OAuth, na uwezo wa kutekeleza marudio ya uthibitisho wa kawaida. Kwa kuongeza, ClimWeb hufanya backups za kawaida ili kulinda data ya wavuti ** na kuwezesha urejesho wake ikiwa utapoteza data. NMHS inahimizwa kushiriki ** bidhaa za mwisho tu ** zilizokusudiwa kwa umma.

source: **7. Where is it hosted?**
fr: ** 7. Où est-il hébergé? **
sw: ** 7. Inakaribishwa wapi? **

source: The ClimWeb is deployed **at the National Meteorological and Hydrological Service (NMHS) level,** utilising either **cloud-based infrastructure or on-premises servers**. Please refer to the provided **server specifications** for more details on the hosting environment.
fr: Le montée est déployée ** au niveau national des services météorologiques et hydrologiques (NMHS), ** en utilisant ** une infrastructure basée sur le cloud ou des serveurs sur site **. Veuillez vous référer aux Spécifications du serveur ** fournies ** pour plus de détails sur l'environnement d'hébergement.
sw: ClipWeb imepelekwa ** katika kiwango cha kitaifa cha hali ya hewa na huduma ya hydrological (NMHS), ** kutumia miundombinu ya msingi wa wingu au seva za majengo **. Tafadhali rejelea maelezo yaliyotolewa ** seva ** kwa maelezo zaidi juu ya mazingira ya mwenyeji.

source: **8. Is WMO RAF managing or handing over completely?**
fr: ** 8. WMO RAF gère-t-il ou remet complètement? **
sw: ** 8. Je! WMO RAF inasimamia au kukabidhi kabisa? **

source: The **NMHSs independently manage all components of the ClimWeb in a decentralized manner** at the departmental level. The ClimWeb includes an administrative role (superuser) that possesses complete privileges to access all components of the system. Further information regarding users and roles can be found at (https://github.com/wmo-raf/nmhs-cms/wiki/Manage-Users-and-Roles). It is important to note that WMO RAF does not have involvement in managing the ClimWeb, as its administration and control lie solely with the NMHSs. While WMO RAF does not directly manage the ClimWeb, it does offer valuable support to NMHSs by **providing training and guidance** on the proper management of the ClimWeb. WMO's role is to assist NMHSs in acquiring the necessary knowledge and skills to effectively handle and maintain the ClimWeb. This training and guidance aim to empower NMHSs in utilizing the ClimWeb to its full potential and ensuring optimal performance and functionality.
fr: Les ** NMHSS gèrent indépendamment toutes les composantes de l'escalade de manière décentralisée ** au niveau départemental. Le montée comprend un rôle administratif (superutilisateur) qui possède des privilèges complets pour accéder à toutes les composantes du système. De plus amples informations concernant les utilisateurs et les rôles peuvent être trouvées sur (https://github.com/wmo-raf/nmhs-cms/wiki/manage-users-and-rales). Il est important de noter que WMO RAF n'a pas d'implication dans la gestion de l'escalade, car son administration et son contrôle se trouvent uniquement avec le NMHSS. Bien que WMO RAF ne gère pas directement l'escalade, il offre un soutien précieux à NMHSS en ** fournissant une formation et des conseils ** sur la bonne gestion de l'escalade. Le rôle de WMO est d'aider les NMHS à acquérir les connaissances et les compétences nécessaires pour gérer et maintenir efficacement le climatiseur. Cette formation et cette orientation visent à permettre aux NMHS de l'utilisation de l'escalade à son plein potentiel et d'assurer des performances et des fonctionnalités optimales.
sw: NMHSS inasimamia kwa uhuru sehemu zote za kupanda kwa njia ya madaraka ** katika kiwango cha idara. Clipweb ni pamoja na jukumu la kiutawala (superser) ambalo lina haki kamili ya kupata vifaa vyote vya mfumo. Habari zaidi kuhusu watumiaji na majukumu yanaweza kupatikana katika (https://github.com/wmo-raf/nmhs-cms/wiki/manage-users-and-roles). Ni muhimu kutambua kuwa WMO RAF haina kuhusika katika kusimamia ClimWeb, kwani utawala wake na udhibiti wake uko tu na NMHSS. Wakati WMO RAF haisimamia moja kwa moja ClimWeb, inatoa msaada muhimu kwa NMHSS kwa ** kutoa mafunzo na mwongozo ** juu ya usimamizi sahihi wa Clipweb. Jukumu la WMO ni kusaidia NMHSS katika kupata maarifa na ujuzi muhimu wa kushughulikia vizuri na kudumisha kupanda. Mafunzo haya na mwongozo huu yanalenga kuwezesha NMHSS katika kutumia ClimWeb kwa uwezo wake kamili na kuhakikisha utendaji mzuri na utendaji.

source: **9. Training and capacity building: how will it be done?**
fr: ** 9. Formation et renforcement des capacités: comment sera-t-il fait? **
sw: ** 9. Mafunzo na Uwezo wa Uwezo: Itafanywaje? **

source: WMO RAF will conduct training sessions for the ClimWeb, which can be arranged in **either face-to-face or online formats**. Comprehensive **training materials**, including user guides (https://github.com/wmo-raf/nmhs-cms/wiki) and developer guides (https://github.com/wmo-raf/nmhs-cms), are also available. The training sessions will be specifically targeted towards designated **departmental focal points **responsible for each component of the ClimWeb. This approach ensures that the training is tailored to meet the specific needs and roles within the NMHS, enabling efficient knowledge transfer and effective utilization of the ClimWeb.
fr: WMO RAF organisera des séances de formation pour le Clipweb, qui peut être organisé en ** FACE-TO FACE OU OU FORMATS EN LIGNE **. Comprehensive ** Materials de formation **, y compris les guides utilisateur (https://github.com/wmo-raf/nmhs-cms/wiki) et les guides de développeur (https://github.com/wmo-raf/nmhs-cms), sont également disponibles. Les séances de formation seront spécifiquement destinées à des points focaux du département désignés ** Responsable de chaque composant du climatiseur. Cette approche garantit que la formation est adaptée pour répondre aux besoins et rôles spécifiques au sein du NMHS, permettant un transfert de connaissances efficace et une utilisation efficace du climatiseur.
sw: WMO RAF itafanya vikao vya mafunzo kwa Clipweb, ambayo inaweza kupangwa katika ** ama uso kwa uso au fomati mkondoni **. Vifaa vya mafunzo kamili ** **, pamoja na miongozo ya watumiaji (https://github.com/wmo-raf/nmhs-cms/wiki) na waongozaji wa msanidi programu (https://github.com/wmo-raf/nmhs-cms), pia zinapatikana. Vipindi vya mafunzo vitaelekezwa mahsusi kwa alama za msingi za idara ** kuwajibika kwa kila sehemu ya Clipweb. Njia hii inahakikisha kuwa mafunzo hayo yameundwa kukidhi mahitaji na majukumu maalum ndani ya NMHS, kuwezesha uhamishaji mzuri wa maarifa na utumiaji mzuri wa ClimWeb.

source: **10. What about NMHS that want to migrate their website? What provision for migration?**
fr: ** 10. Qu'en est-il des NMH qui souhaitent migrer leur site Web? Quelle disposition pour la migration? **
sw: ** 10. Je! Ni nini kuhusu NMHS ambazo zinataka kuhamia tovuti yao? Je! Ni kifungu gani cha uhamiaji? **

source: The migration process will commence by initially **identifying the current content of the pages, as well as identifying additional pages that may be relevant and determining any obsolete content**. Moreover, recommendations will be provided regarding optimal practices pertaining to wording, images, colors, and other related aspects. The manual migration of each page will be conducted in collaboration with departmental focal points to ensure efficient coordination.
fr: Le processus de migration commencera par initialement ** identifiant le contenu actuel des pages, ainsi qu'en identifiant des pages supplémentaires qui peuvent être pertinentes et déterminer tout contenu obsolète **. De plus, des recommandations seront fournies concernant les pratiques optimales concernant le libellé, les images, les couleurs et autres aspects connexes. La migration manuelle de chaque page sera menée en collaboration avec des points focaux ministériels pour assurer une coordination efficace.
sw: Mchakato wa uhamiaji utaanza kwa hapo awali ** kutambua yaliyomo ya kurasa, na pia kutambua kurasa za ziada ambazo zinaweza kuwa muhimu na kuamua yaliyomo ya zamani **. Kwa kuongezea, mapendekezo yatatolewa kuhusu mazoea bora yanayohusiana na maneno, picha, rangi, na mambo mengine yanayohusiana. Uhamiaji wa mwongozo wa kila ukurasa utafanywa kwa kushirikiana na sehemu za msingi za idara ili kuhakikisha uratibu mzuri.

source: **11. What support will be offered by WMO RAF?**
fr: ** 11. Quel soutien sera offert par WMO RAF? **
sw: ** 11. Je! Ni msaada gani utatolewa na WMO RAF? **

source: Support on the operationalization of the ClimWeb cuts across:
fr: Soutien sur l'opérationnalisation des coupes de l'escalade:
sw: Msaada juu ya Utendaji wa Kupunguzwa kwa Clipweb kote:

source: Assessing Quality and interactivity of existing NMHS website
fr: Évaluation de la qualité et de l'interactivité du site Web NMHS existant
sw: Kutathmini ubora na maingiliano ya wavuti ya NMHS iliyopo

source: Approach and present the ClimWeb to the NMHS. Integrate suggested feedback
fr: Approchez et présentez le montée au NMHS. Intégrer les commentaires suggérés
sw: Njia na uwasilishe kwa NMHS. Unganisha maoni yaliyopendekezwa

source: Identify departmental focal points for ClimWeb coordination including overall ClimWeb administrator
fr: Identifier les points focaux ministériels pour la coordination de l'ascension, y compris l'administrateur global de l'entraînement
sw: Tambua sehemu za msingi za idara kwa uratibu wa ClimWeb pamoja na Msimamizi wa Climweb wa jumla

source: Installation and setup of ClimWeb in-premise servers/cloud servers
fr: Installation et configuration des serveurs sur site / serveurs de cloud Cliveb
sw: Ufungaji na usanidi wa seva za ndani za seva/seva za wingu

source: Provision one-on-one training and capacity building to departmental focal points on configuration and customization of the ClimWeb and Website
fr: Provision Formation individuelle et renforcement des capacités aux points focaux départementaux sur la configuration et la personnalisation du clignotement et du site Web
sw: Kutoa mafunzo ya moja kwa moja na kujenga uwezo kwa sehemu za msingi za idara juu ya usanidi na ubinafsishaji wa barabara na wavuti

source: Provision of learning materials, documentations, and guides of the ClimWeb
fr: Provision de matériel d'apprentissage, de documents et de guides de l'escalade
sw: Utoaji wa vifaa vya kujifunzia, nyaraka, na miongozo ya ClimWeb

source: Follow-up support in troubleshooting and resolving technical bugs
fr: Support de suivi dans le dépannage et la résolution des bogues techniques
sw: Kufuatilia msaada katika kusuluhisha na kutatua mende wa kiufundi

source: This also includes the implementation of CAP Alerts, Georeferenced data visualization, email marketing, events, surveys, and user analytics integration.
fr: Cela comprend également la mise en œuvre des alertes CAP, la visualisation des données géoréférencée, le marketing par e-mail, les événements, les enquêtes et l'intégration d'analyse des utilisateurs.
sw: Hii pia ni pamoja na utekelezaji wa arifu za CAP, taswira ya data ya georefered, uuzaji wa barua pepe, hafla, uchunguzi, na ujumuishaji wa uchambuzi wa watumiaji.

source: **12. How does the ClimWeb work in low internet connectivity**
fr: ** 12. Comment fonctionne l'escalade dans une connectivité Internet faible **
sw: ** 12. Je! Kupanda kunafanyaje kazi katika uunganisho wa mtandao wa chini **

source: The ClimWeb is optimized for low bandwidth scenarios. This involves the minimisation of the use of large images, videos or heavy media files that might consume a significant amount of bandwidth. The ClimWeb also supports **caching mechanisms** that can help reduce the load on the server and improve the website’s performance. By enabling caching, static content can be stored on the user's device, reducing the need for repeated downloads, and enhancing the experience on low bandwidth connections.
fr: Le montée est optimisée pour les scénarios de bande passante faible. Cela implique la minimisation de l'utilisation de grandes images, vidéos ou fichiers multimédias lourds qui pourraient consommer une quantité importante de bande passante. Le Clipweb prend également en charge ** les mécanismes de mise en cache ** qui peuvent aider à réduire la charge sur le serveur et à améliorer les performances du site Web. En activant la mise en cache, le contenu statique peut être stocké sur l'appareil de l'utilisateur, en réduisant le besoin de téléchargements répétés et en améliorant l'expérience sur les connexions à faible bande passante.
sw: Clipweb imeboreshwa kwa hali ya chini ya bandwidth. Hii inajumuisha kupunguzwa kwa utumiaji wa picha kubwa, video au faili nzito za media ambazo zinaweza kutumia kiwango kikubwa cha bandwidth. ClimWeb pia inasaidia ** mifumo ya caching ** ambayo inaweza kusaidia kupunguza mzigo kwenye seva na kuboresha utendaji wa wavuti. Kwa kuwezesha caching, yaliyomo tuli yanaweza kuhifadhiwa kwenye kifaa cha mtumiaji, kupunguza hitaji la kupakua mara kwa mara, na kuongeza uzoefu kwenye unganisho la chini la bandwidth.

source: **13. Geo-referenced data visualization: What data sources and formats are supported?**
fr: ** 13. Visualisation des données géo-référencées: quelles sources de données et formats sont pris en charge? **
sw: ** 13. Utazamaji wa Takwimu zilizorejelewa za Geo: Je! Ni vyanzo gani vya data na fomati zinazosaidiwa? **

source: An essential feature provided by the ClimWeb is its capability to **facilitate interactive visualization of georeferenced data**. This includes the ability to upload and visualize gridded data in formats such as NetCDF and GeoTIFF, as well as vector data in the form of points and polygons. The ClimWeb also supports the integration of CAP Alerts and enables the inclusion of data from external Web Map Service (WMS) sources for comprehensive data visualization.
fr: Une caractéristique essentielle fournie par le Clipweb est sa capacité à ** faciliter la visualisation interactive des données géoréférencées **. Cela inclut la possibilité de télécharger et de visualiser les données grillées dans des formats tels que NetCDF et Geotiff, ainsi que des données vectorielles sous la forme de points et de polygones. Le Clipweb prend également en charge l'intégration des alertes CAP et permet l'inclusion de données à partir de sources externes de services de cartes Web (WMS) pour une visualisation complète des données.
sw: Kipengele muhimu kinachotolewa na ClimWeb ni uwezo wake wa ** kuwezesha taswira ya maingiliano ya data ya georefered **. Hii ni pamoja na uwezo wa kupakia na kuibua data iliyokatwa katika fomati kama vile NetCDF na Geotiff, pamoja na data ya vector katika mfumo wa vidokezo na polygons. ClimWeb pia inasaidia ujumuishaji wa arifu za CAP na inawezesha kuingizwa kwa data kutoka kwa huduma za nje za ramani ya wavuti (WMS) kwa taswira kamili ya data.

source: **14. Can they use the CAP editor alone?**
fr: ** 14. Peuvent-ils utiliser l'éditeur de cap seul? **
sw: ** 14. Je! Wanaweza kutumia mhariri wa cap peke yako? **

source: The CAP Editor has been developed to be flexible in its deployment options. It can be run independently as a **standalone application**, which is accessible at https://github.com/wmo-raf/cap-editor. Alternatively, it can be fully **integrated into the ClimWeb**, providing seamless management of CAP Alerts within the ClimWeb environment. More information about the integration and usage can be found at https://github.com/wmo-raf/nmhs-cms/wiki/Manage-CAP-Alerts.
fr: L'éditeur CAP a été développé pour être flexible dans ses options de déploiement. Il peut être exécuté indépendamment en tant qu'application autonome ** **, qui est accessible sur https://github.com/wmo-raf/cap-editor. Alternativement, il peut être entièrement ** intégré dans le climail **, fournissant une gestion transparente des alertes CAP dans l'environnement de l'ascension. Plus d'informations sur l'intégration et l'utilisation peuvent être trouvées sur https://github.com/wmo-raf/nmhs-cms/wiki/manage-cap-lerts.
sw: Mhariri wa CAP ameandaliwa kuwa rahisi katika chaguzi zake za kupelekwa. Inaweza kuendeshwa kwa uhuru kama programu ya ** ya kusimama **, ambayo inapatikana kwa https://github.com/wmo-raf/cap-editor. Vinginevyo, inaweza kuwa kamili ** kuunganishwa ndani ya Clipweb **, kutoa usimamizi usio na mshono wa arifu za CAP ndani ya mazingira ya Clipweb. Habari zaidi juu ya ujumuishaji na utumiaji inaweza kupatikana katika https://github.com/wmo-raf/nmhs-cms/wiki/manage-cap-alerts.

source: ![ClimWeb Kit](../_static/images/home/cms_package_kit.jpg "ClimWeb Kit")
fr: ! [Kit de climatisation] (../_ statique / images / home / cms_package_kit.jpg "kit de climatise")

source: ClimWeb Kit
fr: Kit de montée
sw: Kitengo cha kupanda

source: Amidst escalating and urgent impacts of climate change, Africa exhibits major challenges in coping with its consequences, particularly in terms of controlling extreme weather events, and delivering accurate and timely information to the public.
fr: Au milieu des impacts croissants et urgents du changement climatique, l'Afrique présente des défis majeurs pour faire face à ses conséquences, en particulier en termes de contrôle des événements météorologiques extrêmes et de fournir des informations précises et opportunes au public.
sw: Wakati wa athari zinazoongezeka na za haraka za mabadiliko ya hali ya hewa, Afrika inaonyesha changamoto kubwa katika kukabiliana na athari zake, haswa katika suala la kudhibiti hali mbaya ya hali ya hewa, na kutoa habari sahihi na kwa wakati unaofaa kwa umma.

source: In response to these challenges, the World Meteorological Organization's (WMO) Regional Office for Africa launched a Content Management System (ClimWeb) which is a website template, specifically designed to aid the digital transformation of National Meteorological and Hydrological Services (NMHSs) in Africa
fr: En réponse à ces défis, l'Office régional de l'Afrique de l'Organisation météorologique mondiale (WMO) a lancé un système de gestion de contenu (Clipweb) qui est un modèle de site Web, spécialement conçu pour faciliter la transformation numérique des services météorologiques et hydrologiques nationaux (NMHS) en Afrique
sw: Kujibu changamoto hizi, Ofisi ya Mkoa wa Meteorological's (WMO) ya Afrika ilizindua Mfumo wa Usimamizi wa Yaliyomo (ClimWeb) ambayo ni template ya wavuti, iliyoundwa mahsusi kusaidia mabadiliko ya dijiti ya huduma za kitaifa za hali ya hewa na hydrological (NMHSS) barani Afrika

source: This innovative template, built on **free and open-source standards**, features a modern design, seamless marketing integrations, a user-friendly weather warnings publisher (in CAP Format) and advanced weather and climate data visualization tools.
fr: Ce modèle innovant, construit sur ** Normes gratuites et open source **, propose une conception moderne, des intégrations marketing sans couture, un éditeur météo des météo (au format CAP) et des outils de visualisation des données météorologiques et climatiques avancées.
sw: Kiolezo hiki cha ubunifu, kilichojengwa juu ya viwango vya bure na vya wazi vya chanzo **, vina muundo wa kisasa, ujumuishaji wa uuzaji usio na mshono, mchapishaji wa maonyo ya hali ya hewa (katika muundo wa CAP) na zana za hali ya hewa za hali ya hewa na zana za hali ya hewa.

source: The technical development of the system has been supported by experts seconded by [NORCAP](https://www.nrc.no/expert-deployment/norcap-who-we-are/) a part of the [Norwegian Refugee Council](https://www.nrc.no/), with guidance of the WMO Regional Office for Africa.
fr: Le développement technique du système a été soutenu par des experts appuyés par [Norcap] (https://www.nrc.no/expert-deployment/norcap-who-we-are/) une partie du [Norwegian Refugee Council] (https://www.nrc.no/), avec des guidages de l'Office WMO pour l'Afrique.
sw: Ukuzaji wa kiufundi wa mfumo huo umeungwa mkono na wataalam walioungwa mkono na [NorCap] (https://www.nrc.no/expert-deployment/norcap-who-we-are/) sehemu ya [Baraza la Wakimbizi la Norwe] (https://www.nrc.no/), na Guid ya Afrika.
