Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: Add News List Page
fr: Ajouter la page de la liste des nouvelles
sw: Ongeza ukurasa wa orodha ya habari

source: Provide a the page title, banner image, title, subtitle and call to action and either save draft, publish or submit to moderation depending on your previlleges.
fr: Fournissez un titre de page, une image de bannière, un titre, un sous-titre et un appel à l'action et enregistrer le projet, publier ou se soumettre à la modération en fonction de vos previlleges.
sw: Toa kichwa cha ukurasa, picha ya mabango, kichwa, subtitle na wito kwa hatua na ama uhifadhi rasimu, kuchapisha au kuwasilisha kwa wastani kulingana na previlleges yako.

source: ![Add News List Page](../../_static/images/news/news_list_page.png "Add News List Page")
fr: ! [Ajouter une page de liste de nouvelles] (../../_ statique / images / news / news_list_page.png "Ajouter une page de liste de nouvelles")
sw: ! [Ongeza ukurasa wa orodha ya habari] (../../_ tuli/picha/habari/habari_list_page.png "Ongeza ukurasa wa orodha ya habari"))

source: Step 3: Create a news page
fr: Étape 3: Créez une page d'information
sw: Hatua ya 3: Unda ukurasa wa habari

source: This will navigate to the list of pages under the home page including the news list page you just created. Hover over the the news listing page and click on 'add child page'.
fr: Cela accédera à la liste des pages sous la page d'accueil, y compris la page de la liste des nouvelles que vous venez de créer. Survolez la page de liste des nouvelles et cliquez sur «Ajouter une page enfant».
sw: Hii itaenda kwenye orodha ya kurasa zilizo chini ya ukurasa wa nyumbani pamoja na ukurasa wa orodha ya habari uliyounda tu. Hover juu ya ukurasa wa orodha ya habari na ubonyeze kwenye 'Ongeza Ukurasa wa Mtoto'.

source: ![Add news Page](../../_static/images/news/add_news.png "Add news Page")
fr: ! [Ajouter une page d'actualités] (../../_ statique / images / news / add_news.png "Ajouter une page d'information")
sw: ! [Ongeza ukurasa wa habari] (../../_ tuli/picha/habari/add_news.png "Ongeza ukurasa wa Habari")

source: Add news Page
fr: Ajouter une page d'information
sw: Ongeza ukurasa wa habari

source: ![News Page Sections](../../_static/images/news/news_sections.png "News Page Sections")
fr: ! [Sections de page d'information] (../../_ statique / images / news / news_sections.png "sections de page d'information")
sw: ! [Sehemu za ukurasa wa habari] (../../_ tuli/picha/habari/habari_sections.png "sehemu za habari")))

source: News Page Sections
fr: Sections de page d'information
sw: Sehemu za Ukurasa wa Habari

source: The sections of a service page include:
fr: Les sections d'une page de service comprennent:
sw: Sehemu za ukurasa wa huduma ni pamoja na:

source: **News Type** - selected from previously prepared news type in step 1
fr: ** Type d'actualités ** - Sélectionné dans le type d'actualités précédemment préparé à l'étape 1
sw: ** Aina ya Habari ** - Iliyochaguliwa kutoka kwa Aina ya Habari iliyotayarishwa hapo awali katika Hatua ya 1

source: **Relevant Service** - selected from previously prepared service categories. Refer to [Create Services Categories Section](./Manage-Services#step-1-create-an-agromet-service-category) to create service categories.
fr: ** Service pertinent ** - Sélectionné dans les catégories de services précédemment préparées. Reportez-vous à la section [Créer des catégories de services] (./ Manage-Services # Step-1-Create-An-Agromet-Service-Category) pour créer des catégories de services.
sw: ** Huduma husika ** - iliyochaguliwa kutoka kwa aina za huduma zilizotayarishwa hapo awali. Rejea [Unda Sehemu za Huduma] (.

source: **Relevant Projects** - select from previously prepared projects. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects.
fr: ** Projets pertinents ** - Sélectionnez parmi les projets précédemment préparés. Veuillez référer [Gérer les projets] (./ Manage-Projects) pour guider la création de projets.
sw: ** Miradi inayofaa ** - Chagua kutoka kwa miradi iliyoandaliwa hapo awali. Tafadhali rejelea [Dhibiti miradi] (.

source: **Post date** - the date the news was published
fr: ** Date de publication ** - la date de publication de la nouvelle
sw: ** Tarehe ya Posta ** - Tarehe ambayo habari ilichapishwa

source: **Subtitle** - optional subtitle
fr: ** Sous-titre ** - Sous-titre facultatif
sw: ** Subtitle ** - Subtitle ya hiari

source: **Body** - the body of the news
fr: ** corps ** - le corps des nouvelles
sw: ** Mwili ** - Mwili wa habari

source: **Tags** - tags related to the news
fr: ** Tags ** - Tags liés aux nouvelles
sw: ** vitambulisho ** - vitambulisho vinavyohusiana na habari

source: **Extra Links** - additional links
fr: ** Liens supplémentaires ** - Liens supplémentaires
sw: ** Viungo vya ziada ** - Viungo vya ziada

source: **Is featured** - If enabled, the news will appear as Featured news on the news listing page
fr: ** est présenté ** - Si c'est activé, les nouvelles apparaîtront comme des nouvelles en vedette sur la page d'inscription des nouvelles
sw: ** imeonyeshwa ** - ikiwa imewezeshwa, habari zitaonekana kama habari zilizoonyeshwa kwenye ukurasa wa orodha ya habari

source: **Is visible on homepage** - If enabled, the news will appear in the homepage as an alert/latest update
fr: ** est visible sur la page d'accueil ** - Si c'est activé, les nouvelles apparaîtront dans la page d'accueil comme une mise à jour alerte / dernière
sw: ** Inaonekana kwenye ukurasa wa nyumbani ** - ikiwa imewezeshwa, habari zitaonekana kwenye ukurasa wa nyumbani kama sasisho la tahadhari/mpya

source: To create additional news in the future you would need to begin from [Step 3: Create a news page](./Manage-news#step-3-create-a-news-page) if the desired news type is already defined.
fr: Pour créer des nouvelles supplémentaires à l'avenir, vous devrez commencer à partir de [Étape 3: Créer une page d'information] (./ Manage-News # Étape-3-Create-A-News-Page) si le type d'actualités souhaité est déjà défini.
sw: Ili kuunda habari za ziada katika siku zijazo utahitaji kuanza kutoka [Hatua ya 3: Unda ukurasa wa Habari] (.

source: Products
fr: Produits
sw: Bidhaa

source: The creation of products follows the steps below:
fr: La création de produits suit les étapes ci-dessous:
sw: Uundaji wa bidhaa hufuata hatua hapa chini:

source: Creation of a product and a service category
fr: Création d'un produit et d'une catégorie de service
sw: Uundaji wa bidhaa na kitengo cha huduma

source: Creation of one or more product categories for each of the products
fr: Création d'une ou plusieurs catégories de produits pour chacun des produits
sw: Uundaji wa aina moja au zaidi ya bidhaa kwa kila moja ya bidhaa

source: Creation of one or more product item types for each of the product categories
fr: Création d'un ou plusieurs types d'articles de produits pour chacune des catégories de produits
sw: Uundaji wa aina moja au zaidi ya bidhaa kwa kila aina ya bidhaa

source: Creation of a product page that will serve all products for a specific category
fr: Création d'une page de produit qui servira tous les produits pour une catégorie spécifique
sw: Uundaji wa ukurasa wa bidhaa ambao utatumikia bidhaa zote kwa jamii maalum

source: Creation of one or more product items for a product page
fr: Création d'un ou plusieurs articles de produit pour une page de produit
sw: Uundaji wa bidhaa moja au zaidi ya bidhaa kwa ukurasa wa bidhaa

source: Product Creation Example Scenario
fr: Exemple de création de produits Scénario
sw: Mfano wa uundaji wa bidhaa

source: Assume you would like to have Dekadal Agromet Bulletin Products on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous aimeriez avoir des produits de bulletin Agromet Dekadal sur le site Web, la façon pratique de le faire en utilisant les étapes ci-dessus serait:
sw: Fikiria ungependa kuwa na bidhaa za Bulletin ya Dekadal kwenye wavuti, njia ya kweli ya kuifanya kwa kutumia hatua hapo juu itakuwa:

source: Step 1: Create an 'Agromet Service Category' and a 'Dekadal Agromet Bulletin' Product
fr: Étape 1: Créez une «catégorie de service Agromet» et un «produit de bulletin de dekadal agromet»
sw: Hatua ya 1: Unda Jamii ya Huduma ya 'Agromet' na Bidhaa ya 'DeKadal Agromet'

source: To create a service, navigate to the 'Snippets' section on the explorer menu and select 'Servies' as below:
fr: Pour créer un service, accédez à la section «Extraits» du menu Explorer et sélectionnez «Services» comme ci-dessous:
sw: Ili kuunda huduma, nenda kwa sehemu ya 'Snippets' kwenye menyu ya Explorer na uchague 'Huduma' kama ilivyo hapo chini:

source: ![Services Explorer](../../_static/images/products/services_explorer.png "Services Explorer")
fr: ! [Services Explorer] (../../_ statique / images / produits / services_explorer.png "Services Explorer")

source: Services Explorer
fr: Explorateur de services
sw: Huduma za Explorer

source: Click on 'Add service' to create a new service.
fr: Cliquez sur «Ajouter un service» pour créer un nouveau service.
sw: Bonyeza kwenye 'Ongeza Huduma' kuunda huduma mpya.

source: ![Services Category](../../_static/images/products/add_service_category.png "Services Category")
fr: ! [Catégorie des services] (../../_ statique / images / produits / add_service_category.png "Catégorie des services")
sw: ! [Jamii ya Huduma] (../../_ tuli/picha/bidhaa/add_service_category.png "Jamii ya Huduma"))

source: Services Category
fr: Catégorie de services
sw: Jamii ya Huduma

source: Provide service category name and choose an icon and save.
fr: Fournissez le nom de la catégorie de service et choisissez une icône et enregistrez.
sw: Toa jina la kitengo cha huduma na uchague ikoni na uhifadhi.

source: ![Services Category](../../_static/images/products/service_category.png "Services Category")
fr: ! [Catégorie des services] (../../_ statique / images / produits / service_category.png "Catégorie des services")
sw: ! [Jamii ya Huduma] (../../_ tuli/picha/bidhaa/huduma_category.png "Jamii ya Huduma"))

source: To create a product, navigate to the 'Snippets' section on the explorer menu and select 'Products' as below:
fr: Pour créer un produit, accédez à la section «Extraits» du menu Explorer et sélectionnez «Produits» comme ci-dessous:
sw: Ili kuunda bidhaa, nenda kwa sehemu ya 'Snippets' kwenye menyu ya Explorer na uchague 'Bidhaa' kama ilivyo hapo chini:

source: ![Products Explorer](../../_static/images/products/products_explorer.png "Products Explorer")
fr: ! [Products Explorer] (../../_ statique / images / produits / produits_explorer.png "Products Explorer")
sw: ! [Bidhaa za Explorer] (../../_ tuli/picha/bidhaa/bidhaa_explorer.png "Bidhaa Explorer")

source: Products Explorer
fr: Explorateur de produits
sw: Bidhaa Explorer

source: Click on 'Add product' to create a new product.
fr: Cliquez sur «Ajouter un produit» pour créer un nouveau produit.
sw: Bonyeza kwenye 'Ongeza Bidhaa' kuunda bidhaa mpya.

source: ![Add Product](../../_static/images/products/add_product.png "Add Product")
fr: ! [Ajouter un produit] (../../_ statique / images / produits / add_product.png "Ajouter un produit")
sw: ! [Ongeza bidhaa] (../../_ tuli/picha/bidhaa/add_product.png "ongeza bidhaa")

source: Add Product
fr: Ajouter le produit
sw: Ongeza bidhaa

source: Fill in the form providing the name of the product e.g Dekadal Agromet Bulletin
fr: Remplissez le formulaire en fournissant le nom du produit, par exemple le bulletin Dekadal Agromet
sw: Jaza fomu inayotoa jina la bidhaa n.k Bulletin ya DeKadal Agromet

source: ![Add Product](../../_static/images/products/add_product_name.png "Add Product")
fr: ! [Ajouter un produit] (../../_ statique / images / produits / add_product_name.png "Ajouter un produit")
sw: ! [Ongeza bidhaa] (../../_ tuli/picha/bidhaa/add_product_name.png "ongeza bidhaa")

source: Step 2: Creation of one or more product categories for each of the products
fr: Étape 2: Création d'une ou plusieurs catégories de produits pour chacun des produits
sw: Hatua ya 2: Uundaji wa aina moja au zaidi ya bidhaa kwa kila moja ya bidhaa

source: Create a product category based on sections measured and reported in Dekadal Agrometeorology providing the name and icon e.g
fr: Créez une catégorie de produit basée sur les sections mesurées et rapportées dans l'agrométéorologie dékadale fournissant le nom et l'icône par ex.
sw: Unda kitengo cha bidhaa kulingana na sehemu zilizopimwa na kuripotiwa katika dekadal agrometeorology kutoa jina na ikoni n.k

source: Category 1 - Weather Assessment
fr: Catégorie 1 - Évaluation météorologique
sw: Jamii 1 - Tathmini ya hali ya hewa

source: Category 2 - Agrometeorological conditions and impact on agriculture
fr: Catégorie 2 - Conditions agrométorologiques et impact sur l'agriculture
sw: Jamii 2 - Hali ya Agrometeorological na Athari kwa Kilimo

source: Category 3 - Bulletin
fr: Catégorie 3 - Bulletin
sw: Jamii 3 - Bulletin

source: ![Add Product](../../_static/images/products/add_product_categories.png "Add Product")
fr: ! [Ajouter un produit] (../../_ statique / images / produits / add_product_categories.png "Ajouter un produit")
sw: ! [Ongeza bidhaa] (../../_ tuli/picha/bidhaa/add_product_categories.png "ongeza bidhaa")

source: Category 1 and 2 can contain text and images and allows you to break down your bulletin into sharable sections while category 3 can hold the bulletin file/document for download by users. A preview of these categories to the public would appear as below on the website.
fr: Les catégories 1 et 2 peuvent contenir du texte et des images et vous permet de décomposer votre bulletin en sections partageables tandis que la catégorie 3 peut contenir le fichier / document de bulletin pour le téléchargement par les utilisateurs. Un aperçu de ces catégories au public apparaîtrait comme ci-dessous sur le site Web.
sw: Jamii 1 na 2 zinaweza kuwa na maandishi na picha na hukuruhusu kuvunja taarifa yako katika sehemu zinazoweza kugawanyika wakati Jamii 3 inaweza kushikilia faili ya taarifa/hati ya kupakuliwa na watumiaji. Hakiki ya aina hizi kwa umma ingeonekana kama hapa chini kwenye wavuti.

source: ![Add Product](../../_static/images/products/product_preview.png "Add Product")
fr: ! [Ajouter un produit] (../../_ statique / images / produits / produit_preview.png "Ajouter un produit")
sw: ! [Ongeza bidhaa] (../../_ tuli/picha/bidhaa/bidhaa_preview.png "Ongeza bidhaa")

source: Step 3: Creation of one or more product item types for each of the product categories
fr: Étape 3: Création d'un ou plusieurs types d'éléments de produit pour chacune des catégories de produits
sw: Hatua ya 3: Uundaji wa aina moja au zaidi ya bidhaa kwa kila moja ya aina ya bidhaa

source: For each of the three categories above, you can now add product item types e.g
fr: Pour chacune des trois catégories ci-dessus, vous pouvez désormais ajouter des types d'éléments de produit, par exemple
sw: Kwa kila moja ya aina tatu hapo juu, sasa unaweza kuongeza aina ya bidhaa za bidhaa n.k

source: **Category 1** - Weather Assessment
fr: ** Catégorie 1 ** - Évaluation météorologique
sw: ** Jamii 1 ** - Tathmini ya hali ya hewa

source: |_ Rainfall Amount
fr: | _ Montant des précipitations
sw: | _ Kiwango cha mvua

source: |_ Rainfall Anomaly
fr: | _ Anomalie des précipitations
sw: | _ Mvua ya mvua

source: |_ Moisture Condition
fr: | _ Condition d'humidité
sw: | _ Hali ya unyevu

source: **Category 2** - Agrometeorological conditions and impact on agriculture
fr: ** Catégorie 2 ** - Conditions agrométorologiques et impact sur l'agriculture
sw: ** Jamii 2 ** - Hali ya Agrometeorological na Athari kwa Kilimo

source: |_ Vegetation Condition & Impact on Agriculture
fr: | _ Condition de végétation et impact sur l'agriculture
sw: | _ Hali ya mimea na athari kwenye kilimo

source: **Category 3** - Bulletin
fr: ** Catégorie 3 ** - Bulletin
sw: ** Jamii 3 ** - Bulletin

source: ![Add Product Item](../../_static/images/products/add_product_item_types.png "Add Product Item")
fr: ! [Ajouter un élément de produit] (../../_ statique / images / produits / add_product_item_types.png "Ajouter un élément de produit")
sw: ! [Ongeza bidhaa ya bidhaa] (../../_ tuli/picha/bidhaa/add_product_item_types.png "ongeza bidhaa ya bidhaa")

source: Add Product Item
fr: Ajouter un élément de produit
sw: Ongeza bidhaa ya bidhaa

source: A preview of these product item types to the public would appear as below on the website.
fr: Un aperçu de ces types d'articles de produit au public apparaîtrait comme ci-dessous sur le site Web.
sw: Hakiki ya aina hizi za bidhaa kwa umma zinaweza kuonekana kama hapa chini kwenye wavuti.

source: Step 4: Creation of a product page that will serve all products for a specific category
fr: Étape 4: Création d'une page de produit qui servira tous les produits pour une catégorie spécifique
sw: Hatua ya 4: Uundaji wa ukurasa wa bidhaa ambao utatumikia bidhaa zote kwa jamii maalum

source: Once a product, its categories and items have been defined, a product page can be created to hold all products linked to it. To create this, navigate to 'pages' in the explorer menu and click on products.
fr: Une fois un produit, ses catégories et articles ont été définis, une page de produit peut être créée pour contenir tous les produits liés à lui. Pour créer cela, accédez à des «pages» dans le menu Explorer et cliquez sur les produits.
sw: Mara tu bidhaa, vikundi vyake na vitu vimefafanuliwa, ukurasa wa bidhaa unaweza kuunda kushikilia bidhaa zote zilizounganishwa nayo. Ili kuunda hii, nenda kwa 'kurasa' kwenye menyu ya Explorer na ubonyeze bidhaa.

source: ![Add Product Page](../../_static/images/products/add_product_page.png "Add Product Page")
fr: ! [Ajouter une page de produit] (../../_ statique / images / produits / add_product_page.png "Ajouter une page de produit")
sw: ! [Ongeza ukurasa wa bidhaa] (../../_ tuli/picha/bidhaa/add_product_page.png "Ongeza ukurasa wa bidhaa")

source: Add Product Page
fr: Ajouter la page du produit
sw: Ongeza ukurasa wa bidhaa

source: Click on the three dots and select 'Add child pages'
fr: Cliquez sur les trois points et sélectionnez «Ajouter des pages enfants»
sw: Bonyeza kwenye dots tatu na uchague 'Ongeza Kurasa za Mtoto'

source: ![Add Product Child Page](../../_static/images/products/add_product_child_page.png "Add Product Child Page")
fr: ! [Ajouter une page enfant du produit] (../../_ statique / images / produits / add_product_child_page.png "Ajouter une page enfant du produit")

source: Add Product Child Page
fr: Ajouter la page de l'enfant produit
sw: Ongeza Ukurasa wa Mtoto wa Bidhaa

source: Choose the relevant service category and product as below. Fill in another necessary and optional inputs including an introduction section, introduction image and text that will appear at the top of the Dekadal Agromet Bulletin Page.
fr: Choisissez la catégorie de services et le produit pertinents comme ci-dessous. Remplissez les autres entrées nécessaires et facultatives, y compris une section d'introduction, une image d'introduction et un texte qui apparaîtront en haut de la page de bulletin Agromet Dekadal.
sw: Chagua kitengo cha huduma na bidhaa kama ilivyo hapo chini. Jaza pembejeo zingine muhimu na za hiari ikiwa ni pamoja na sehemu ya utangulizi, picha ya utangulizi na maandishi ambayo yataonekana juu ya ukurasa wa Bulletin wa DeKadal.

source: ![Add Product Child Page](../../_static/images/products/product_child_page.png "Add Product Child Page")
fr: ! [Ajouter une page enfant de produit] (../../_ statique / images / produits / produit_child_page.png "Ajouter une page enfant du produit")

source: Save draft / Publish page.
fr: Enregistrer la page Draft / Publier.
sw: Hifadhi rasimu / Ukurasa wa kuchapisha.

source: Step 5: Creation of one or more product items for a product page
fr: Étape 5: Création d'un ou plusieurs articles de produit pour une page de produit
sw: Hatua ya 5: Uundaji wa bidhaa moja au zaidi ya bidhaa kwa ukurasa wa bidhaa

source: Add a product item by hovering over Dekadal Agromet Bulletin and selecting 'add child page'.
fr: Ajoutez un élément de produit en survolant le bulletin Agromet Dekadal et en sélectionnant «Ajouter une page enfant».
sw: Ongeza bidhaa ya bidhaa kwa kusonga juu ya Bulletin ya DeKadal Agromet na uchague 'Ongeza Ukurasa wa Mtoto'.

source: ![Add Product Item](../../_static/images/products/product_item.png "Add Product Item")
fr: ! [Ajouter un élément de produit] (../../_ statique / images / produits / produit_item.png "Ajouter un élément de produit")
sw: ! [Ongeza bidhaa ya bidhaa] (../../_ tuli/picha/bidhaa/bidhaa_item.png "Ongeza bidhaa ya bidhaa")

source: For example, you can add a product item for **1 - 10 June 2023** , by specifying the date, valid until and products.
fr: Par exemple, vous pouvez ajouter un élément de produit pour ** 1 - 10 juin 2023 **, en spécifiant la date, valide jusqu'à et les produits.
sw: Kwa mfano, unaweza kuongeza bidhaa ya bidhaa kwa ** 1 - 10 Juni 2023 **, kwa kutaja tarehe, halali hadi na bidhaa.

source: ![Add Product Item Page](../../_static/images/products/product_item_page.png "Add Product Item Page")
fr: ! [Ajouter une page d'élément de produit] (../../_ statique / images / produits / product_item_page.png "Ajouter la page d'élément de produit")
sw: ! [Ongeza ukurasa wa bidhaa] (../../_ tuli/picha/bidhaa/bidhaa_item_page.png "Ongeza ukurasa wa bidhaa"))

source: Add Product Item Page
fr: Ajouter la page de l'élément de produit
sw: Ongeza ukurasa wa bidhaa

source: The 'products' input accepts two options:
fr: L'entrée «produits» accepte deux options:
sw: Uingizaji wa 'Bidhaa' unakubali chaguzi mbili:

source: Map/Image Product
fr: Produit de carte / image
sw: Ramani/bidhaa ya picha

source: Document/Bulletin Product
fr: Produit document / bulletin
sw: Hati/Bulletin Bidhaa

source: ![Add Product Options](../../_static/images/products/product_options.png "Add Product Options")
fr: ! [Ajouter des options de produit] (../../_ statique / images / produits / product_options.png "Ajouter des options de produit")
sw: ! [Ongeza chaguzi za bidhaa] (../../_ tuli/picha/bidhaa/bidhaa_options.png "Ongeza Chaguzi za Bidhaa")

source: Add Product Options
fr: Ajouter des options de produit
sw: Ongeza chaguzi za bidhaa

source: An example of a product based on Map/Image product would be the type 'Rainfall Amount'
fr: Un exemple de produit basé sur le produit MAP / Image serait le type de «montant des précipitations»
sw: Mfano wa bidhaa kulingana na ramani/bidhaa ya picha itakuwa aina ya 'mvua ya mvua'

source: ![Add Product Options](../../_static/images/products/product_options_map_image.png "Add Product Options")
fr: ! [Ajouter des options de produit] (../../_ statique / images / produits / product_options_map_image.png "Ajouter des options de produit")
sw: ! [Ongeza chaguzi za bidhaa] (../../_ tuli/picha/bidhaa/bidhaa_options_map_image.png "Ongeza Chaguzi za Bidhaa")

source: An example of a product based on Document/Bulletin product would be the type 'Document'
fr: Un exemple de produit basé sur un produit de document / bulletin serait le type «document»
sw: Mfano wa bidhaa kulingana na hati/bidhaa ya taarifa itakuwa 'hati' ya aina

source: ![Add Product Options](../../_static/images/products/product_options_document.png "Add Product Options")
fr: ! [Ajouter des options de produit] (../../_ statique / images / produits / product_options_document.png "Ajouter des options de produit")
sw: ! [Ongeza chaguzi za bidhaa] (../../_ tuli/picha/bidhaa/bidhaa_options_document.png "Ongeza Chaguzi za Bidhaa")
