Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: Clicking on a user’s name opens their profile in an edit screen. From here, you can then edit that user's details. It is also possible to change users’ passwords from their edit screen, but it is worth encouraging your users to use the Forgotten password link on the login screen instead. This should save you some time!
fr: Cliquer sur le nom d'un utilisateur ouvre son profil dans un écran d'édition. De là, vous pouvez ensuite modifier les détails de cet utilisateur. Il est également possible de modifier les mots de passe des utilisateurs à partir de leur écran d'édition, mais il vaut la peine d'encourager vos utilisateurs à utiliser le lien de mot de passe oublié sur l'écran de connexion à la place. Cela devrait vous faire gagner du temps!
sw: Kubonyeza jina la mtumiaji kunafungua wasifu wao kwenye skrini ya hariri. Kuanzia hapa, unaweza kuhariri maelezo ya mtumiaji huyo. Inawezekana pia kubadilisha nywila za watumiaji kutoka kwa skrini yao ya hariri, lakini inafaa kuhamasisha watumiaji wako kutumia kiunga cha nenosiri lililosahaulika kwenye skrini ya kuingia badala yake. Hii inapaswa kukuokoa muda!

source: Managing Roles
fr: Gérer les rôles
sw: Kusimamia majukumu

source: To manage (add, edit, delete) roles, select from settings, groups as below. Each group corresponds to a role with permissions.
fr: Pour gérer (ajouter, modifier, supprimer) les rôles, sélectionnez parmi les paramètres, groupes comme ci-dessous. Chaque groupe correspond à un rôle avec les autorisations.
sw: Ili kusimamia (kuongeza, kuhariri, kufuta) majukumu, chagua kutoka kwa mipangilio, vikundi kama ilivyo hapo chini. Kila kikundi kinalingana na jukumu na ruhusa.

source: ![Manage Roles](../../_static/images/users_and_roles/manage_roles.png "Manage Roles")
fr: ! [Gérer les rôles] (../../_ static / images / users_and_roles / manage_roles.png "Gérer les rôles")
sw: ! [Simamia majukumu] (../../_ tuli/picha/watumiaji_and_roles/usimamizi_roles.png "Dhibiti majukumu"))

source: Manage Roles
fr: Gérer les rôles
sw: Simamia majukumu

source: ![List Roles](../../_static/images/users_and_roles/list_roles.png "List Roles")
fr: ! [Lister les rôles] (../../_ static / images / users_and_roles / list_roles.png "lister les rôles")
sw: ! [Majukumu ya orodha] (../../_ tuli/picha/watumiaji_and_roles/orodha_roles.png "majukumu ya orodha"))

source: List Roles
fr: Rôles de liste
sw: Orodha ya majukumu

source: To edit a role and assign different permissions, click on the group. This will navigate to a seperate page where you can manage the permissions of the role.
fr: Pour modifier un rôle et attribuer différentes autorisations, cliquez sur le groupe. Cela se poursuivra vers une page séparée où vous pouvez gérer les autorisations du rôle.
sw: Ili kuhariri jukumu na kupeana ruhusa tofauti, bonyeza kwenye kikundi. Hii itaenda kwenye ukurasa wa seperate ambapo unaweza kusimamia ruhusa za jukumu hilo.

source: ![Edit Roles](../../_static/images/users_and_roles/edit_role.png "Edit Roles")
fr: ! [Modifier les rôles] (../../_ statique / images / utilisateurs_and_roles / edit_role.png "édition rôles")
sw: ! [Hariri majukumu] (../../_ tuli/picha/watumiaji_and_roles/edit_role.png "hariri majukumu"))

source: Edit Roles
fr: Modifier les rôles
sw: Hariri majukumu

source: Configure Settings
fr: Configurer les paramètres
sw: Sanidi mipangilio

source: Introduction
sw: Utangulizi

source: **Cap Alerts Publishing**
sw: ** Arifa za Cap Uchapishaji **

source: Usage
sw: Matumizi

source: ![Mautic Page](../_static/images/mautic/mautic_page.png "Mautic Page")
sw: ! [Ukurasa wa Mautic] (../_ tuli/picha/Mautic/Mautic_page.png "Ukurasa wa Mautic")

source: Mozambique
sw: Msumbiji

source: Email Marketing
sw: Uuzaji wa barua pepe

source: Clickjacking protection
sw: Ulinzi wa kubonyeza

source: **_NOTE:_**
sw: ** _ kumbuka: _ **

source: Restriction (restriction),
sw: Kizuizi (kizuizi),

source: Instructions (instruction)
sw: Maagizo (maagizo)

source: Altitude (altitude),
sw: Urefu (urefu),

source: Incidents
sw: Matukio

source: OCHA Administrative Boundary common Operational Datasets (COD-ABS) (*default*) https://data.humdata.org/
sw: Takwimu za kawaida za Utendaji wa OCHA (COD-ABS) (*chaguo-msingi*) https://data.humdata.org/

source: Collections
sw: Makusanyo

source: Collections Explorer
sw: Mkusanyiko Explorer

source: Documents
sw: Hati

source: Images
sw: Picha

source: ![Edit Images](../../_static/images/icons_and_images/edit_image.png "Edit Images")
sw: ! [Hariri picha] (../../_ tuli/picha/icons_and_images/edit_image.png "hariri picha")

source: Illustration
sw: Mfano

source: <div style="width:590px">Image</div>
sw: <div style = "upana: 590px"> picha </div>

source: **Image**
sw: ** picha **

source: **Expression**
sw: ** kujieleza **

source: Expression
sw: Kuonyesha

source: |_ Document
sw: | _ Hati

source: Publications
sw: Machapisho

source: Services
sw: Huduma

source: Pages
sw: Kurasa

source: Alias pages
sw: Kurasa za Alias

source: ![Worklow explorer](../../_static/images/workflows/workflow_explorer.png "Worklow explorer")
sw: ! [Worklow Explorer] (../../_ tuli/picha/kazi/kazi/kazi ya kazi

source: Google Authenticator (Android/iOS)
sw: Kithibitishaji cha Google (Android/iOS)

source: Microsoft Authenticator (Android/iOS)
sw: Mthibitishaji wa Microsoft (Android/iOS)

source: Menus
sw: Menyu

source: Top Navbar
sw: Navbar ya juu
