Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: Linking Your Authenticator App
fr: Lier votre application Authenticatrice
sw: Kuunganisha Programu yako ya Uthibitishaji

source: Open your preferred authenticator app.
fr: Ouvrez votre application Authenticatrice préférée.
sw: Fungua programu yako ya kithibitishaji unayopendelea.

source: Select the option to **Add a new account**.
fr: Sélectionnez l'option pour ** ajouter un nouveau compte **.
sw: Chagua chaguo la ** Ongeza akaunti mpya **.

source: Scan the QR code displayed on your Wagtail admin screen upon login.
fr: Scannez le code QR affiché sur votre écran d'administration en bergeron lors de la connexion.
sw: Scan nambari ya QR iliyoonyeshwa kwenye skrini yako ya admin ya Wagtail wakati wa kuingia.

source: If you cannot scan the QR code, manually enter the provided setup key.
fr: Si vous ne pouvez pas numériser le code QR, entrez manuellement la touche de configuration fournie.
sw: Ikiwa huwezi kuchambua nambari ya QR, ingiza kitufe cha usanidi kilichotolewa.

source: Your authenticator app will generate a six-digit code.
fr: Votre application Authenticator générera un code à six chiffres.
sw: Programu yako ya Uthibitishaji itatoa nambari ya nambari sita.

source: Step 3: Verify and Complete Setup
fr: Étape 3: Vérifiez et complétez la configuration
sw: Hatua ya 3: Thibitisha na usanidi kamili

source: Enter the six-digit code from your authenticator app into the **Verification Code** field on Wagtail.
fr: Entrez le code à six chiffres de votre application Authenticator dans le champ ** Code de vérification ** sur des bergeronnettes.
sw: Ingiza nambari ya nambari sita kutoka kwa programu yako ya kithibitishaji kwenye nambari ya uthibitisho wa ** ** uwanja kwenye Wagtail.

source: Optionally change the device name "Device #1"
fr: Modifier le nom de l'appareil "Device # 1"
sw: Badilisha jina la kifaa "Kifaa #1"

source: Enter your current password
fr: Entrez votre mot de passe actuel
sw: Ingiza nywila yako ya sasa

source: Click **Create** and your device should be added to the list.
fr: Cliquez sur ** Créer ** et votre appareil doit être ajouté à la liste.
sw: Bonyeza ** Unda ** na kifaa chako kinapaswa kuongezwa kwenye orodha.

source: ![2FA](../../_static/images/settings/2fa_success.png "2FA")
fr: ! [2fa] (../../_ statique / images / paramètres / 2fa_success.png "2fa")

source: Logging in with 2FA
fr: Connexion avec 2FA
sw: Kuingia na 2FA

source: Next time you log in, enter your username and password as usual.
fr: La prochaine fois que vous vous connectez, entrez votre nom d'utilisateur et votre mot de passe comme d'habitude.
sw: Wakati mwingine unapoingia, ingiza jina lako la mtumiaji na nywila kama kawaida.

source: After entering your password, Wagtail will prompt you for a **two-factor authentication code**.
fr: Après avoir saisi votre mot de passe, Worktail vous invitera à un ** code d'authentification à deux facteurs **.
sw: Baada ya kuingiza nywila yako, Wagtail itakuhimiza kwa nambari ya uthibitisho wa sababu mbili **.

source: Open your authenticator app, retrieve the latest code, and enter it in the provided field.
fr: Ouvrez votre application Authenticator, récupérez le dernier code et entrez-le dans le champ fourni.
sw: Fungua programu yako ya Uthibitishaji, pata nambari ya hivi karibuni, na uiingie kwenye uwanja uliotolewa.

source: Click **Verify** to complete the login process.
fr: Cliquez sur ** Vérifier ** pour terminer le processus de connexion.
sw: Bonyeza ** Thibitisha ** kukamilisha mchakato wa kuingia.

source: By enabling 2FA, you add an extra layer of security to your Wagtail admin account, protecting your data from unauthorized access.
fr: En permettant à 2FA, vous ajoutez une couche supplémentaire de sécurité à votre compte d'administration à bergeron, protégeant vos données contre l'accès non autorisé.
sw: Kwa kuwezesha 2FA, unaongeza safu ya ziada ya usalama kwenye akaunti yako ya usimamizi wa Wagtail, kulinda data yako kutokana na ufikiaji usioidhinishwa.

source: Managing Top Navigation
fr: Gérer la meilleure navigation
sw: Kusimamia urambazaji wa juu

source: ![Top Navbar](../../_static/images/menus/top_nav_preview.png "Top Navbar")
fr: ! [Top Navbar] (../../_ statique / images / menus / top_nav_preview.png "Top Navbar")
sw: ! [Juu navbar] (../../_ tuli/picha/menus/top_nav_preview.png "juu navbar")

source: The menu items of the top navigation of the website can be added/edited or removed. to access the menu configurations in the ClimWeb, click on the settings and main menu on the left sidebar.
fr: Les éléments de menu de la navigation supérieure du site Web peuvent être ajoutés / modifiés ou supprimés. Pour accéder aux configurations du menu dans le climail, cliquez sur les paramètres et le menu principal de la barre latérale gauche.
sw: Vitu vya menyu ya urambazaji wa juu wa wavuti vinaweza kuongezwa/kuhaririwa au kuondolewa. Ili kufikia usanidi wa menyu kwenye ClipWeb, bonyeza kwenye mipangilio na menyu kuu kwenye kando ya kushoto.

source: ![Top Navbar](../../_static/images/menus/top_nav_explorer.png "Top Navbar")
fr: ! [Top Navbar] (../../_ statique / images / menus / top_nav_explorer.png "Top Navbar")
sw: ! [Juu navbar] (../../_ tuli/picha/menus/top_nav_explorer.png "juu navbar")

source: Depending on whether a child page allows for sub menu items or not the navbar dropdown will be displayed. Each menu item takes in a:
fr: Selon une page d'enfant, une page d'enfant permet des éléments de sous-menu ou non, la liste déroulante NAVBAR sera affichée. Chaque élément de menu prend un:
sw: Kulingana na ikiwa ukurasa wa mtoto huruhusu vitu vya menyu ndogo au sio kushuka kwa Navbar kutaonyeshwa. Kila kitu cha menyu kinachukua:

source: link to an internal page / link to a custom URL
fr: lien vers une page / lien interne vers une URL personnalisée
sw: Unganisha na ukurasa wa ndani / kiunga na URL ya kawaida

source: Option to append a value to the url
fr: Option pour ajouter une valeur à l'URL
sw: Chaguo la kuongeza thamani kwa URL

source: The link display text
fr: Le texte d'affichage du lien
sw: Maandishi ya kuonyesha kiunga

source: Handle (Use this field to optionally specify an additional value for each menu item, which you can then reference in custom menu templates.)
fr: Gandage (utilisez ce champ pour spécifier éventuellement une valeur supplémentaire pour chaque élément de menu, que vous pouvez ensuite référencer dans les modèles de menu personnalisés.)
sw: Shughulikia (Tumia uwanja huu kwa hiari kutaja thamani ya ziada kwa kila kitu cha menyu, ambacho unaweza kisha kurejelea kwenye templeti za menyu ya kawaida.)

source: Submenu visibility option
fr: Option de visibilité sous-menu
sw: Chaguo la mwonekano wa submenu

source: ![Manage Menu Items](../../_static/images/menus/manage_menu_items.png "Manage Menu Items")
fr: ! [Gérer les éléments de menu] (../../_ statique / images / menus / manage_menu_items.png "Gérer les éléments de menu")

source: Manage Menu Items
fr: Gérer les éléments de menu
sw: Dhibiti vitu vya menyu

source: Managing Footer Navigation
fr: Gestion de la navigation de pied
sw: Kusimamia urambazaji wa miguu

source: ![Footer](../../_static/images/menus/footer_preview.png "Footer")
fr: ! [Footer] (../../_ statique / images / menus / pied_preview.png "pied de page")

source: Footer
fr: Pied de page

source: Similarly, to configure the footer, select settings on the left sidebar and select flat menus instead.
fr: De même, pour configurer le pied de page, sélectionnez les paramètres dans la barre latérale gauche et sélectionnez les menus plats à la place.
sw: Vivyo hivyo, kusanidi footer, chagua mipangilio kwenye upande wa kushoto na uchague menyu ya gorofa badala yake.

source: ![Footer](../../_static/images/menus/footer_explorer.png "Footer")
fr: ! [Footer] (../../_ statique / images / menus / pied_explorer.png "pied")

source: Edit footer menu and add menu items. You can group pages by giving them the same handler name. For example, weekly forecast and monthly forecasts can be grouped in 'Products' handler.
fr: Modifiez le menu du pied de page et ajoutez des éléments de menu. Vous pouvez regrouper les pages en leur donnant le même nom de gestionnaire. Par exemple, les prévisions hebdomadaires et les prévisions mensuelles peuvent être regroupées dans le gestionnaire de «produits».
sw: Hariri menyu ya Footer na ongeza vitu vya menyu. Unaweza kurasa za kikundi kwa kuwapa jina moja la mtoaji. Kwa mfano, utabiri wa kila wiki na utabiri wa kila mwezi unaweza kuwekwa katika 'bidhaa' za bidhaa.

source: ![Edit Footer](../../_static/images/menus/edit_footer.png "Edit Footer")
fr: ! [Modifier le pied de page] (../../_ statique / images / menus / edit_footer.png "edit footer")
sw: ! [Hariri footer] (../../_ tuli/picha/menus/edit_footer.png "hariri footer")

source: Edit Footer
fr: Modifier le pied de page
sw: Hariri Footer

source: Base Settings
fr: Paramètres de base
sw: Mipangilio ya msingi

source: All settings can be found at the settings menu on the left side-bar. *Scroll down if settings menu is not visible*.
fr: Tous les paramètres peuvent être trouvés dans le menu Paramètres de la barre latérale gauche. * Faites défiler vers le bas si le menu Paramètres n'est pas visible *.
sw: Mipangilio yote inaweza kupatikana kwenye menyu ya Mipangilio kwenye bar ya upande wa kushoto. *Tembeza chini ikiwa menyu ya Mipangilio haionekani*.

source: ![Settings explorer](../../_static/images/settings/settings_explorer.png "Settings explorer")
fr: ! [Paramètres Explorer] (../../_ static / images / paramètres / settings_explorer.png "Paramètres Explorer")
sw: ! [Mipangilio ya Explorer] (../../_ tuli/picha/mipangilio/mipangilio_explorer.png "Mipangilio ya Explorer"))

source: Settings explorer
fr: Explorateur de paramètres
sw: Mipangilio Explorer

source: This section covers:
fr: Cette section couvre:
sw: Sehemu hii inashughulikia:

source: Managing Organisation Settings
fr: Gestion des paramètres de l'organisation
sw: Kusimamia mipangilio ya shirika

source: Managing Themes
fr: Gestion des thèmes
sw: Kusimamia mada

source: Managing Integrations
fr: Gérer les intégrations
sw: Kusimamia Ujumuishaji

source: Managing Languages
fr: Gérer les langues
sw: Kusimamia lugha

source: Managing Measurement Units
fr: Gestion des unités de mesure
sw: Kusimamia vitengo vya kipimo

source: Organisation settings include the logo, country, address, contact information and social media address (Twitter, Facebook, Youtube and Instagram)
fr: Les paramètres de l'organisation incluent le logo, le pays, l'adresse, les coordonnées et l'adresse des médias sociaux (Twitter, Facebook, YouTube et Instagram)
sw: Mipangilio ya shirika ni pamoja na nembo, nchi, anwani, habari ya mawasiliano na anwani ya media ya kijamii (Twitter, Facebook, YouTube na Instagram)

source: ![Organisation settings](../../_static/images/settings/settings_explorer.png "Organisation settings")
fr: ! [Paramètres d'organisation] (../../_ statique / images / paramètres / paramètres_explorer.png "Paramètres d'organisation")
sw: ! [Mipangilio ya shirika] (../../_ tuli/picha/mipangilio/mipangilio_explorer.png "Mipangilio ya Shirika"))

source: Organisation settings
fr: Paramètres d'organisation
sw: Mipangilio ya shirika

source: The ClimWeb allows you to create/edit/delete a theme. You can also set a default theme which will be applied to all pages of the website.
fr: Le Clipweb vous permet de créer / modifier / supprimer un thème. Vous pouvez également définir un thème par défaut qui sera appliqué à toutes les pages du site Web.
sw: Clipweb hukuruhusu kuunda/kuhariri/kufuta mada. Unaweza pia kuweka mandhari ya msingi ambayo itatumika kwa kurasa zote za wavuti.

source: ![Themes](../../_static/images/settings/themes.png "Themes")
fr: ! [Thèmes] (../../_ statique / images / paramètres / thèmes.png "thèmes")
sw: ! [Mada] (../../_ tuli/picha/mipangilio/mada.png "Mada"))

source: Themes
fr: Thèmes
sw: Mada

source: The theme configurations include theme name, theme colors, borders and shadows.
fr: Les configurations de thème incluent le nom du thème, les couleurs du thème, les bordures et les ombres.
sw: Usanidi wa mandhari ni pamoja na jina la mandhari, rangi za mandhari, mipaka na vivuli.

source: ![Theme Detail](../../_static/images/settings/theme_detail.png "Theme Detail")
fr: ! [Détail du thème] (../../_ statique / images / paramètres / thème_detail.png "Détail du thème")
sw: ! [Maelezo ya mandhari] (../../_ tuli/picha/mipangilio/theme_detail.png "maelezo ya mandhari")

source: Theme Detail
fr: Détail du thème
sw: Maelezo ya mada

source: The ClimWeb supports integrations with 3rd party softwares including Recaptcha, YouTube API, Mailchimp, Mautic, Zoom and Google analytics.
fr: Le Clipweb prend en charge les intégrations avec des logiciels tiers, notamment RecaptCha, YouTube API, MailChimp, Mautic, Zoom et Google Analytics.
sw: ClimWeb inasaidia kuunganishwa na laini za chama cha tatu pamoja na ReCaptcha, API ya YouTube, MailChimp, Mautic, Zoom na Google Analytics.

source: ![Integrations](../../_static/images/settings/integrations.png "Integrations")
fr: ! [Intégrations] (../../_ statique / images / paramètres / intégrations.png "intégrations")
sw: ! [Ujumuishaji] (../../_ tuli/picha/mipangilio/miingiliano.png "Ujumuishaji"))

source: Integrations
fr: Intégrations
sw: Ujumuishaji

source: Managing Website Languages
fr: Gestion des langues du site Web
sw: Kusimamia lugha za wavuti

source: Multiple languages can be configured inorder to allow translation of the website by users to their prefered language. A language prefix and name is required and default state to specify the primary language the website is published in.
fr: Plusieurs langues peuvent être configurées dans l'ordre pour permettre la traduction du site Web par les utilisateurs vers leur langue préférée. Un préfixe et un nom de langue sont requis et l'état par défaut pour spécifier la langue principale dans laquelle le site Web est publié.
sw: Lugha nyingi zinaweza kusanidiwa ili kuruhusu tafsiri ya Wavuti na watumiaji kwa lugha yao inayopendelea. Kiambishi awali cha lugha na jina linahitajika na hali ya msingi kutaja lugha ya msingi ambayo wavuti imechapishwa katika.

source: ![Languages](../../_static/images/settings/manage_languages_explorer.png "Languages")
fr: ! [Langues] (../../_ statique / images / paramètres / manage_languages_explorer.png "langues")
sw: ! [Lugha] (../../_ tuli/picha/mipangilio/usimamizi_languages_explorer.png "lugha"))

source: ![Languages](../../_static/images/settings/manage_languages.png "Languages")
fr: ! [Langues] (../../_ statique / images / paramètres / manage_languages.png "langues")
sw: ! [Lugha] (../../_ tuli/picha/mipangilio/usimamizi_languages.png "lugha"))

source: Managing ClimWeb Languages
fr: Gérer les langues d'escalade
sw: Kusimamia lugha za kupanda

source: To change the language of the ClimWeb UI, this setting can be configured from the user account settings.
fr: Pour modifier la langue de l'interface utilisateur de l'ascension, ce paramètre peut être configuré à partir des paramètres du compte utilisateur.
sw: Ili kubadilisha lugha ya UI ya Clipweb, mpangilio huu unaweza kusanidiwa kutoka kwa mipangilio ya akaunti ya mtumiaji.

source: ![Languages](../../_static/images/settings/user_settings.png "Languages")
fr: ! [Langues] (../../_ statique / images / paramètres / user_settings.png "langues")
sw: ! [Lugha] (../../_ tuli/picha/mipangilio/mtumiaji_settings.png "lugha"))

source: ![Languages](../../_static/images/settings/cms_language.png "Languages")
fr: ! [Langues] (../../_ statique / images / paramètres / cms_language.png "langues")
sw: ! [Lugha] (../../_ tuli/picha/mipangilio/cms_language.png "lugha"))

source: Users & Roles
fr: Utilisateurs et rôles
sw: Watumiaji na majukumu

source: Manage Users
fr: Gérer les utilisateurs
sw: Simamia watumiaji

source: The ClimWeb allows several users to manage content in the admin interface. These users have roles, which determine the access rights they can exercise.
fr: Le Climweb permet à plusieurs utilisateurs de gérer le contenu de l'interface d'administration. Ces utilisateurs ont des rôles, qui déterminent les droits d'accès qu'ils peuvent exercer.
sw: ClimWeb inaruhusu watumiaji kadhaa kusimamia yaliyomo kwenye interface ya admin. Watumiaji hawa wana majukumu, ambayo huamua haki za ufikiaji ambazo wanaweza kutumia.

source: By default, there are 5 roles:
fr: Par défaut, il y a 5 rôles:
sw: Kwa msingi, kuna majukumu 5:

source: **Administrator** - This role has complete control over the ClimWeb and can perform tasks such as managing user accounts, creating and deleting pages, and modifying site settings.
fr: ** Administrateur ** - Ce rôle a un contrôle complet sur l'escalade et peut effectuer des tâches telles que la gestion des comptes d'utilisateurs, la création et la suppression des pages et la modification des paramètres du site.
sw: ** Msimamizi ** - Jukumu hili lina udhibiti kamili juu ya ClimWeb na inaweza kufanya kazi kama vile kusimamia akaunti za watumiaji, kuunda na kufuta kurasa, na kurekebisha mipangilio ya tovuti.

source: **Moderator** - A moderator has the next level of access after an administrator. A moderator has access to creating drafts and publishing them.
fr: ** Modérateur ** - Un modérateur a le niveau d'accès suivant après un administrateur. Un modérateur a accès à la création de brouillons et à les publier.
sw: ** Moderator ** - Msimamizi ana kiwango kinachofuata cha ufikiaji baada ya msimamizi. Moderator ana ufikiaji wa kuunda rasimu na kuzichapisha.

source: **Editor** - This role has the ability to create and edit content on the website. They can add and remove pages, modify existing content, and publish new content.
fr: ** Éditeur ** - Ce rôle a la capacité de créer et de modifier du contenu sur le site Web. Ils peuvent ajouter et supprimer des pages, modifier le contenu existant et publier de nouveaux contenus.
sw: ** Mhariri ** - Jukumu hili lina uwezo wa kuunda na kuhariri yaliyomo kwenye wavuti. Wanaweza kuongeza na kuondoa kurasa, kurekebisha yaliyomo, na kuchapisha yaliyomo mpya.

source: **Forecaster** - This role provides accurate and timely weather forecasts for the region or area that the website serves.
fr: ** Prévisionniste ** - Ce rôle fournit des prévisions météorologiques précises et opportunes pour la région ou la région que le site Web dessert.
sw: ** Forecaster ** - Jukumu hili hutoa utabiri sahihi wa hali ya hewa na kwa wakati unaofaa kwa mkoa au eneo ambalo wavuti hutumikia.

source: **CAP Composer** - role are authorized to view and create draft CAP alerts, but not to approve nor to publish final CAP alerts;
fr: ** CAP Composer ** - Le rôle est autorisé à afficher et à créer des alertes de CAP prodigieuses, mais pas à approuver ni à publier des alertes de CAP finales;
sw: ** CAP Composer ** - Jukumu limeruhusiwa kutazama na kuunda arifu za rasimu, lakini sio kupitisha au kuchapisha arifu za mwisho za cap;

source: **CAP Approver** - role are authorized to view and create draft CAP alerts, and approve and publish CAP final alerts
fr: ** APPRUBRATION DE CAP ** - Le rôle est autorisé à afficher et à créer des alertes de capuchon sur les alertes finales et à approuver et à publier et à publier des alertes finales

source: Administrator
fr: Administrateur
sw: Msimamizi

source: An administrator has the highest level of access to the admin interface, and are able to perform all actions in the Admin interface. A common task of an administrator is to add, modify, or remove user profiles. As an administrator, you can add, modify, and remove users via the Users interface. To access the Users interface, go to Settings > Users from the Wagtail Sidebar.
fr: Un administrateur a le plus haut niveau d'accès à l'interface d'administration et est en mesure d'effectuer toutes les actions dans l'interface d'administration. Une tâche courante d'un administrateur consiste à ajouter, modifier ou supprimer les profils utilisateur. En tant qu'administrateur, vous pouvez ajouter, modifier et supprimer les utilisateurs via l'interface des utilisateurs. Pour accéder à l'interface des utilisateurs, accédez à Paramètres> Les utilisateurs de la barre latérale en bergerons.
sw: Msimamizi ana kiwango cha juu cha upatikanaji wa kigeuzi cha admin, na ana uwezo wa kufanya vitendo vyote kwenye kigeuzi cha admin. Kazi ya kawaida ya msimamizi ni kuongeza, kurekebisha, au kuondoa maelezo mafupi ya watumiaji. Kama msimamizi, unaweza kuongeza, kurekebisha, na kuondoa watumiaji kupitia interface ya watumiaji. Ili kufikia interface ya watumiaji, nenda kwa Mipangilio> Watumiaji kutoka kwa kando ya Wagtail.

source: In the Users interface, you can see all of your users, their usernames, roles, and status. The status of a user can either be active or inactive. You can sort this listing either by Name or Username.
fr: Dans l'interface des utilisateurs, vous pouvez voir tous vos utilisateurs, leurs noms d'utilisateur, leurs rôles et leur statut. L'état d'un utilisateur peut être actif ou inactif. Vous pouvez trier cette liste par nom ou nom d'utilisateur.
sw: Kwenye interface ya Watumiaji, unaweza kuona watumiaji wako wote, majina yao ya watumiaji, majukumu, na hali. Hali ya mtumiaji inaweza kuwa hai au haifanyi kazi. Unaweza kupanga orodha hii kwa jina au jina la mtumiaji.

source: ![Manage Users](../../_static/images/users_and_roles/manage_users.png "Manage Users")
fr: ! [Gérer les utilisateurs] (../../_ static / images / users_and_roles / manage_users.png "Gérer les utilisateurs")
sw: ! [Dhibiti watumiaji] (../../_ tuli/picha/watumiaji_and_roles/usimamizi_users.png "Dhibiti watumiaji")

source: You can add a new user, using the 'add a user' button at the top right and assign them an email, username, first name, last name, password and role. Once the ClimWeb user logs in to their account they will be able to edit this information to their preference.
fr: Vous pouvez ajouter un nouvel utilisateur, en utilisant le bouton "Ajouter un utilisateur" en haut à droite et lui attribuer un e-mail, un nom d'utilisateur, un prénom, un nom de famille, un mot de passe et un rôle. Une fois que l'utilisateur de l'ascension se connecte à son compte, il pourra modifier ces informations à leur préférence.
sw: Unaweza kuongeza mtumiaji mpya, ukitumia kitufe cha 'Ongeza Mtumiaji' kulia juu na uwape barua pepe, jina la mtumiaji, jina la kwanza, jina la mwisho, nywila na jukumu. Mara tu watumiaji wa ClipWeb wataingia kwenye akaunti yao wataweza kuhariri habari hii kwa upendeleo wao.

source: ![Add Users](../../_static/images/users_and_roles/add_user.png "Add Users")
fr: ! [Ajouter des utilisateurs] (../../_ static / images / users_and_roles / add_user.png "Ajouter des utilisateurs")
sw: ! [Ongeza watumiaji] (../../_ tuli/picha/watumiaji_and_roles/add_user.png "Ongeza Watumiaji")

source: Add Users
fr: Ajouter les utilisateurs
sw: Ongeza watumiaji

source: Select multiple users by checking the checkbox to the left of each user row, then use the bulk action bar at the bottom to perform an action on all selected users.
fr: Sélectionnez plusieurs utilisateurs en vérifiant la case à gauche de chaque ligne utilisateur, puis utilisez la barre d'action en vrac en bas pour effectuer une action sur tous les utilisateurs sélectionnés.
sw: Chagua watumiaji wengi kwa kuangalia kisanduku cha kushoto kwa kila safu ya mtumiaji, kisha utumie bar ya hatua ya wingi chini kufanya hatua kwa watumiaji wote waliochaguliwa.

source: ![Select Users](../../_static/images/users_and_roles/select_users.png "Select Users")
fr: ! [Sélectionnez des utilisateurs] (../../_ static / images / users_and_roles / select_users.png "Select utilisateurs")
sw: ! [Chagua Watumiaji] (../../_ tuli/picha/watumiaji_and_roles/select_users.png "Chagua Watumiaji")

source: Select Users
fr: Sélectionner les utilisateurs
sw: Chagua Watumiaji
