Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: Settings
fr: Paramètres
sw: Mipangilio

source: `NOTE`: This instructions assume you have knowledge of setting up Wagtail and configuring Mautic, as we don't cover the specifics.
fr: «Remarque»: ces instructions supposent que vous avez une connaissance de la configuration de la queue de chandelle et de la configuration de Mautic, car nous ne couvrons pas les détails.
sw: `Kumbuka`: Maagizo haya yanadhani una ufahamu wa kusanidi wagtail na kusanidi Mautic, kwani hatujashughulikia maelezo.

source: Mautic Settings will be added to the Wagtail Admin Menu as below
fr: Les paramètres Mautic seront ajoutés au menu d'administration en bergeron comme ci-dessous
sw: Mipangilio ya Mautic itaongezwa kwenye menyu ya Usimamizi wa Wagtail kama ilivyo hapo chini

source: ![Navigation in Wagtail admin](../_static/images/mautic/locate_mautic_settings.png "Navigation in Wagtail admin")
fr: ! [Navigation dans l'administrateur en berce-berger] (../_ statique / images / Mautic / Locate_Moutic_Settings.png "Navigation in Worktail Admin")

source: Navigation in Wagtail admin
fr: Navigation dans l'administrateur des bergeronnets
sw: Urambazaji katika Usimamizi wa Wagtail

source: Add in the URL for your Mautic instance (including the https://) to the Mautic Url field.
fr: Ajoutez l'URL pour votre instance Mautic (y compris le https: //) sur le champ URL Mautique.
sw: Ongeza kwenye URL kwa mfano wako wa Mautic (pamoja na https: //) kwenye uwanja wa URL wa Mautic.

source: Set Mautic Base Url
fr: Définir l'URL de base Mautic
sw: Weka URL ya msingi wa Mautic

source: You can use two methods for authentication:
fr: Vous pouvez utiliser deux méthodes pour l'authentification:
sw: Unaweza kutumia njia mbili za uthibitishaji:

source: OAuth2 that requires client id and client secret from Mautic
fr: OAuth2 qui nécessite un identifiant client et un secret client de Mautic
sw: OAuth2 ambayo inahitaji kitambulisho cha mteja na siri ya mteja kutoka Mautic

source: Basic Authentication that needs username and password. To use Basic Auth, you must enable this on Mautic Configuration
fr: Authentification de base qui nécessite un nom d'utilisateur et un mot de passe. Pour utiliser Basic Auth, vous devez l'activer sur la configuration Mautic
sw: Uthibitishaji wa kimsingi ambao unahitaji jina la mtumiaji na nywila. Ili kutumia mwandishi wa msingi, lazima uwezeshe hii kwenye usanidi wa Mautic

source: OAth2
fr: Serment
sw: Kiapo2

source: ![OAuth2](../_static/images/mautic/oauth.png "OAuth2")
fr: ! [OAuth2] (../_ statique / images / Mautic / oauth.png "oauth2")

source: Basic
fr: Basique
sw: Msingi

source: To create a subscription page based on mautic integration, navigate to `Pages` on the left side panel, select Pages and click on add a child page to the home page by hovering over the homepage.
fr: Pour créer une page d'abonnement basée sur l'intégration Mautic, accédez à des «pages» sur le panneau de gauche, sélectionnez les pages et cliquez sur Ajouter une page d'enfant à la page d'accueil en passant par la page d'accueil.
sw: Ili kuunda ukurasa wa usajili kulingana na ujumuishaji wa Mautic, nenda kwa `kurasa` kwenye paneli ya upande wa kushoto, chagua kurasa na ubonyeze Ongeza ukurasa wa Mtoto kwenye ukurasa wa nyumbani kwa kusonga juu ya ukurasa wa nyumbani.

source: ![Add child Page](../_static/images/mautic/mautic_navigate.png "Add child Page")
fr: ! [Ajouter une page enfant] (../_ statique / images / Mautic / Mautic_navigate.png "Ajouter une page enfant")

source: Add child Page
fr: Ajouter une page d'enfant
sw: Ongeza ukurasa wa mtoto

source: ![Add child Page](../_static/images/mautic/add_child_page.png "Add child Page")
fr: ! [Ajouter une page d'enfant] (../_ statique / images / Mautic / add_child_page.png "Ajouter une page enfant")

source: Select `Mautic mailing list subsrciption page` from the list. Note that, if this page was already created then this option will not appear as only one instance of this page is allowed.
fr: Sélectionnez `Mautic Mailing List Subsrciption Page 'dans la liste. Notez que si cette page a déjà été créée, cette option n'apparaîtra pas car une seule instance de cette page est autorisée.
sw: Chagua `Ukurasa wa Matumizi ya Mautic Ukurasa wa chini wa orodha. Kumbuka kuwa, ikiwa ukurasa huu ulikuwa tayari umeundwa basi chaguo hili halitaonekana kama mfano mmoja tu wa ukurasa huu unaruhusiwa.

source: ![Add mautic Page](../_static/images/mautic/add_mautic_page.png "Add mautic Page")
fr: ! [Ajouter une page Mautic] (../_ statique / images / Mautic / add_moutic_page.png "Ajouter la page Mautic")

source: Add mautic Page
fr: Ajouter la page Mautic
sw: Ongeza ukurasa wa Mautic

source: Fill in the form with necessary input. Example below. The Mautic form ID is retrieved from the subscription form created on Mautic's software. Refer to [Mautic User Guide](https://docs.mautic.org/en)
fr: Remplissez le formulaire avec l'entrée nécessaire. Exemple ci-dessous. L'ID de formulaire Mautic est récupéré à partir du formulaire d'abonnement créé sur le logiciel de Mautic. Reportez-vous à [Guide de l'utilisateur Mautic] (https://docs.moutic.org/en)
sw: Jaza fomu na pembejeo muhimu. Mfano hapa chini. Kitambulisho cha fomu ya Mautic kinapatikana kutoka kwa fomu ya usajili iliyoundwa kwenye programu ya Mautic. Rejea [Mwongozo wa Mtumiaji wa Mautic] (https://docs.mautic.org/en)

source: Mautic Page
fr: Page mautique
sw: Ukurasa wa Mautic

source: Once the page is published, this page will render all fields created in Mautic.
fr: Une fois la page publiée, cette page rendra tous les champs créés dans Mautic.
sw: Mara tu ukurasa ukichapishwa, ukurasa huu utatoa sehemu zote zilizoundwa kwa Mautic.

source: In progress ...
fr: En cours ...
sw: Katika Maendeleo ...

source: City Forecasts
fr: Prévisions de la ville
sw: Utabiri wa jiji

source: ![Preview Home](../_static/images/city_forecasts/preview_home.png "Preview Home")
fr: ! [Aperçu de la maison] (../_ statique / images / city_forecasts / aperview_home.png "Preview home")
sw: ! [Hakikisho nyumbani] (../_ tuli/picha/city_forecasts/hakikisho_home.png "hakikisho nyumbani"))

source: Preview Home
fr: Aperçu de la maison
sw: Hakiki nyumbani

source: City forecasts displayed on the homepage, and forecasts page can be added through the ClimWeb in two ways:
fr: Les prévisions de la ville affichées sur la page d'accueil et la page des prévisions peuvent être ajoutées à travers l'escalade de deux manières:
sw: Utabiri wa jiji ulioonyeshwa kwenye ukurasa wa nyumbani, na ukurasa wa utabiri unaweza kuongezwa kupitia njia ya kupanda kwa njia mbili:

source: Manually adding daily forecasts
fr: Ajout manuellement des prévisions quotidiennes
sw: Kuongeza utabiri wa kila siku

source: Fetching city forecasts from an external source i.e YR Meteo Norway's location forecast API https://developer.yr.no/featured-products/forecast/
fr: Recherche des prévisions de la ville à partir d'une source externe, c'est-à-dire API de prévision de localisation de Meteo Norvège https://developer.yr.no/faturered-products/forecast/
sw: Kuchukua utabiri wa jiji kutoka kwa chanzo cha nje i.e yr Meteo eneo la utabiri wa eneo la https://developer.yr.no/featured-products/forecast/

source: The forecast manager comes with predefined weather conditions and icons. Please refer to YR Weather symbols documentation for guidance on icons and naming convention. https://api.met.no/weatherapi/weathericon/2.0/documentation
fr: Le gestionnaire de prévisions est livré avec des conditions météorologiques prédéfinies et des icônes. Veuillez vous référer à la documentation des symboles météorologiques pour les icônes et la convention de dénomination. https://api.met.no/weatherapi/weathericon/2.0/documentation
sw: Meneja wa utabiri huja na hali ya hewa iliyofafanuliwa na icons. Tafadhali rejelea nyaraka za alama za hali ya hewa kwa mwongozo juu ya icons na kusanyiko la kumtaja. https://api.met.no/weatherapi/weathericon/2.0/documentation

source: Manually Adding Forecasts
fr: Ajout manuellement des prévisions
sw: Kuongeza utabiri

source: The city forecast explorer menu can be accessed on the left sidebar.
fr: Le menu Explorer des prévisions de la ville est accessible sur la barre latérale gauche.
sw: Menyu ya Utabiri wa Jiji inaweza kupatikana kwenye pembeni ya kushoto.

source: ![Forecast explorer](../_static/images/city_forecasts/forecast_explorer.png "Forecast explorer")
fr: ! [Explorateur de prévisions] (../_ statique / images / city_forecasts / prévision_explorer.png "Explorer de prévision")

source: Forecast explorer
fr: Explorateur de prévisions
sw: Utabiri wa Explorer

source: Here you have the ability to:
fr: Ici, vous avez la capacité de:
sw: Hapa una uwezo wa:

source: Add/Edit/Delete a city (city name and location)
fr: Ajouter / modifier / supprimer une ville (nom et emplacement de la ville)
sw: Ongeza/Hariri/Futa Jiji (Jina la Jiji na Mahali)

source: ![Add city](../_static/images/city_forecasts/add_city.png "Add city")
fr: ! [Ajouter la ville] (../_ statique / images / city_forecasts / add_city.png "Ajouter la ville")

source: Add city
fr: Ajouter la ville
sw: Ongeza jiji

source: Import city forecasts in CSV format.
fr: Prévisions en ville d'importation au format CSV.
sw: Ingiza utabiri wa jiji katika muundo wa CSV.

source: ![Add Forecast Explorer](../_static/images/city_forecasts/add_forecast_explorer.png "Add Forecast Explorer")
fr: ! [Ajouter un explorateur de prévisions] (../_ statique / images / city_forecasts / add_forecast_explorer.png "Ajouter un explorateur de prévisions")

source: Add Forecast Explorer
fr: Ajouter un explorateur de prévisions
sw: Ongeza utabiri wa utabiri

source: Using the forecast manager, it is possible to load city forecasts in CSV format created offline or alternatively populate the table on the right with data. A template of the standard CSV structure is provided prepopulated with a list of all cities listed in the database. However, the forecast manager can accept a different structure and allow for correct matching of each of the columns. A forecast date must be provided for the data being uploaded before publishing.
fr: En utilisant le gestionnaire de prévisions, il est possible de charger les prévisions de la ville au format CSV créé hors ligne ou de remplir alternativement le tableau à droite avec les données. Un modèle de la structure CSV standard est fourni préparée avec une liste de toutes les villes répertoriées dans la base de données. Cependant, le gestionnaire de prévisions peut accepter une structure différente et permettre une correspondance correcte de chacune des colonnes. Une date de prévision doit être fournie pour les données en cours de téléchargement avant la publication.
sw: Kutumia meneja wa utabiri, inawezekana kupakia utabiri wa jiji katika muundo wa CSV iliyoundwa nje ya mkondo au vinginevyo kueneza meza upande wa kulia na data. Kiolezo cha muundo wa kawaida wa CSV hutolewa mapema na orodha ya miji yote iliyoorodheshwa kwenye hifadhidata. Walakini, meneja wa utabiri anaweza kukubali muundo tofauti na kuruhusu kulinganisha sahihi kwa kila safu. Tarehe ya utabiri lazima itolewe kwa data iliyopakiwa kabla ya kuchapishwa.

source: ![Add Forecast](../_static/images/city_forecasts/add_forecast.png "Add Forecast")
fr: ! [Ajouter des prévisions] (../_ statique / images / city_forecasts / add_forecast.png "Ajouter la prévision")

source: Add Forecast
fr: Ajouter des prévisions
sw: Ongeza utabiri

source: Preview previously added city forecasts (last 7 days)
fr: Aperçu précédemment ajouté les prévisions de la ville (7 derniers jours)
sw: Hakikisho la hapo awali liliongeza utabiri wa jiji (siku 7 zilizopita)

source: ![Load Forecast Explorer](../_static/images/city_forecasts/load_forecast_explorer.png "Load Forecast Explorer")
fr: ! [Explorateur de prévisions de charge] (../_ statique / images / city_forecasts / load_forecast_explorer.png "Explorer de prévision de charge")

source: Load Forecast Explorer
fr: Explorateur de prévisions de charge
sw: Mzigo wa utabiri wa mzigo

source: It is also possible to fetch and preview the last 7 day city forecasts. The forecast manager allows for switching between each of the avilable dates and preview both in tabular and georeferenced formats.
fr: Il est également possible de récupérer et de prévisualiser les dernières prévisions de la ville de 7 jours. Le gestionnaire de prévisions permet de basculer entre chacune des dates avilables et de prévisualiser à la fois dans des formats tabulaires et géoréférencés.
sw: Inawezekana pia kuchukua na hakiki utabiri wa siku 7 za jiji. Meneja wa utabiri huruhusu kubadili kati ya kila tarehe inayoweza kupatikana na hakikisho katika muundo wa tabular na georefered.

source: ![Load Forecast](../_static/images/city_forecasts/load_forecast.png "Load Forecast")
fr: ! [Prévision de charge] (../_ statique / images / city_forecasts / load_forecast.png "Prévision de charge")
sw: ! [Utabiri wa mzigo] (../_ tuli/picha/city_forecasts/mzigo_forecast.png "utabiri wa mzigo"))

source: Load Forecast
fr: Prévisions de charge
sw: Utabiri wa mzigo

source: Add Daily Weather Summary
fr: Ajouter un résumé météorologique quotidien
sw: Ongeza muhtasari wa hali ya hewa ya kila siku

source: ![Daily Weather Explorer](../_static/images/city_forecasts/daily_weather_explorer.png "Daily Weather Explorer")
fr: ! [Explorateur météo quotidien] (../_ statique / images / city_forecasts / quotidien_weather_explorer.png "Explorer météo quotidien")

source: Daily Weather Explorer
fr: Explorateur météo quotidien
sw: Explorer ya hali ya hewa ya kila siku

source: ![Daily Weather](../_static/images/city_forecasts/daily_weather.png "Daily Weather")
fr: ! [Météo quotidien] (../_ statique / images / city_forecasts / quotidien_weather.png "temps quotidien")
sw: ! [Hali ya hewa ya kila siku] (../_ tuli/picha/city_forecasts/kila siku_weather.png "hali ya hewa ya kila siku")

source: Daily Weather
fr: Météo quotidien
sw: Hali ya hewa ya kila siku

source: Additionally, a daily weather summary containing descriptive information about the observed conditions, weather forecast and extreme station readings is also provided. A preview of this information would appear as below on the website:
fr: De plus, un résumé quotidien contenant des informations descriptives sur les conditions observées, les prévisions météorologiques et les lectures de la station extrême est également fournie. Un aperçu de ces informations apparaîtrait comme ci-dessous sur le site Web:
sw: Kwa kuongezea, muhtasari wa hali ya hewa ya kila siku ulio na habari ya kuelezea juu ya hali iliyozingatiwa, utabiri wa hali ya hewa na usomaji wa kituo uliokithiri pia hutolewa. Hakiki ya habari hii itaonekana kama hapa chini kwenye wavuti:

source: ![Daily Weather Preview](../_static/images/city_forecasts/daily_weather_preview.png "Daily Weather Preview")
fr: ! [Aperçu météorologique quotidien] (../_ statique / images / city_forecasts / quotidien_weather_preview.png "Aperçu quotidien"))
sw: ! [Hakiki ya hali ya hewa ya kila siku] (../_ tuli/picha/jiji

source: Daily Weather Preview
fr: Aperçu météorologique quotidien
sw: Hakiki ya hali ya hewa ya kila siku

source: Fetching from an external source
fr: Récupérer à partir d'une source externe
sw: Kuchukua kutoka kwa chanzo cha nje

source: To enable automated fetching of city forecasts from an external source i.e YR Meteo Norway's location forecast API https://developer.yr.no/featured-products/forecast/, this option needs to be set to true.
fr: Pour permettre la récupération automatisée des prévisions municipales à partir d'une source externe, c'est-à-dire API de prévision de localisation de Meteo Norvège https://devener.yr.no/featered-products/forecast/, cette option doit être définie.
sw: Ili kuwezesha utaftaji wa kiotomatiki wa utabiri wa jiji kutoka kwa chanzo cha nje i.e yr Meteo Norway ya utabiri wa eneo la https://developer.yr.no/featured-products/forecast/, chaguo hili linahitaji kuwekwa kuwa kweli.

source: The forecast will be fetched every three hours and get updated accordingly.
fr: Les prévisions seront récupérées toutes les trois heures et seront mises à jour en conséquence.
sw: Utabiri utachukuliwa kila masaa matatu na kusasishwa ipasavyo.

source: ![AutoForecast](../_static/images/city_forecasts/autoforecast.png "AutoForecast")
fr: ! [AutoforeCast] (../_ statique / images / city_forecasts / autoforecast.png "autoforecast")

source: ![Organisation page](../_static/images/mapviewer/mapviewer.png "Organisation page")
fr: ! [Page d'organisation] (../_ statique / images / mapViewer / mapViewer.png "Page d'organisation")
sw: ! [Ukurasa wa shirika] (../_ tuli/picha/MapViewer/MapViewer.png "Ukurasa wa Shirika")

source: Organisation page
fr: Page d'organisation
sw: Ukurasa wa shirika

source: Pilot Phase
fr: Phase pilote
sw: Awamu ya majaribio

source: The regional office began piloting the ClimWeb with several African countries from **July to December of 2023**, in response to formal request from the WMO’s Permanent Representatives (PRs), addressed to the director of WMO Regional Office for Africa. This section summarizes the progress in the pilot phase, conclusions drawn from the technical support and collaboration provided to NMHSs in developing their pilot websites.
fr: Le bureau régional a commencé à piloter l'escalade avec plusieurs pays africains de ** juillet à décembre 2023 **, en réponse à la demande officielle des représentants permanents de l'OMM (PRS), adressé au directeur du bureau régional de l'OMM pour l'Afrique. Cette section résume les progrès de la phase pilote, les conclusions tirées du soutien technique et de la collaboration fournies aux NMHS pour développer leurs sites Web pilotes.
sw: Ofisi ya mkoa ilianza kupiga marubani na nchi kadhaa za Kiafrika kutoka ** Julai hadi Desemba 2023 **, kujibu ombi rasmi kutoka kwa wawakilishi wa kudumu wa WMO (PRS), iliyoelekezwa kwa Mkurugenzi wa Ofisi ya Mkoa wa WMO wa Afrika. Sehemu hii ina muhtasari wa maendeleo katika awamu ya majaribio, hitimisho linalotokana na msaada wa kiufundi na ushirikiano uliotolewa kwa NMHSS katika kukuza tovuti zao za majaribio.

source: Summary of the progress
fr: Résumé des progrès
sw: Muhtasari wa maendeleo

source: Initially, the selected pilot countries were:
fr: Initialement, les pays pilotes sélectionnés étaient:
sw: Hapo awali, nchi za majaribio zilizochaguliwa zilikuwa:

source: Ethiopia
fr: Ethiopie

source: However, several additional countries have expressed interest in adapting the ClimWeb
fr: Cependant, plusieurs pays supplémentaires ont exprimé leur intérêt à adapter l'escalade
sw: Walakini, nchi kadhaa za ziada zimeonyesha nia ya kurekebisha ClimWeb

source: The status of Climweb setup for each country can be found at [https://climtech.africa/climweb/](https://climtech.africa/climweb/) |
fr: Le statut de configuration de l'ascension pour chaque pays se trouve sur [https://climtech.africa/climweb/
sw: Hali ya usanidi wa kupanda kwa kila nchi inaweza kupatikana katika [https://climtech.africa/climweb/ing(https://climtech.africa/climweb/) |

source: The development of the website generally encompasses eleven steps.
fr: Le développement du site Web comprend généralement onze étapes.
sw: Ukuzaji wa wavuti kwa ujumla unajumuisha hatua kumi na moja.

source: The initial step is installation of the ClimWeb software package
fr: L'étape initiale est l'installation du package logiciel Climpeb
sw: Hatua ya awali ni usanikishaji wa kifurushi cha programu ya ClimWeb

source: Preparation of the base ClimWeb setting
fr: Préparation du réglage de la base
sw: Maandalizi ya mpangilio wa kupanda kwa msingi

source: Organisation of the website’s pages
fr: Organisation des pages du site Web
sw: Shirika la kurasa za wavuti

source: Listing of the desired pages,
fr: Liste des pages souhaitées,
sw: Orodha ya kurasa zinazotaka,

source: Listing of services and products made by NMHSs
fr: Listing des services et des produits fabriqués par NMHSS
sw: Orodha ya huduma na bidhaa zilizotengenezwa na NMHSS

source: Setup of the MapViewer package
fr: Configuration du package MapViewer
sw: Usanidi wa kifurushi cha MapViewer

source: Automatic products visualisation
fr: Visualisation des produits automatiques
sw: Visualization ya bidhaa za moja kwa moja

source: Event pages setup and registration integration
fr: Pages d'événements Configuration et intégration d'enregistrement
sw: Kurasa za Kurasa za Tukio na Ujumuishaji wa Usajili

source: Integration of NMHSs’s social media accounts into the website
fr: Intégration des comptes de médias sociaux de NMHSS dans le site Web
sw: Ujumuishaji wa akaunti za kijamii za NMHSS kwenye wavuti

source: Setup of CAP composing tool
fr: Configuration de l'outil de composition du capuchon
sw: Usanidi wa zana ya kutunga cap

source: Integration of email marketing tool with the website to enable users to sign up to receiving services via email.
fr: Intégration de l'outil de marketing par e-mail avec le site Web pour permettre aux utilisateurs de s'inscrire à la réception des services par e-mail.
sw: Ujumuishaji wa zana ya uuzaji wa barua pepe na wavuti ili kuwezesha watumiaji kujisajili kupokea huduma kupitia barua pepe.

source: Conclusion and recommendations
fr: Conclusion et recommandations
sw: Hitimisho na mapendekezo

source: Broad Implementation and Technical Support
fr: Implémentation large et support technique
sw: Utekelezaji mpana na msaada wa kiufundi

source: **The ClimWeb has been enthusiastically embraced by member states in Africa**, as numerous PRs have submitted formal requests to pilot the system to modernize their existing websites. Currently, ten countries are in various stages of ClimWeb customization, with the first group aiming to launch their updated websites between February and March 2024.
fr: ** Le Clipweb a été adopté avec enthousiasme par les États membres en Afrique **, car de nombreux RP ont soumis des demandes officielles pour piloter le système pour moderniser leurs sites Web existants. Actuellement, dix pays sont à différentes étapes de la personnalisation de Clipweb, le premier groupe visant à lancer leurs sites Web mis à jour entre février et mars 2024.
sw: ** Clipweb imekuwa ikikumbatiwa kwa shauku na nchi wanachama barani Afrika **, kwani PR nyingi zimewasilisha maombi rasmi ya majaribio ya mfumo ili kurekebisha tovuti zao zilizopo. Hivi sasa, nchi kumi ziko katika hatua mbali mbali za uboreshaji wa ClipWeb, na kikundi cha kwanza kinalenga kuzindua tovuti zao zilizosasishwa kati ya Februari na Machi 2024.
