Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: The ClimWeb, by using Django/Wagtail, out of the box contains the following security features inbuilt. More details on each feature can be found at [https://docs.djangoproject.com/en/5.0/topics/security](https://docs.djangoproject.com/en/5.0/topics/security/)
fr: Le montée, en utilisant Django / Worktail, hors de la boîte contient les fonctionnalités de sécurité suivantes intégrées. Plus de détails sur chaque fonctionnalité peuvent être trouvés sur [https://docs.djangoproject.com/en/5.0/topics/security .(https://docs.djangoproject.com/en/5.0/topics/security/)
sw: Clipweb, kwa kutumia Django/Wagtail, nje ya sanduku ina huduma zifuatazo za usalama zilizojengwa. Maelezo zaidi juu ya kila kipengele yanaweza kupatikana katika [https://docs.djangoproject.com/en/5.0/topics/security ahrealhttps://docs.djangoproject.com/en/5.0/topics/security/)

source: Cross site scripting (XSS) protection
fr: Protection des scripts du site croisé (XSS)
sw: Ulinzi wa Maandishi ya Tovuti ya Msalaba (XSS)

source: Cross site request forgery (CSRF) protection
fr: Protection contre la contrefaçon de demande de site (CSRF)
sw: Ulinzi wa Tovuti ya Msalaba (CSRF)

source: SQL Injection protection
fr: Protection contre l'injection SQL
sw: Ulinzi wa sindano ya SQL

source: SSL\HTTPS protection settings
fr: Paramètres de protection SSL \ HTTPS
sw: Mipangilio ya Ulinzi ya SSL \ HTTPS

source: Host header validation
fr: Validation de l'en-tête de l'hôte
sw: Uthibitishaji wa kichwa cha mwenyeji

source: Referrer Policy Protection
fr: Protection des politiques de références
sw: Ulinzi wa sera ya rufaa

source: Cross-origin opener policy
fr: Politique d'ouverture de l'origine croisée
sw: Sera ya Origin-Origin

source: Session Security
fr: Séances de sécurité
sw: Usalama wa Kikao

source: User-uploaded content protection
fr: Protection de contenu téléchargée par l'utilisateur
sw: Ulinzi wa yaliyomo wa watumiaji

source: ClimWeb Specific security features:
fr: Fonctionnalités de sécurité spécifiques de l'entraînement:
sw: Vipengele maalum vya usalama wa ClipWeb:

source: Ability to change admin url periodically
fr: Capacité à modifier périodiquement l'URL de l'administration
sw: Uwezo wa kubadilisha URL ya admin mara kwa mara

source: Daily backup mechanisms
fr: Mécanismes de sauvegarde quotidiens
sw: Mifumo ya chelezo ya kila siku

source: Brute force login preventions
fr: Préventions de connexion par force brute
sw: Vizuizi vya kuingia kwa nguvu ya Brute

source: 2 Factor Authentication for administrator account
fr: Authentification à 2 facteurs pour le compte administrateur
sw: Uthibitishaji wa sababu 2 kwa akaunti ya msimamizi

source: Alertwise Base Settings
fr: Paramètres de base en alerte
sw: Mipangilio ya msingi ya tahadhari

source: These are common details that are repeated across the Alertwise tool and are set only once.
fr: Ce sont des détails courants qui sont répétés à travers l'outil d'alerte et ne sont définis qu'une seule fois.
sw: Hizi ni maelezo ya kawaida ambayo yanarudiwa kwenye zana ya tahadhari na huwekwa mara moja tu.

source: Sender Details
fr: Détails de l'expéditeur
sw: Maelezo ya mtumaji

source: These include:
fr: Ceux-ci incluent:
sw: Hii ni pamoja na:

source: CAP Sender name - Name of the sending institution
fr: Nom de l'expéditeur CAP - Nom de l'institution d'envoi
sw: Jina la mtumaji wa cap - Jina la taasisi inayotuma

source: CAP Sender email - Email of the sending institution
fr: Courriel de l'expéditeur CAP - Email de l'institution d'envoi
sw: Barua pepe ya mtumaji - barua pepe ya taasisi inayotuma

source: The WMO Register of Alerting Authorities OID is used to generate the identifier each CAP Alert - This is the official OID assigned to each country in the [WMO register of alerting authorities](https://alertingauthority.wmo.int/authorities.php)
fr: Le registre des autorités d'alerte WMO est utilisé pour générer l'identifiant de chaque alerte CAP - il s'agit de l'OID officiel attribué à chaque pays dans le [WMO Register of Alerting Authorities] (https://alertingauthority.wmo.int/authorities.php)
sw: Usajili wa WMO wa Mamlaka ya Kuonya OID hutumiwa kutoa kitambulisho kila tahadhari - hii ndio OID rasmi iliyopewa kila nchi katika usajili wa [WMO wa Mamlaka ya Kuonya] (https://alertingauthority.wmo.int/authorities.php)

source: Logo of the institution
fr: Logo de l'institution
sw: Nembo ya taasisi

source: Contact details-
fr: Coordonnées
sw: Maelezo ya mawasiliano-

source: ![CAP Sender Details](../../_static/images/cap/CAP_sender_details.png "CAP Sender Details")
fr: ! [Détails de l'expéditeur de cap
sw: ! [Maelezo ya mtumaji wa cap] (../../_ tuli/picha/cap/cap_sender_details.png "maelezo ya mtumaji")))))))

source: CAP Sender Details
fr: Détails de l'expéditeur CAP
sw: Maelezo ya mtumaji wa cap

source: Hazard Types
fr: Types de danger
sw: Aina za hatari

source: Here the NMHSs input the different types of hazards they monitor. They can select the hazards from a WMO predefined list of hazards or create a new custom hazard/event type. Each hazard type can be associated with an Icon
fr: Ici, le NMHSS présente les différents types de dangers qu'ils surveillent. Ils peuvent sélectionner les dangers dans une liste de dangers prédéfinie par l'OMM ou créer un nouveau type de danger / événement personnalisé. Chaque type de danger peut être associé à une icône
sw: Hapa NMHSS inaingiza aina tofauti za hatari wanazofuatilia. Wanaweza kuchagua hatari kutoka kwa orodha iliyofafanuliwa ya WMO ya hatari au kuunda aina mpya ya hatari/tukio. Kila aina ya hatari inaweza kuhusishwa na ikoni

source: ![CAP Hazard Types](../../_static/images/cap/CAP_hazard_types.png "CAP Hazard Types")
fr: ! [Types de dangers de cap
sw: ! [Aina za hatari] (../../_ tuli/picha/cap/cap_hazard_types.png "aina za hatari za cap"))

source: CAP Hazard Types
fr: Types de risques
sw: Aina za hatari za cap

source: Predefined Areas
fr: Zones prédéfinies
sw: Maeneo yaliyotanguliwa

source: Here you can create a list of common regions that are know to experience alerts. This will save you time so that you do not have to draw the same area each time for new alerts.
fr: Ici, vous pouvez créer une liste de régions communes qui savent vivre des alertes. Cela vous fera gagner du temps afin que vous n'ayez pas à dessiner la même zone à chaque fois pour les nouvelles alertes.
sw: Hapa unaweza kuunda orodha ya mikoa ya kawaida ambayo inajua kupata arifu. Hii itakuokoa wakati ili sio lazima kuteka eneo moja kila wakati kwa arifu mpya.

source: ![CAP Predefined Areas](../../_static/images/cap/CAP_predefined_areas.png "CAP Predefined Areas")
fr: ! [Cap prédéfinis] (../../_ statique / images / cap / cap_predefined_areas.png "Cap prédéfini")

source: CAP Predefined Areas
fr: Cap prédéfini les zones
sw: Maeneo yaliyofafanuliwa

source: While drawing a boundary, if the area falls out of the UN Boundaries set, a warning and button will appear to snap the area back to the UN Boundaries. Snapping boundaries back to the UN Boundary ensures that the CAP Alert is displayed on Severe Weather and Information Centre (SWIC) platform. To set up UN Boundaries, refer to [Setting up UN Boundary](#un-boundary) section.
fr: Tout en traitant une limite, si la zone tombe de l'ensemble des limites des Nations Unies, un avertissement et un bouton semblent reprendre la zone aux limites de l'ONU. Retourner les limites à la frontière des Nations Unies garantit que l'alerte de capuchon est affichée sur la plate-forme sévère des intempéries et du centre d'information (SWIC). Pour configurer les limites de l'ONU, reportez-vous à la section [Configuration des limites de l'ONU] (# non-limite).
sw: Wakati wa kuchora mpaka, ikiwa eneo litatoka kwenye mipaka ya UN iliyowekwa, onyo na kitufe kitaonekana kurudisha eneo hilo kwenye mipaka ya UN. Mipaka ya kurudisha nyuma kwenye mpaka wa UN inahakikisha kuwa tahadhari ya CAP inaonyeshwa kwenye jukwaa kali la hali ya hewa na kituo cha habari (SWIC). Ili kuweka mipaka ya UN, rejelea [Kusanidi UN BOUNDARY] (#UN-BOUNDARY).

source: ![CAP UN Boundary](../../_static/images/cap/CAP_Boundary_warning.png "CAP UN Boundary")
fr: ! [Boundary de Cap Un] (../../_ statique / images / cap / cap_boundary_warning.png "Cap Un limite")
sw: ! [Cap un mpaka] (../../_ tuli/picha/cap/cap_boundary_warning.png "cap un mpaka")

source: CAP UN Boundary
fr: Boundaire de capuchon
sw: Mpaka wa UN

source: Languages
fr: Langues
sw: Lugha

source: To add one or more languages, the Language code such as fr and Language name such as French. This languages will be useful when creating multiple Alert Infos for a CAP Alert where one alert info corresponds to another one Alert info by its translated language.
fr: Pour ajouter une ou plusieurs langues, le code de la langue tel que le FR et le nom de la langue tels que le français. Ces langues seront utiles lors de la création de plusieurs infos d'alerte pour une alerte de capuchon où une information d'alerte correspond à une autre information d'alerte par sa langue traduite.
sw: Kuongeza lugha moja au zaidi, nambari ya lugha kama vile FR na jina la lugha kama vile Kifaransa. Lugha hii itakuwa muhimu wakati wa kuunda infos nyingi za tahadhari kwa tahadhari ya cap ambapo habari moja ya tahadhari inalingana na habari nyingine ya tahadhari na lugha yake iliyotafsiriwa.

source: ![CAP Languages](../../_static/images/cap/CAP_languages.png "CAP Languages")
fr: ! [Languages ​​CAP] (../../_ statique / images / cap / cap_languages.png "Langues CAP")
sw: ! [Lugha za cap] (../../_ tuli/picha/cap/cap_languages.png "lugha za cap"))

source: CAP Languages
fr: Langues de plafond
sw: Lugha za cap

source: UN Boundary
fr: Limite des Nations Unies
sw: Mpaka wa UN

source: This section allows you to upload a GeoJSON file of the UN Country Boundary. Setting this will enable the UN Country Boundary check in the alertdrawing tools.
fr: Cette section vous permet de télécharger un fichier Geojson de la limite du pays des Nations Unies. La définition permettra à la vérification des limites du pays des Nations Unies dans les outils d'alerte.
sw: Sehemu hii hukuruhusu kupakia faili ya Geojson ya mpaka wa nchi ya UN. Kuweka hii itawezesha ukaguzi wa mipaka ya nchi ya UN kwenye zana za tahadhari.

source: ![CAP UN Boundary](../../_static/images/cap/CAP_UN_Boundary.png "CAP UN Boundary")
fr: ! [Boundary de Cap Un] (../../_ statique / images / cap / cap_un_boundary.png "Cap un limite")
sw: ! [Cap un mpaka] (../../_ tuli/picha/cap/cap_un_boundary.png "cap Un mpaka")

source: AlertWise Features
fr: Caractéristiques en alerte
sw: Huduma za tahadhari

source: CAP Warning Composer Features
fr: Caractéristiques du compositeur d'avertissement de capuchon
sw: Vipengele vya mtunzi wa onyo

source: The Alertwise tool is a solution that provides a range of functionalities to support the NMHS in seamlessly issuing CAP. It has been developed with an aim of increasing the adoption of CAP by NMHS in Africa.
fr: L'outil alerte est une solution qui fournit une gamme de fonctionnalités pour prendre en charge le NMHS dans le plafond émettant de manière transparente. Il a été développé dans le but d'augmenter l'adoption de CAP par le NMHS en Afrique.
sw: Chombo cha tahadhari ni suluhisho ambalo hutoa anuwai ya utendaji kusaidia NMHS katika cap ya kutoa bila mshono. Imeandaliwa kwa kusudi la kuongeza kupitishwa kwa CAP na NMHS barani Afrika.

source: ![CAP Example](../../_static/images/cap/cap_example.png "CAP Example")
fr: ! [Exemple de cap] (../../_ statique / images / cap / cap_example.png "Exemple de cap
sw: ! [Mfano wa cap] (../../_ tuli/picha/cap/cap_ex samp.png "mfano wa cap"))

source: CAP Example
fr: Exemple de plafond
sw: Mfano wa cap

source: Some of the key features of the tool include:
fr: Certaines des principales caractéristiques de l'outil comprennent:
sw: Baadhi ya sifa muhimu za chombo ni pamoja na:

source: 🌟 Features
fr: 🌟 fonctionnalités
sw: Vipengele

source: Modern user-friendly composer that follows [CAP 1.2](http://docs.oasis-open.org/emergency/cap/v1.2/CAP-v1.2-os.html) standard. Built on top of the awesome [Wagtail CMS](https://wagtail.org)
fr: Compositeur moderne convivial qui suit [CAP 1.2] (http://docs.oasis-open.org/emergency/cap/v1.2/cap-v1.2-os.html) Standard. Construit au-dessus de la superbe [CMS à berce-berger] (https://wagtail.org)
sw: Mtunzi wa kisasa wa watumiaji wanaofuata [cap 1.2] (http://docs.oasis-open.org/emergency/cap/v1.2/cap-v1.2-os.html). Imejengwa juu ya Ajabu [Wagtail CMS] (https://wagtail.org)

source: Preview a CAP alert as you edit. Save drafts for sharing with colleagues and collaborating
fr: Aperçu une alerte de plafond lorsque vous modifiez. Économisez des brouillons pour le partage avec des collègues et collaborant
sw: Hakiki tahadhari ya cap unapohariri. Okoa rasimu za kushiriki na wenzake na kushirikiana

source: Inbuilt CAP validation. The page will not save if you have not input the required data according to CAP standard
fr: Validation du plafond intégrée. La page n'enregistrera pas si vous n'avez pas saisi les données requises en fonction de la norme CAP
sw: Uthibitisho wa cap uliojengwa. Ukurasa hautahifadhi ikiwa haujaingiza data inayohitajika kulingana na kiwango cha cap

source: User-friendly alert area map tool that allows multiple ways of constructing alert geographic areas, while keeping the interface simple
fr: Outil de carte des zones d'alerte conviviale qui permet de multiples façons de construire des zones géographiques d'alerte, tout en gardant l'interface simple
sw: Chombo cha ramani ya tahadhari ya watumiaji ambayo inaruhusu njia nyingi za kujenga maeneo ya kijiografia, wakati wa kuweka interface rahisi

source: Upload and use your country/territory's administrative boundaries
fr: Téléchargez et utilisez les limites administratives de votre pays / territoire
sw: Pakia na utumie mipaka ya kiutawala ya nchi yako/wilaya

source: Draw a polygon
fr: Dessiner un polygone
sw: Chora polygon

source: Draw a circle
fr: Dessiner un cercle
sw: Chora duara

source: Selecting predefined areas that you create beforehand for common alert areas
fr: Sélection des zones prédéfinies que vous créez au préalable pour les zones d'alerte communes
sw: Kuchagua maeneo yaliyofafanuliwa ambayo unaunda mapema kwa maeneo ya kawaida ya tahadhari

source: Inbuilt publishing workflow using Wagtail's powerful page model, with automated emails to composers and approvers
fr: Flux de travail de publication intégrée à l'aide du puissant modèle de page de Worktail, avec des e-mails automatisés aux compositeurs et aux approbateurs
sw: Uchapishaji uliojengwa kwa kutumia Mfano wa Ukurasa wenye nguvu wa Wagtail, na barua pepe za kiotomatiki kwa watunzi na wakubali

source: Collaborate with team members using inbuilt comments (similar to how you could do in Word) with automated notifications. Request for changes and approvals
fr: Collaborez avec les membres de l'équipe en utilisant des commentaires intégrés (similaires à la façon dont vous pourriez faire dans Word) avec des notifications automatisées. Demande de modifications et d'approbations
sw: Shirikiana na washiriki wa timu kutumia maoni ya ndani (sawa na jinsi unavyoweza kufanya kwa neno) na arifa za kiotomatiki. Ombi la mabadiliko na idhini

source: Publish realtime notifications/messages to third party integrations using MQTT messaging protocol
fr: Publier des notifications / messages en temps réel aux intégrations tierces à l'aide du protocole de messagerie MQTT
sw: Chapisha Arifa/Ujumbe wa RealTime kwa Ujumuishaji wa Tatu kwa kutumia Itifaki ya Ujumbe wa MQTT

source: Predefine a list of hazards types monitored by your institution, with intuitive icons from [OCHA humanitarian icons](https://brand.unocha.org/d/xEPytAUjC3sH/icons#/humanitarian-icons)
fr: Prédéfinir une liste de types de dangers surveillés par votre institution, avec des icônes intuitives de [Ocha Humanitarian Icons] (https://brand.unocha.org/d/xepytaujc3sh/icons#/humanitarian-icons)
sw: Eleza orodha ya aina za hatari zinazofuatiliwa na taasisi yako, na icons za angavu kutoka kwa [icons za kibinadamu] (https://brand.unocha.org/d/xepytaujc3sh/icons#/humanitarian-icons)

source: Extendable to add your custom logic and functionality. The package provides an `abstract` django model that can be inherited for customizations.
fr: Extensible pour ajouter votre logique et fonctionnalité personnalisées. Le package fournit un modèle Django «abstrait» qui peut être hérité des personnalisations.
sw: Inaweza kuongeza mantiki yako ya kawaida na utendaji. Kifurushi hutoa mfano wa `abstract` django ambao unaweza kurithiwa kwa ubinafsishaji.

source: CAP Composer and Approver Roles and Publishing Workflows
fr: CAP compositeur et rôles d'approbation et de workflows de publication
sw: Mtunzi wa cap na majukumu ya kupitisha na kuchapisha kazi

source: Within CAP, roles such as "Composer" and "Approver" are essential to ensure the accuracy and authorization of alerts before dissemination.
fr: Dans le CAP, des rôles tels que "compositeur" et "approbateur" sont essentiels pour assurer la précision et l'autorisation des alertes avant la diffusion.
sw: Ndani ya cap, majukumu kama "mtunzi" na "idhini" ni muhimu ili kuhakikisha usahihi na idhini ya arifu kabla ya usambazaji.

source: **CAP Composer Role:**
fr: ** Rôle du compositeur CAP: **
sw: ** jukumu la mtunzi wa cap: **

source: A CAP Composer is responsible for creating and drafting alert messages. This role involves collecting pertinent information about an incident and structuring it according to the CAP format. The Composer ensures that all necessary details are included to inform the public or specific agencies effectively.
fr: Un compositeur CAP est responsable de la création et de la rédaction de messages d'alerte. Ce rôle consiste à collecter des informations pertinentes sur un incident et à les structurer selon le format CAP. Le compositeur garantit que tous les détails nécessaires sont inclus pour informer efficacement les agences publiques ou spécifiques.
sw: Mtunzi wa cap ana jukumu la kuunda na kuandaa ujumbe wa tahadhari. Jukumu hili linajumuisha kukusanya habari zinazofaa juu ya tukio na kuipanga kulingana na muundo wa CAP. Mtunzi huhakikisha kuwa maelezo yote muhimu yanajumuishwa kuwajulisha umma au mashirika maalum kwa ufanisi.

source: **CAP Approver Role:**
fr: ** Rôle de l'approbation du plafond: **
sw: ** jukumu la idhini: **

source: The CAP Approver reviews the alerts composed by the Composer. This role is crucial for validating the content, ensuring compliance with organizational protocols, and authorizing the release of the alert to the intended audience. The Approver acts as a quality control measure to prevent the dissemination of incorrect or unauthorized information.
fr: L'approbation de CAP examine les alertes composées par le compositeur. Ce rôle est crucial pour valider le contenu, assurer le respect des protocoles organisationnels et l'autorisation de la libération de l'alerte au public prévu. L'approbateur agit comme une mesure de contrôle de la qualité pour empêcher la diffusion d'informations incorrectes ou non autorisées.
sw: Kibali cha kukagua arifu zilizoundwa na mtunzi. Jukumu hili ni muhimu kwa kudhibitisha yaliyomo, kuhakikisha kufuata itifaki za shirika, na kuidhinisha kutolewa kwa tahadhari kwa watazamaji waliokusudiwa. Approver hufanya kama hatua ya kudhibiti ubora kuzuia usambazaji wa habari isiyo sahihi au isiyoidhinishwa.

source: **Configuring Composer and Approver Roles**
fr: ** Configuration des rôles compositeurs et approbateurs **
sw: ** Kusanidi Mtunzi na Majukumu ya Approver **

source: The general process for setting up Composer and Approver roles involves the following steps:
fr: Le processus général de mise en place des rôles compositeurs et d'approbation implique les étapes suivantes:
sw: Mchakato wa jumla wa kuanzisha majukumu ya mtunzi na idhini inajumuisha hatua zifuatazo:

source: **Access the User Management or Administration Section:**
fr: ** Accédez à la section de gestion des utilisateurs ou d'administration: **
sw: ** Fikia Sehemu ya Usimamizi wa Mtumiaji au Sehemu ya Utawala: **

source: Navigate to the system's settings where users and groups are managed. ![Users and Groups](../../_static/images/settings/users_and_groups.png "Users and Groups")
fr: Accédez aux paramètres du système où les utilisateurs et les groupes sont gérés. ! [Utilisateurs et groupes] (../../_ statique / images / paramètres / utilisateurs_and_groups.png "utilisateurs et groupes")
sw: Nenda kwa mipangilio ya mfumo ambapo watumiaji na vikundi vinasimamiwa. ! [Watumiaji na vikundi] (../../_ tuli/picha/mipangilio/watumiaji_and_groups.png "watumiaji na vikundi"))

source: Users and Groups
fr: Utilisateurs et groupes
sw: Watumiaji na vikundi

source: **Define Roles and Permissions:**
fr: ** Définir les rôles et les autorisations: **
sw: ** Fafanua majukumu na ruhusa: **

source: Click on groups
fr: Cliquez sur les groupes
sw: Bonyeza kwenye vikundi

source: Create roles/groups titled "Composer" and "Approver."
fr: Créez des rôles / groupes intitulés "Composer" et "Approver".
sw: Unda majukumu/vikundi vyenye jina "Mtunzi" na "Propover."

source: ![Groups](../../_static/images/settings/groups.png "Groups")
fr: ! [Groupes] (../../_ statique / images / paramètres / groupes.png "groupes")
sw: ! [Vikundi] (../../_ tuli/picha/mipangilio/vikundi.png "vikundi"))

source: Groups
fr: Groupes
sw: Vikundi

source: Assign permissions to each role based on their responsibilities:
fr: Attribuer des autorisations à chaque rôle en fonction de leurs responsabilités:
sw: Toa ruhusa kwa kila jukumu kulingana na majukumu yao:

source: **Composer:** Permissions to create and edit alerts but not to publish them.
fr: ** Compositeur: ** Autorisations pour créer et modifier des alertes mais pas pour les publier.
sw: ** Mtunzi: ** ruhusa za kuunda na kuhariri arifu lakini sio kuzichapisha.

source: ![Can view CAP Menu](../../_static/images/cap/can_view_cap_menu.png "Can view CAP Menu")
fr: ! [Peut afficher le menu CAP] (../../_ static / images / cap / can_view_cap_menu.png "peut afficher le menu de capuchon")
sw: ! [Inaweza kutazama menyu ya cap] (../../_ tuli/picha/cap/can_view_cap_menu.png "inaweza kutazama menyu ya cap"))

source: Can view CAP Menu
fr: Peut afficher le menu du plafond
sw: Inaweza kutazama menyu ya cap

source: ![Can view CAP Menu](../../_static/images/cap/more_cap_composer_roles.png "Can view CAP Menu")
fr: ! [Peut afficher le menu CAP] (../../_ static / images / cap / mose_cap_composer_roles.png "peut afficher le menu CAP")

source: ![Can view CAP Menu](../../_static/images/cap/composer_page_permissions.png "Can view CAP Menu")
fr: ! [Peut afficher le menu CAP] (../../_ static / images / cap / composer_page_permissions.png "peut afficher le menu de capuchon")

source: **Approver:** Permissions to review, approve, or reject alerts, and to publish approved alerts.
fr: ** Approbateur: ** Autorisations pour examiner, approuver ou rejeter les alertes, et publier des alertes approuvées.
sw: ** Approver: ** ruhusa za kukagua, kupitisha, au kukataa arifu, na kuchapisha arifu zilizoidhinishwa.

source: ![Can view CAP Menu](../../_static/images/cap/approver_can_view_alerts.png "Can view CAP Menu")
fr: ! [Peut afficher le menu CAP] (../../_ statique / images / cap / approvers_can_view_alert.png "peut afficher le menu de capuchon")
sw: ! [Inaweza kutazama menyu ya cap] (../../_ tuli/picha/cap/approver_can_view_alerts.png "inaweza kutazama menyu ya cap")

source: ![Can view CAP Menu](../../_static/images/cap/approver_other_permissions.png "Can view CAP Menu")
fr: ! [Peut afficher le menu CAP] (../../_ statique / images / cap / approvers_other_permisessions.png "peut afficher le menu CAP")
sw: ! [Inaweza kutazama menyu ya cap] (../../_ tuli/picha/cap/approver_other_permissions.png "inaweza kutazama menyu ya cap"))
