Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: Snippets allow you to create elements on a website once and reuse them in multiple places. You only have to change something in a snippet once, and the changes appear in all occurrences.
fr: Les extraits vous permettent de créer des éléments sur un site Web une fois et de les réutiliser à plusieurs endroits. Vous n'avez qu'à changer quelque chose dans un extrait une fois, et les changements apparaissent dans toutes les occurrences.
sw: Snippets hukuruhusu kuunda vitu kwenye wavuti mara moja na kuzitumia tena katika maeneo mengi. Lazima ubadilishe kitu kwenye snippet mara moja, na mabadiliko yanaonekana katika kutokea kwa yote.

source: The use of snippets varies between websites. Wagtail developers use snippets for the following purposes:
fr: L'utilisation des extraits varie entre les sites Web. Les développeurs en bergeronnets utilisent des extraits aux fins suivantes:
sw: Matumizi ya viunzi hutofautiana kati ya wavuti. Watengenezaji wa Wagtail hutumia viunzi kwa madhumuni yafuatayo:

source: For blog post authors. As a result, you can add them to multiple pages and manage them from one place. For adverts. This way, you can apply them site-wide or on individual pages. To manage links in a global area of the site. For example, in the footer. For calls to action, such as newsletter sign-up blocks, that may be consistent across many different pages.
fr: Pour les auteurs de blogs. En conséquence, vous pouvez les ajouter à plusieurs pages et les gérer à partir d'un seul endroit. Pour les publicités. De cette façon, vous pouvez les appliquer à l'échelle du site ou sur des pages individuelles. Pour gérer les liens dans une zone mondiale du site. Par exemple, dans le pied de page. Pour les appels à l'action, tels que les blocs d'inscription des newsletter, qui peuvent être cohérents sur de nombreuses pages différentes.
sw: Kwa waandishi wa chapisho la blogi. Kama matokeo, unaweza kuziongeza kwenye kurasa nyingi na kuzisimamia kutoka sehemu moja. Kwa matangazo. Kwa njia hii, unaweza kuzitumia tovuti nzima au kwenye kurasa za mtu binafsi. Kusimamia viungo katika eneo la ulimwengu wa tovuti. Kwa mfano, katika footer. Kwa simu za kuchukua hatua, kama vile vizuizi vya usajili wa jarida, ambayo inaweza kuwa thabiti katika kurasa nyingi tofauti.

source: The Snippets Menu
fr: Le menu des extraits
sw: Menyu ya Snippets

source: You can access the snippets by clicking **Snippets** in the Sidebar. Clicking **Snippets** takes you to the Snippets interface. To add, edit, or delete a snippet, click the snippet type that interests you. Clicking the snippet type takes you to the edit screen, from which you can add, edit, or delete a snippet. Hovering over an individual snippet displays the options to edit or delete that snippet. To add a new snippet to the snippet type, click **Add (snippet type)**.
fr: Vous pouvez accéder aux extraits en cliquant sur ** Extraits ** dans la barre latérale. Cliquez sur ** Extraits ** vous emmène à l'interface des extraits. Pour ajouter, modifier ou supprimer un extrait, cliquez sur l'extrait de type qui vous intéresse. En cliquant sur le type d'extrait de l'extrait, vous amène à l'écran d'édition, à partir de laquelle vous pouvez ajouter, modifier ou supprimer un extrait. Survolant un extrait individuel affiche les options pour modifier ou supprimer cet extrait. Pour ajouter un nouvel extrait à l'extrait de type, cliquez sur ** Ajouter (type d'extrait) **.
sw: Unaweza kupata snippets kwa kubonyeza ** snippets ** kwenye pembeni. Kubonyeza ** Snippets ** inakuchukua kwa interface ya Snippets. Kuongeza, hariri, au futa snippet, bonyeza aina ya snippet inayokupendeza. Kubonyeza aina ya snippet hukuchukua kwenye skrini ya hariri, ambayo unaweza kuongeza, kuhariri, au kufuta snippet. Kuweka juu ya snippet ya mtu binafsi huonyesha chaguzi za kuhariri au kufuta snippet hiyo. Ili kuongeza snippet mpya kwa aina ya snippet, bonyeza ** Ongeza (Aina ya Snippet) **.

source: ![Snippet Explorer](../../_static/images/snippets/snippet_explorer.png "Snippet Explorer")
fr: ! [Extrait Explorer] (../../_ Static / Images / Snippets / Snippet_Explorer.png "Snippet Explorer")
sw: ! [Snippet Explorer] (../../_ tuli/picha/snippets/snippet_explorer.png "snippet Explorer")

source: Snippet Explorer
fr: Extrait

source: Editing a snippet changes it on all of the pages on which it appears. In the top-right corner of the Snippet edit screen, you can see a label saying how many times you have used the snippet. Clicking this label displays a listing of all of these pages.
fr: L'édition d'un extrait le modifie sur toutes les pages sur lesquelles il apparaît. Dans le coin supérieur droit de l'écran d'édition de l'extrait, vous pouvez voir un label disant combien de fois vous avez utilisé l'extrait. Cliquez sur cette étiquette affiche une liste de toutes ces pages.
sw: Kuhariri snippet hubadilisha kwenye kurasa zote ambazo inaonekana. Kwenye kona ya juu-kulia ya skrini ya hariri ya snippet, unaweza kuona lebo ukisema ni mara ngapi umetumia snippet. Kubonyeza lebo hii inaonyesha orodha ya kurasa hizi zote.

source: Add snippets while editing a page
fr: Ajouter des extraits lors de la modification d'une page
sw: Ongeza viunzi wakati wa kuhariri ukurasa

source: Open the Snippets interface in a new tab while editing the page by pressing Ctrl+click in Windows or cmd+click in macOS. You can also open a new tab by right-clicking it and then selecting the Open in new tab option. Add the new snippet from this new tab as you normally would. Then return to your existing tab and reopen the Snippet chooser window by clicking Snippets from the Sidebar.
fr: Ouvrez l'interface des extraits dans un nouvel onglet lors de la modification de la page en appuyant sur Ctrl + Cliquez dans Windows ou CMD + Cliquez dans MacOS. Vous pouvez également ouvrir un nouvel onglet en le cliquant avec le bouton droit, puis en sélectionnant l'option Open in New Tab. Ajoutez le nouvel extrait de ce nouvel onglet comme vous le feriez normalement. Revenez ensuite à votre onglet existant et réouverture de la fenêtre de l'Optet Stroner en cliquant sur les extraits de la barre latérale.
sw: Fungua kiufundi cha snippets kwenye tabo mpya wakati wa kuhariri ukurasa kwa kubonyeza Ctrl+bonyeza kwenye Windows au CMD+bonyeza kwenye macOS. Unaweza pia kufungua kichupo kipya kwa kubonyeza kulia na kisha uchague Open katika chaguo mpya la tabo. Ongeza snippet mpya kutoka kwa tabo hii mpya kama kawaida. Kisha rudi kwenye kichupo chako kilichopo na ufungue tena dirisha la kuchagua snippet kwa kubonyeza vijikaratasi kutoka kwa pembeni.

source: Congratulation, you can now see your new snippet, even though you didn’t leave the edit page.
fr: Félicitations, vous pouvez maintenant voir votre nouvel extrait, même si vous n'avez pas quitté la page d'édition.
sw: Hongera, sasa unaweza kuona snippet yako mpya, ingawa haukuacha ukurasa wa hariri.

source: Even though this is possible, it is advisable to save your page as a draft as often as possible. This prevents you from accidentally exiting the edit page and losing your changes.
fr: Même si cela est possible, il est conseillé de sauvegarder votre page en tant que brouillon aussi souvent que possible. Cela vous empêche de quitter accidentellement la page d'édition et de perdre vos modifications.
sw: Hata ingawa hii inawezekana, inashauriwa kuokoa ukurasa wako kama rasimu mara nyingi iwezekanavyo. Hii inakuzuia kutoka kwa bahati mbaya kutoka kwa ukurasa wa hariri na kupoteza mabadiliko yako.

source: Surveys
fr: Relevés
sw: Tafiti

source: Using Surveys
fr: Utilisation de sondages
sw: Kutumia tafiti

source: Surveys allow you to create a dynamic survey forms, create/modify survey structure, display and analyse survey results and save as PDF Document. With the survey editor it is possible to define conditional logic and answer validation for form fields.
fr: Les enquêtes vous permettent de créer des formulaires d'enquête dynamiques, de créer / modifier la structure de l'enquête, d'afficher et d'analyser les résultats de l'enquête et d'enregistrer en tant que document PDF. Avec l'éditeur d'enquête, il est possible de définir la validation de la logique conditionnelle et de la réponse pour les champs de formulaire.
sw: Utafiti hukuruhusu kuunda fomu za uchunguzi zenye nguvu, kuunda/kurekebisha muundo wa uchunguzi, kuonyesha na kuchambua matokeo ya uchunguzi na uhifadhi kama hati ya PDF. Na Mhariri wa Utafiti inawezekana kufafanua mantiki ya masharti na uthibitisho wa jibu kwa uwanja wa fomu.

source: The Survey editor can be accessed from the left side bar under surveys menu.
fr: L'éditeur d'enquête est accessible à partir de la barre gauche dans le menu des enquêtes.
sw: Mhariri wa uchunguzi anaweza kupatikana kutoka kwa bar ya upande wa kushoto chini ya menyu ya Utafiti.

source: ![Survey Explorer](../../_static/images/surveys/survey_explorer.png "Survey Explorer")
fr: ! [Explorer d'enquête] (../../_ statique / images / enquêtes / enquête_explorer.png "Explorer enquête")

source: Survey Explorer
fr: Explorateur d'enquête
sw: Utafiti wa uchunguzi

source: Create Surveys and Panel Types
fr: Créer des enquêtes et des types de panneaux
sw: Unda tafiti na aina za jopo

source: To create a survey, you will need to first add a **survey form page**. You can do this by clicking on the **Add survey from page** button at the top right corner of the of the page.
fr: Pour créer une enquête, vous devrez d'abord ajouter une page de formulaire de levé ** **. Vous pouvez le faire en cliquant sur le bouton ** Ajouter à partir de la page ** dans le coin supérieur droit de la page.
sw: Ili kuunda uchunguzi, utahitaji kwanza kuongeza ukurasa wa fomu ya uchunguzi **. Unaweza kufanya hivyo kwa kubonyeza kwenye ** Ongeza Utafiti kutoka kwa kitufe cha ukurasa ** kwenye kona ya juu ya kulia ya ukurasa.

source: ![Add Survey](../../_static/images/surveys/add_survey_page.png "Add Survey")
fr: ! [Add Survey] (../../_ statique / images / enquêtes / add_survey_page.png "Add Survey")
sw: ! [Ongeza uchunguzi] (../../_ tuli/picha/uchunguzi/add_survey_page.png "ongeza uchunguzi")

source: Add Survey
fr: Ajouter une enquête
sw: Ongeza Utafiti

source: Select a parent page e.g 'Home' and continue to edit the page and supply a Page title. Publish this page. This page will render the form that will be created in the survey creator.
fr: Sélectionnez une page parent, par exemple, «Accueil» et continuez à modifier la page et à fournir un titre de page. Publiez cette page. Cette page rendra le formulaire qui sera créé dans le créateur d'enquête.
sw: Chagua ukurasa wa mzazi e.g 'nyumbani' na endelea kuhariri ukurasa na usambaze kichwa cha ukurasa. Chapisha ukurasa huu. Ukurasa huu utatoa fomu ambayo itaundwa katika Muumbaji wa Utafiti.

source: ![Survey Parent Page](../../_static/images/surveys/survey_parent.png "Survey Parent Page")
fr: ! [Page parentale de l'enquête] (../../_ statique / images / enquêtes / enquête_parent.png "Page parentale de sondage")

source: Survey Parent Page
fr: Page parentale enquête
sw: Utafiti wa ukurasa wa mzazi

source: ![Survey Page](../../_static/images/surveys/survey_page.png "Survey Page")
fr: ! [Page d'enquête] (../../_ statique / images / enquêtes / enquête_page.png "Page d'enquête")
sw: ! [Ukurasa wa uchunguzi] (../../_ tuli/picha/uchunguzi/uchunguzi_page.png "ukurasa wa uchunguzi"))

source: Survey Page
fr: Page d'enquête
sw: Ukurasa wa utafiti

source: Navigate to the Survey creator to create form fields and their logic using the **Survey Creator** button. | ![Surveys](../../_static/images/surveys/surveys.png "Surveys")
fr: Accédez au créateur d'enquête pour créer des champs de formulaire et leur logique à l'aide du bouton ** Créateur d'enquête **. | ! [Enquêtes] (../../_ statique / images / enquêtes / enquêtes.png "enquêtes")
sw: Nenda kwa muundaji wa uchunguzi ili kuunda uwanja wa fomu na mantiki yao kwa kutumia kitufe cha ** SURVER **. | ! [Tafiti] (../../_ tuli/picha/uchunguzi/uchunguzi.png "uchunguzi"))

source: The Survey Creator
fr: Le créateur d'enquête
sw: Muumbaji wa Utafiti

source: This section describes how to perfom basic tasks in the Survey Creator. There are currently two tabs in the creator i.e Designer and Preview tab.
fr: Cette section décrit comment perforter les tâches de base dans le créateur d'enquête. Il y a actuellement deux onglets dans le créateur, c'est-à-dire le concepteur et l'onglet Aperçu.
sw: Sehemu hii inaelezea jinsi ya kufanya kazi za msingi katika muundaji wa uchunguzi. Hivi sasa kuna tabo mbili kwenye Mbuni wa Muumba i.e na kichupo cha hakiki.

source: ![Survey Creator](../../_static/images/surveys/survey_creator.png "Survey Creator")
fr: ! [Créateur d'enquête] (../../_ statique / images / enquêtes / enquête_creator.png "Créateur d'enquête")

source: Survey Creator
fr: Créateur d'enquête
sw: Muumbaji wa Utafiti

source: Designer Tab
fr: Onglet Designer
sw: Kichupo cha Mbuni

source: By using the Designer tab, you have the ability to customize your survey. You can move questions and panels from the **Toolbox** onto the **Design Surface** through drag and drop, and modify the question, panel, and survey settings using the **Property Grid**.
fr: En utilisant l'onglet Designer, vous avez la possibilité de personnaliser votre enquête. Vous pouvez déplacer des questions et des panneaux à partir de la ** Toolbox ** sur la ** Surface de conception ** à travers la glisser-déposer, et modifier les paramètres de question, de panneau et d'enquête à l'aide de la grille de propriété ** **.
sw: Kwa kutumia kichupo cha Mbuni, una uwezo wa kubadilisha utafiti wako. Unaweza kusonga maswali na paneli kutoka kwa sanduku la zana ** kwenye uso wa kubuni ** kupitia Drag na kushuka, na urekebishe swali, jopo, na mipangilio ya uchunguzi kwa kutumia gridi ya mali **.

source: Question and Panel Types
fr: Types de questions et de panneaux
sw: Aina ya swali na jopo

source: Type
fr: Taper
sw: Aina

source: **Single Input**
fr: ** Entrée unique **
sw: ** pembejeo moja **

source: For open-ended questions that necessitate brief responses, employ the Single Input type where respondents can input their answers using a single-line text editor.
fr: Pour les questions ouvertes qui nécessitent de brèves réponses, utilisez le type d'entrée unique où les répondants peuvent saisir leurs réponses à l'aide d'un éditeur de texte à une seule ligne.
sw: Kwa maswali yaliyomalizika ambayo yanahitaji majibu mafupi, kuajiri aina moja ya pembejeo ambapo washiriki wanaweza kuingiza majibu yao kwa kutumia mhariri wa maandishi ya safu moja.

source: ![Single Input](../../_static/images/surveys/question-types-single-input.png "Single Input")
fr: ! [Entrée unique] (../../_ statique / images / enquêtes / questions-types-single-input.png "entrée unique")

source: Single Input
fr: Entrée unique
sw: Pembejeo moja

source: **Checkbox**
fr: ** BOID BOX **

source: For questions that allow for multiple answers, utilize the Checkbox type where respondents can choose one or more options by clicking on the corresponding checkboxes.
fr: Pour les questions qui permettent plusieurs réponses, utilisez le type de case à cocher où les répondants peuvent choisir une ou plusieurs options en cliquant sur les cases à cocher correspondantes.
sw: Kwa maswali ambayo yanaruhusu majibu mengi, tumia aina ya kisanduku ambapo washiriki wanaweza kuchagua chaguzi moja au zaidi kwa kubonyeza kwenye sanduku za ukaguzi zinazolingana.

source: ![Checkbox](../../_static/images/surveys/question-types-checkbox.png "Checkbox")
fr: ! [Checkbox] (../../_ statique / images / enquêtes / question-type-checkbox.png "Checkbox")
sw: ! [Checkbox] (../../_ tuli/picha/uchunguzi/maswali-aina-checkbox.png "sanduku la cheki"))

source: Checkbox
fr: Cocher
sw: Sanduku la kuangalia

source: For questions that offer several options but allow only one response, use the Radiogroup type where respondents can select a single answer by clicking on one of the radio buttons.
fr: Pour les questions qui offrent plusieurs options mais n'autorisez qu'une seule réponse, utilisez le type de radiogroup où les répondants peuvent sélectionner une seule réponse en cliquant sur l'un des boutons radio.
sw: Kwa maswali ambayo hutoa chaguzi kadhaa lakini huruhusu majibu moja tu, tumia aina ya RadioGroup ambapo washiriki wanaweza kuchagua jibu moja kwa kubonyeza kwenye moja ya vifungo vya redio.

source: ![Radiogroup](../../_static/images/surveys/question-types-radiogroup.png "Radiogroup")
fr: ! [Radiogroup] (../../_ statique / images / enquêtes / question-type-radiogroupe.png "radiogroup")

source: **Dropdown**
fr: **Dérouler**
sw: ** kushuka **

source: In the Dropdown type, respondents can choose a single answer from a list of options displayed in a drop-down menu. Similar to Radiogroup, this type is suitable for questions that have multiple options but require only one answer. The Dropdown UI can also show more options while using less screen space.
fr: Dans le type déroulant, les répondants peuvent choisir une seule réponse à partir d'une liste d'options affichées dans un menu déroulant. Semblable à Radiogroup, ce type convient aux questions qui ont plusieurs options mais qui ne nécessitent qu'une seule réponse. L'interface utilisateur déroulant peut également afficher plus d'options tout en utilisant moins d'espace d'écran.
sw: Katika aina ya kushuka, waliohojiwa wanaweza kuchagua jibu moja kutoka kwa orodha ya chaguzi zilizoonyeshwa kwenye menyu ya kushuka. Sawa na RadioGroup, aina hii inafaa kwa maswali ambayo yana chaguzi nyingi lakini yanahitaji jibu moja tu. UI ya kushuka pia inaweza kuonyesha chaguzi zaidi wakati wa kutumia nafasi ndogo ya skrini.

source: ![Dropdown](../../_static/images/surveys/question-types-dropdown.png "Dropdown")
fr: ! [Dropdown] (../../_ statique / images / enquêtes / questions-types-dropdown.png "Dropdown")

source: Dropdown
fr: Dérouler
sw: Kushuka

source: **Comment**
fr: **Commentaire**
sw: ** Maoni **

source: For open-ended questions that require respondents to provide lengthy answers, use the Comment type where respondents can input their responses in a resizable multi-line text area. This type is suitable for questions that accept multi-line answers.
fr: Pour les questions ouvertes qui obligent les répondants à fournir de longues réponses, utilisez le type de commentaire où les répondants peuvent saisir leurs réponses dans une zone de texte multi-ligne redonnable. Ce type convient aux questions qui acceptent les réponses multi-lignes.
sw: Kwa maswali yaliyofunguliwa ambayo yanahitaji waliohojiwa kutoa majibu marefu, tumia aina ya maoni ambapo washiriki wanaweza kuingiza majibu yao katika eneo la maandishi ya safu nyingi. Aina hii inafaa kwa maswali ambayo yanakubali majibu ya safu-nyingi.

source: ![Comment](../../_static/images/surveys/question-types-comment.png "Comment")
fr: ! [Comment] (../../_ statique / images / enquêtes / question-type-comment.png "comment")

source: Comment
fr: Commentaire
sw: Maoni

source: **Rating**
fr: **Notation**
sw: ** Ukadiriaji **

source: When you want respondents to provide a rating, use the Rating type where they can select a single number from within a specified range. This type is appropriate for questions that require a rating response.
fr: Lorsque vous souhaitez que les répondants fournissent une note, utilisez le type de notation où ils peuvent sélectionner un seul numéro à partir d'une plage spécifiée. Ce type convient aux questions qui nécessitent une réponse de notation.
sw: Wakati unataka wahojiwa kutoa rating, tumia aina ya ukadiriaji ambapo wanaweza kuchagua nambari moja kutoka kwa safu maalum. Aina hii inafaa kwa maswali ambayo yanahitaji majibu ya ukadiriaji.

source: ![Rating](../../_static/images/surveys/question-types-rating.png "Rating")
fr: ! [Note] (../../_ statique / images / enquêtes / questions-types-rating.png "note")

source: Rating
fr: Notation
sw: Ukadiriaji

source: **Ranking**
fr: **Classement**
sw: ** nafasi **

source: The Ranking type is suitable for questions where respondents need to establish the order of items. This type allows respondents to drag and drop items from a list to rearrange them based on rank or preference.
fr: Le type de classement convient aux questions où les répondants doivent établir l'ordre des articles. Ce type permet aux répondants de faire glisser et déposer des éléments d'une liste pour les réorganiser en fonction du rang ou de la préférence.
sw: Aina ya kiwango inafaa kwa maswali ambapo washiriki wanahitaji kuanzisha mpangilio wa vitu. Aina hii inaruhusu waliohojiwa kuvuta na kuacha vitu kutoka kwenye orodha ili kuzipanga tena kulingana na kiwango au upendeleo.

source: ![Ranking](../../_static/images/surveys/question-types-ranking.png "Ranking")
fr: ! [Classement] (../../_ statique / images / enquêtes / questions-types-ranking.png "classement")

source: Ranking
fr: Classement
sw: Nafasi

source: **Image Picker**
fr: ** Picker d'image **
sw: ** Picha ya Picker **

source: In a survey question where respondents are required to select one or several images or videos from a series, a value associated with the chosen image or video is saved to the survey results.
fr: Dans une question d'enquête où les répondants sont tenus de sélectionner une ou plusieurs images ou vidéos dans une série, une valeur associée à l'image ou à la vidéo choisie est enregistrée aux résultats de l'enquête.
sw: Katika swali la uchunguzi ambapo waliohojiwa wanahitajika kuchagua picha moja au video kadhaa kutoka kwa safu, thamani inayohusishwa na picha iliyochaguliwa au video imehifadhiwa kwa matokeo ya uchunguzi.

source: ![Image Picker](../../_static/images/surveys/question-types-imagepicker.png "Image Picker")
fr: ! [Picker d'image] (../../_ statique / images / enquêtes / question-type-imagepicker.png "Picker d'image")

source: Image Picker
fr: Cueilleur d'image
sw: Picha ya picha

source: **Boolean**
fr: ** booléen **

source: When using a Boolean editor, respondents can switch between Yes or No to provide their response. The survey results will record the response as true for Yes or false for No.
fr: Lorsque vous utilisez un éditeur booléen, les répondants peuvent basculer entre oui ou non pour fournir leur réponse. Les résultats de l'enquête enregistreront la réponse comme vraie pour oui ou false pour No.
sw: Wakati wa kutumia hariri ya Boolean, washiriki wanaweza kubadili kati ya ndio au hapana kutoa majibu yao. Matokeo ya utafiti yatarekodi majibu kuwa ya kweli kwa ndiyo au uwongo kwa Hapana.

source: ![Boolean](../../_static/images/surveys/question-types-boolean.png "Boolean")
fr: ! [Booléen] (../../_ statique / images / enquêtes / questions-types-boolean.png "boolean")

source: Boolean
fr: Booléen

source: **Signature Pad**
fr: ** Pad de signature **
sw: ** saini pedi **

source: To capture a respondent's signature or any other hand-drawn input, use a type that allows respondents to draw their signature using mouse or touch gestures within a designated input area.
fr: Pour capturer la signature d'un répondant ou toute autre entrée dessinée à la main, utilisez un type qui permet aux répondants de dessiner sa signature à l'aide de gestes de souris ou de toucher dans une zone d'entrée désignée.
sw: Ili kukamata saini ya mhojiwa au pembejeo nyingine yoyote inayotolewa kwa mkono, tumia aina ambayo inaruhusu washiriki kuteka saini yao kwa kutumia panya au ishara za kugusa ndani ya eneo la pembejeo lililotengwa.

source: ![Signature Pad](../../_static/images/surveys/question-types-signature-pad.png "Signature Pad")
fr: ! [Pad de signature] (../../_ statique / images / enquêtes / questions-types-signature-pad.png "Signature Pad")
sw: ! [Saini pedi] (../../_ tuli/picha/uchunguzi/aina-ishara-ishara-pad.png "saini ya saini"))

source: Signature Pad
fr: Coussin de signature
sw: Saini pedi
