Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: Find Your Way Around
fr: Trouvez votre chemin
sw: Tafuta njia yako kuzunguka

source: This section describes the different pages that you are going to see as you navigate around the NMHS Content Management System Admin interface.
fr: Cette section décrit les différentes pages que vous allez voir lorsque vous naviguez dans l'interface d'administration du système de gestion de contenu NMHS.
sw: Sehemu hii inaelezea kurasa tofauti ambazo utaona unapozunguka kigeuzi cha mfumo wa usimamizi wa maudhui ya NMHS.

source: How to reach the Dashboard
fr: Comment atteindre le tableau de bord
sw: Jinsi ya kufikia dashibodi

source: The ClimWeb login button can be found at the top left corner of the website.
fr: Le bouton de connexion Clipweb se trouve dans le coin supérieur gauche du site Web.
sw: Kitufe cha kuingia cha Clipweb kinaweza kupatikana kwenye kona ya juu ya kushoto ya wavuti.

source: ![Access Dashboard](../_static/images/navigating/access_dashboard_1.png "Access Dashboard")
fr: ! [Access Dashboard] (../_ static / images / navigation / access_dashboard_1.png "Access Dashboard")

source: Access Dashboard
fr: Tableau de bord d'accès
sw: Fikia Dashibodi

source: Logging into the ClimWeb automatically takes you to the Dashboard. If you navigate away from the dashboard, you can return to it at any time by clicking on the NMHS logo in the top-left section of your screen.
fr: L'enregistrement à l'escalade vous emmène automatiquement au tableau de bord. Si vous naviguez loin du tableau de bord, vous pouvez y retourner à tout moment en cliquant sur le logo NMHS dans la section supérieure gauche de votre écran.
sw: Kuingia ndani ya kupanda moja kwa moja hukuchukua kwenye dashibodi. Ikiwa utatoka mbali na dashibodi, unaweza kurudi kwake wakati wowote kwa kubonyeza nembo ya NMHS kwenye sehemu ya kushoto ya skrini yako.

source: The Dashboard
fr: Le tableau de bord
sw: Dashibodi

source: The Dashboard is the main hub of the website. From the dashboard, you can access all of the content you create in the ClimWeb as well as reports, settings, and other content management features.
fr: Le tableau de bord est le centre principal du site Web. À partir du tableau de bord, vous pouvez accéder à tous les contenus que vous créez dans le climail ainsi que des rapports, des paramètres et d'autres fonctionnalités de gestion de contenu.
sw: Dashibodi ndio kitovu kuu cha wavuti. Kutoka kwa dashibodi, unaweza kufikia yaliyomo yote unayounda kwenye Clipweb na ripoti, mipangilio, na huduma zingine za usimamizi wa yaliyomo.

source: ![Dashboard](../_static/images/navigating/Dashboard_1.png "Dashboard")
fr: ! [Tableau de bord] (../_ statique / images / navigation / tableau de bord_1.png "tableau de bord")
sw: ! [Dashibodi] (../_ tuli/picha/navigating/dashibodi_1.png "dashibodi")

source: Dashboard
fr: Tableau de bord
sw: Dashibodi

source: What you see in your Dashboard depends on your user role. Common user roles include editors, moderators, composers, approvers, forecasters and administrators.
fr: Ce que vous voyez dans votre tableau de bord dépend de votre rôle d'utilisateur. Les rôles utilisateur communs incluent les éditeurs, les modérateurs, les compositeurs, les approbateurs, les prévisionnistes et les administrateurs.
sw: Kile unachokiona kwenye dashibodi yako inategemea jukumu lako la mtumiaji. Majukumu ya kawaida ya watumiaji ni pamoja na wahariri, wasimamizi, watunzi, idhini, watabiri na wasimamizi.

source: The following are some of the tools that you can find within the Dashboard:
fr: Voici quelques-uns des outils que vous pouvez trouver dans le tableau de bord:
sw: Ifuatayo ni zana zingine ambazo unaweza kupata ndani ya dashibodi:

source: The Dashboard Panels
fr: Les panneaux de tableau de bord
sw: Paneli za dashibodi

source: The dashboard panels provide you with an overview of the various states of your pages.
fr: Les panneaux de tableau de bord vous offrent un aperçu des différents états de vos pages.
sw: Paneli za dashibodi hukupa muhtasari wa majimbo anuwai ya kurasa zako.

source: The different panels on your dashboard are as follows:
fr: Les différents panneaux de votre tableau de bord sont les suivants:
sw: Paneli tofauti kwenye dashibodi yako ni kama ifuatavyo:

source: **1. Your pages in a workflow**
fr: ** 1. Vos pages dans un flux de travail **
sw: ** 1. Kurasa zako katika mtiririko wa kazi **

source: The Your pages in a workflow panel shows you any pages in moderation that you own or have submitted for moderation yourself. It also shows the moderation tasks that are pending and how long the tasks have been open.
fr: Les pages dans un panneau de workflow vous montrent toutes les pages avec modération que vous possédez ou soumises pour modération vous-même. Il montre également les tâches de modération en attente et combien de temps les tâches ont été ouvertes.
sw: Kurasa zako kwenye paneli ya kazi inakuonyesha kurasa zozote kwa kiasi ambazo unamiliki au umewasilisha kwa wastani mwenyewe. Inaonyesha pia kazi za wastani ambazo zinasubiri na kazi zimefunguliwa kwa muda gani.

source: **2. Awaiting your review**
fr: ** 2. En attente de votre avis **
sw: ** 2. Unasubiri ukaguzi wako **

source: If your webmaster or web developer gives you permission to perform moderation actions, your Wagtail dashboard displays the Awaiting your review panel. This panel shows content that's ready for you to review.
fr: Si votre webmaster ou développeur Web vous permet d'effectuer des actions de modération, votre tableau de bord en bergeron affiche l'attente de votre panneau de révision. Ce panneau affiche un contenu prêt à réviser.
sw: Ikiwa msimamizi wako wa wavuti au msanidi programu wa wavuti hukupa ruhusa ya kufanya vitendo vya wastani, dashibodi yako ya Wagtail inaonyesha paneli yako ya kukagua. Jopo hili linaonyesha yaliyomo tayari kwako kukagua.

source: From the panel, you can perform the following actions:
fr: Dans le panneau, vous pouvez effectuer les actions suivantes:
sw: Kutoka kwa jopo, unaweza kufanya vitendo vifuatavyo:

source: Click the name of a page to edit that page. Use the buttons to move the page to the next stage in your workflow by requesting changes to a page, approving the page, or approving the page with a comment. Get a quick view of the page status by hovering over the indicator circles to get more information about the pending task. The indicator circles show a tick for a completed task or an empty circle for an incomplete one. See how long a page has been waiting for review. Your most recent edits The Your most recent edits panel displays the five pages you last edited.
fr: Cliquez sur le nom d'une page pour modifier cette page. Utilisez les boutons pour déplacer la page vers l'étape suivante de votre workflow en demandant des modifications à une page, en approuvant la page ou en approuvant la page avec un commentaire. Obtenez une vue rapide de l'état de la page en survolant les cercles d'indicateur pour obtenir plus d'informations sur la tâche en attente. Les cercles indicateurs montrent une coche pour une tâche terminée ou un cercle vide pour un cercle incomplet. Voyez combien de temps une page attend une révision. Vos modifications les plus récentes Le panneau de modifications les plus récent affiche les cinq pages que vous avez modifiées pour la dernière fois.
sw: Bonyeza jina la ukurasa kuhariri ukurasa huo. Tumia vifungo kusonga ukurasa kwa hatua inayofuata katika mtiririko wako wa kazi kwa kuomba mabadiliko kwenye ukurasa, kupitisha ukurasa, au kupitisha ukurasa huo na maoni. Pata maoni ya haraka ya hali ya ukurasa kwa kusonga juu ya miduara ya kiashiria kupata habari zaidi juu ya kazi inayosubiri. Duru za kiashiria zinaonyesha tick kwa kazi iliyokamilishwa au duara tupu kwa moja kamili. Tazama ukurasa umekuwa ukisubiri kukaguliwa kwa muda gani. Mabadiliko yako ya hivi karibuni Jopo lako la Mabadiliko ya hivi karibuni linaonyesha kurasa tano ulizohariri mwisho.

source: The panel also shows the date that you last edited the pages as well as the current status of the pages.
fr: Le panneau affiche également la date à laquelle vous avez édité les pages pour la dernière fois ainsi que l'état actuel des pages.
sw: Jopo pia linaonyesha tarehe ambayo ulihariri kurasa hizo na hali ya sasa ya kurasa.

source: **3. Your locked pages**
fr: ** 3. Vos pages verrouillées **
sw: ** 3. Kurasa zako zilizofungwa **

source: The Your locked pages panel shows all of the pages you've locked so that only you can edit them. From this panel, you can quickly view the date you locked a page. To edit a locked page, click the name.
fr: Le panneau de pages verrouillé affiche toutes les pages que vous avez verrouillées afin que vous ne puissiez les modifier. À partir de ce panneau, vous pouvez rapidement afficher la date de verrouillage d'une page. Pour modifier une page verrouillée, cliquez sur le nom.
sw: Jopo lako lililofungwa linaonyesha kurasa zote ambazo umefunga ili tu uweze kuzibadilisha. Kutoka kwa jopo hili, unaweza kuona haraka tarehe uliyofunga ukurasa. Ili kuhariri ukurasa uliofungwa, bonyeza jina.

source: The Sidebar
fr: La barre latérale
sw: Pembeni

source: On the left-hand side of the dashboard and throughout the ClimWeb is a menu called the Sidebar. You can use the Sidebar to navigate to different parts of the ClimWeb.
fr: Sur le côté gauche du tableau de bord et tout au long de l'escalade se trouve un menu appelé la barre latérale. Vous pouvez utiliser la barre latérale pour naviguer vers différentes parties de l'escalade.
sw: Kwenye upande wa kushoto wa dashibodi na kwa njia yote ya kupanda ni menyu inayoitwa Sidebar. Unaweza kutumia pembeni kwenda kwenye sehemu tofauti za Clipweb.

source: The Sidebar helps you quickly access your content as well as ClimWeb features and settings. The items on the Sidebar can vary depending on what you have access to. These features include Search, Documents, Snippets, Forms, Reports, Settings, and Help.
fr: La barre latérale vous aide à accéder rapidement à votre contenu ainsi qu'à des fonctionnalités et à des paramètres. Les articles de la barre latérale peuvent varier en fonction de ce à quoi vous avez accès. Ces fonctionnalités incluent la recherche, les documents, les extraits, les formulaires, les rapports, les paramètres et l'aide.
sw: Upinde wa pembeni hukusaidia kupata haraka yaliyomo yako na huduma na mipangilio ya ClinWeb. Vitu kwenye kando ya pembeni vinaweza kutofautiana kulingana na kile unachoweza kupata. Vipengele hivi ni pamoja na utaftaji, hati, viunzi, fomu, ripoti, mipangilio, na msaada.

source: If you want the Sidebar to take up less space, you can click the white arrow near the top of the Sidebar to switch it into slim mode and give yourself more space for writing.
fr: Si vous voulez que la barre latérale prenne moins d'espace, vous pouvez cliquer sur la flèche blanche près du haut de la barre latérale pour la transformer en mode mince et vous donner plus d'espace pour l'écriture.
sw: Ikiwa unataka kando ya pembeni ichukue nafasi kidogo, unaweza kubonyeza mshale mweupe karibu na kilele cha pembeni ili kuibadilisha kuwa hali ndogo na ujipe nafasi zaidi ya kuandika.

source: The Explorer Page
fr: La page Explorer
sw: Ukurasa wa Explorer

source: The Explorer page allows you to view a page’s children and perform actions on them. On the Explorer page, you can publish and unpublish pages. You can also move the pages to other sections, drill down into the content tree, or reorder child pages within a parent.
fr: La page Explorer vous permet de visualiser les enfants d'une page et d'effectuer des actions sur eux. Sur la page Explorer, vous pouvez publier des pages et non publiés. Vous pouvez également déplacer les pages vers d'autres sections, explorer l'arbre de contenu ou réorganiser les pages enfants au sein d'un parent.
sw: Ukurasa wa Explorer hukuruhusu kutazama watoto wa ukurasa na kufanya vitendo juu yao. Kwenye ukurasa wa Explorer, unaweza kuchapisha na kuchapisha kurasa. Unaweza pia kuhamisha kurasa hizo kwa sehemu zingine, kuchimba chini kwenye mti wa yaliyomo, au kupanga upya kurasa za watoto ndani ya mzazi.

source: You can see the name of the page whose Explorer page you are on as a heading at the top of the screen. If the page has child pages within it, then you can see a list displaying the child pages below the heading. Clicking the title of a child page takes you to the edit screen, from which you can edit that child page.
fr: Vous pouvez voir le nom de la page dont la page Explorer vous vous trouvez en tête en haut de l'écran. Si la page contient des pages d'enfants à l'intérieur, vous pouvez voir une liste affichant les pages enfants sous l'en-tête. En cliquant sur le titre d'une page enfant, vous amène à l'écran d'édition, à partir de laquelle vous pouvez modifier cette page enfant.
sw: Unaweza kuona jina la ukurasa ambao ukurasa wake wa Explorer uko kama kichwa juu ya skrini. Ikiwa ukurasa una kurasa za watoto ndani yake, basi unaweza kuona orodha inayoonyesha kurasa za watoto chini ya kichwa. Kubonyeza kichwa cha ukurasa wa watoto hukuchukua kwenye skrini ya hariri, ambayo unaweza kuhariri ukurasa huo wa mtoto.

source: If you hover over a child page, you get an arrow on the right-hand side of that child page row. Clicking the arrow displays a further level of child pages.
fr: Si vous survolez une page enfant, vous obtenez une flèche sur le côté droit de cette ligne de page enfant. Cliquez sur la flèche affiche un autre niveau de pages enfants.
sw: Ikiwa unasonga juu ya ukurasa wa mtoto, unapata mshale upande wa kulia wa safu hiyo ya ukurasa wa watoto. Kubonyeza mshale unaonyesha kiwango zaidi cha kurasa za watoto.

source: ![Explorer](../_static/images/navigating/Explorer_page_1.png "Explorer")
fr: ! [Explorer] (../_ statique / images / navigation / explorateur_page_1.png "explorateur")
sw: ! [Explorer] (../_ tuli/picha/kuzunguka

source: Explorer
fr: Explorateur
sw: Mchunguzi

source: Additionally, hovering over a child page displays a checkbox at the left-hand side of the child page row. Selecting one or more child pages by clicking their checkboxes gives you an action bar at the bottom of the Explorer page. Clicking on any of the options in the action bar takes you to a confirmation page from which you can confirm the action.
fr: De plus, le survol d'une page d'enfant affiche une case à cocher sur le côté gauche de la ligne de la page de l'enfant. La sélection d'une ou plusieurs pages enfants en cliquant sur leurs cases vous donne une barre d'action en bas de la page Explorer. En cliquant sur l'une des options de la barre d'action vous amène à une page de confirmation à partir de laquelle vous pouvez confirmer l'action.
sw: Kwa kuongeza, kusonga juu ya ukurasa wa watoto kunaonyesha kisanduku cha upande wa kushoto wa safu ya ukurasa wa watoto. Chagua kurasa moja au zaidi ya watoto kwa kubonyeza sanduku zao za ukaguzi hukupa bar ya hatua chini ya ukurasa wa Explorer. Kubonyeza juu ya chaguzi zozote kwenye Baa ya Action hukuchukua kwenye ukurasa wa uthibitisho ambao unaweza kudhibitisha hatua hiyo.

source: ![Child pages](../_static/images/navigating/child_pages.png "Child pages")
fr: ! [Pages enfants] (../_ statique / images / navigation / child_pages.png "pages enfants")
sw: ! [Kurasa za watoto] (../_ tuli/picha/kuzunguka/watoto_pages.png "kurasa za watoto"))

source: Child pages
fr: Pages d'enfants
sw: Kurasa za watoto

source: As you drill down through the site, the breadcrumb (the row of pages beginning with the home icon) displays the path you have taken. Clicking on the page titles in the breadcrumb takes you to the Explorer screen for that page.
fr: Lorsque vous percez le site, la chapelure (la rangée de pages commençant par l'icône de la maison) affiche le chemin que vous avez emprunté. En cliquant sur les titres de la page dans la chapelure vous emmène à l'écran de l'explorateur pour cette page.
sw: Unapokuwa ukiteleza kupitia wavuti, mkate wa mkate (safu ya kurasa zinazoanza na ikoni ya nyumbani) inaonyesha njia ambayo umechukua. Kubonyeza kwenye majina ya ukurasa kwenye mkate wa mkate hukuchukua kwenye skrini ya Explorer kwa ukurasa huo.

source: ![Breadcrumb](../_static/images/navigating/breadcrumb.png "Breadcrumb")
fr: ! [Breadcrumb] (../_ statique / images / navigation / pain de pain.png "pain")

source: Breadcrumb
fr: Chapelure
sw: Mkate wa mkate

source: Clicking on the … Actions dropdown shows a list of actions for the parent page, like Move, Copy, Delete, Unpublish, and History. Also, clicking the Sort menu order option from the dropdown takes you to the ordering page.
fr: Cliquez sur la liste déroulante… Actions affiche une liste d'actions pour la page parent, comme Move, Copy, Delete, Unpublish et History. En outre, en cliquant sur l'option Ordre Tri Menu dans la liste déroulante vous amène à la page de commande.
sw: Kubonyeza juu ya… kushuka kwa vitendo kunaonyesha orodha ya vitendo kwa ukurasa wa mzazi, kama hoja, nakala, futa, uchapishaji, na historia. Pia, kubonyeza chaguo la mpangilio wa menyu ya aina kutoka kwa kushuka hukuchukua kwa ukurasa wa kuagiza.

source: ![Actions](../_static/images/navigating/actions_page.png "Actions")
fr: ! [Actions] (../_ statique / images / navigation / actions_page.png "actions")

source: Actions
fr: Actes
sw: Vitendo

source: Search the ClimWeb
fr: Recherchez le monte
sw: Tafuta Clipweb

source: The search feature is the topmost feature in the Sidebar. You can use the search feature to quickly search for content in the ClimWeb.
fr: La fonction de recherche est la fonction la plus supérieure dans la barre latérale. Vous pouvez utiliser la fonction de recherche pour rechercher rapidement du contenu dans le climatiseur.
sw: Kipengele cha utaftaji ni sehemu ya juu kabisa kwenye upau wa pembeni. Unaweza kutumia kipengee cha utaftaji kutafuta haraka yaliyomo kwenye Clipweb.

source: ![Search](../_static/images/navigating/search.png "Search")
fr: ! [Search] (../_ static / images / navigation / search.png "search")
sw: ! [Tafuta] (../_ tuli/picha/kuzunguka/utaftaji.png "tafuta"))

source: Search
fr: Recherche
sw: Tafuta

source: Frequently Asked Questions (FAQs)
fr: Questions fréquemment posées (FAQ)
sw: Maswali yanayoulizwa mara kwa mara (FAQs)

source: **1. What technologies is the ClimWeb Built on?**
fr: ** 1. Sur sur quelles technologies l'escalade est-elle construite? **
sw: ** 1. Je! Ni teknolojia gani imejengwa juu ya? **

source: The ClimWeb, along with its various components, is **completely open-source** and developed on the [WMO RAF GitHub account](https://github.com/orgs/wmo-raf). This implies that the institution will have **unrestricted access to the source code**, allowing them to identify and report any bugs, request new features, and even actively contribute to the development of the codebase. This open approach encourages collaboration and fosters a sense of ownership and involvement within the institution.
fr: Le Clipweb, ainsi que ses différents composants, est ** complètement open-source ** et développé sur le [compte WMO RAF GitHub] (https://github.com/orgs/wmo-raf). Cela implique que l'institution aura ** un accès sans restriction au code source **, leur permettant d'identifier et de signaler tout bogue, de demander de nouvelles fonctionnalités et même de contribuer activement au développement de la base de code. Cette approche ouverte encourage la collaboration et favorise un sentiment d'appartenance et d'implication au sein de l'institution.
sw: Clipweb, pamoja na vifaa vyake anuwai, ni ** wazi kabisa-chanzo ** na imeundwa kwenye akaunti ya [WMO RAF GitHub] (https://github.com/orgs/wmo-raf). Hii inamaanisha kuwa taasisi hiyo itakuwa na ufikiaji usiozuiliwa wa nambari ya chanzo **, ikiruhusu kutambua na kuripoti mende wowote, kuomba huduma mpya, na hata kuchangia kikamilifu katika maendeleo ya codebase. Njia hii ya wazi inahimiza kushirikiana na inakuza hali ya umiliki na ushiriki ndani ya taasisi.

source: **2. Who will manage the ClimWeb Content?**
fr: ** 2. Qui gérera le contenu de l'entraînement? **
sw: ** 2. Ni nani atakayesimamia yaliyomo? **

source: The **NMHS installing the ClimWeb and its components will be fully responsible** for inputting and managing the content that goes into the ClimWeb, from their side. This means that they take the instance of the code and run it, without anyone else having access to the operational instance, unless authorized to do so.
fr: Les ** NMHS installant le climail et ses composants seront entièrement responsables ** pour la saisie et la gestion du contenu qui entre dans le climail, de leur côté. Cela signifie qu'ils prennent l'instance du code et l'exécutent, sans que personne d'autre n'ait accès à l'instance opérationnelle, sauf s'il est autorisé à le faire.
sw: ** NMHS kusanikisha ClimWeb na vifaa vyake vitawajibika kikamilifu ** kwa kuingiza na kusimamia yaliyomo ambayo huenda kwenye kupanda, kutoka upande wao. Hii inamaanisha kwamba wanachukua mfano wa nambari na kuiendesha, bila mtu mwingine yeyote kupata mfano wa utendaji, isipokuwa kama ameidhinishwa kufanya hivyo.

source: **3. What if an NMHS already has a website?**
fr: ** 3. Et si un NMHS a déjà un site Web? **
sw: ** 3. Je! Ikiwa NMHS tayari ina wavuti? **

source: In cases where an NMHS already has an existing website but is interested in testing the new ClimWeb, they have the option to install and run it **concurrently with their existing system** for a specific duration. This allows them to thoroughly evaluate and experience the functionalities offered by the new ClimWeb. Once the NMHS is satisfied and comfortable with the new ClimWeb, a phased approach can be adopted to gradually transition and fully migrate their website to the new ClimWeb. This ensures a smooth and well-managed transition process.
fr: Dans les cas où un NMHS a déjà un site Web existant mais souhaite tester le nouveau climail, il a la possibilité d'installer et de l'exécuter ** simultanément avec leur système existant ** pour une durée spécifique. Cela leur permet d'évaluer et de vivre en profondeur les fonctionnalités offertes par le nouveau climail. Une fois que le NMHS est satisfait et à l'aise avec le nouveau climnement, une approche progressive peut être adoptée pour transmettre progressivement et migrer pleinement leur site Web vers le nouveau climatiseur. Cela garantit un processus de transition fluide et bien géré.
sw: Katika hali ambapo NMHS tayari ina wavuti iliyopo lakini inavutiwa na kupima ClimWeb mpya, wanayo chaguo la kusanikisha na kuiendesha ** wakati huo huo na mfumo wao uliopo ** kwa muda maalum. Hii inawaruhusu kutathmini kabisa na uzoefu wa utendaji unaotolewa na ClimWeb mpya. Mara tu NMHS ikiwa imeridhika na vizuri na Clipweb mpya, mbinu iliyowekwa inaweza kupitishwa kwa hatua kwa hatua na kuhamia kikamilifu tovuti yao kwa Clipweb mpya. Hii inahakikisha mchakato laini na unaosimamiwa vizuri.

source: **4. What does ‘ClimWeb’ mean?**
fr: ** 4. Que signifie «Clipweb»? **
sw: ** 4. Je! 'Climweb' inamaanisha nini? **

source: The term ‘ClimWeb’, as used in this document, refers to **all the components** working together to have a running website, more especially on managing the website content. Read more about the ClimWeb Key functionalities https://github.com/wmo-raf/nmhs-cms/wiki
fr: Le terme «montée», utilisé dans ce document, fait référence à ** tous les composants ** travaillant ensemble pour avoir un site Web en cours d'exécution, plus particulièrement sur la gestion du contenu du site Web. En savoir plus sur les fonctionnalités clés de l'ascension https://github.com/wmo-raf/nmhs-cms/wiki
sw: Neno 'ClimWeb', kama inavyotumika katika hati hii, linamaanisha ** vifaa vyote ** vinafanya kazi kwa pamoja kuwa na wavuti inayoendesha, haswa juu ya kusimamia yaliyomo kwenye wavuti. Soma zaidi juu ya kazi muhimu za Clipweb https://github.com/wmo-raf/nmhs-cms/wiki
