Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: **Assign Users to Roles:**
fr: ** Affecter les utilisateurs aux rôles: **
sw: ** Wape watumiaji majukumu: **

source: Allocate users to the Composer and Approver roles based on their job functions and expertise.
fr: Allouer des utilisateurs aux rôles compositeurs et approbateurs en fonction de leurs fonctions et de leur expertise.
sw: Wape watumiaji kwa mtunzi na majukumu ya kupitisha kulingana na kazi zao za kazi na utaalam.

source: **_Note:_** Ensure to enable 2Factor authenitcation for the Approver role
fr: ** _ Remarque: _ ** Assurez-vous d'activer l'autorisation de 2facteurs pour le rôle d'approbateur
sw: ** _ Kumbuka: _ ** Hakikisha kuwezesha uandishi wa 2Factor kwa jukumu la idhini

source: **Implement Approval Workflows:**
fr: ** Mettre en œuvre des workflows d'approbation: **
sw: ** Utekeleze kazi ya idhini: **

source: Configure the system's workflow to require approval from an Approver before an alert created by a Composer can be published.
fr: Configurer le flux de travail du système pour nécessiter l'approbation d'un approbateur avant qu'une alerte créée par un compositeur puisse être publiée.
sw: Sanidi mtiririko wa mfumo ili kuhitaji idhini kutoka kwa idhini kabla ya tahadhari iliyoundwa na mtunzi inaweza kuchapishwa.

source: **Test the Workflow:**
fr: ** Testez le workflow: **
sw: ** Jaribu utiririshaji wa kazi: **

source: Conduct tests to ensure that alerts follow the correct path from composition to approval and finally to dissemination.
fr: Effectuer des tests pour garantir que les alertes suivent le chemin correct de la composition à l'approbation et enfin à la diffusion.
sw: Fanya vipimo ili kuhakikisha kuwa arifu zinafuata njia sahihi kutoka kwa muundo hadi idhini na hatimaye kusambaza.

source: Creating CAP Alerts
fr: Création d'alertes de capuchon
sw: Kuunda arifu za cap

source: To create a CAP Alert access the CAP composing interface from the explorer menu as below and add a new cap alert page:
fr: Pour créer une alerte CAP, accès à l'interface de composition du capuchon à partir du menu Explorer comme ci-dessous et ajoutez une nouvelle page d'alerte CAP:
sw: Ili kuunda ufikiaji wa tahadhari ya cap interface ya kutunga kutoka kwa menyu ya Explorer kama ilivyo hapo chini na ongeza ukurasa mpya wa tahadhari ya cap:

source: ![CAP Explorer](../../_static/images/cap/cap_explorer.png "CAP Explorer")
fr: ! [Cap Explorer] (../../_ statique / images / cap / cap_explorer.png "Cap Explorer")
sw: ! [Cap Explorer] (../../_ tuli/picha/cap/cap_explorer.png "cap Explorer")

source: CAP Explorer
fr: Explorateur de capuchon

source: Sections in the Alert Page and corresponding XML
fr: Sections dans la page d'alerte et XML correspondant
sw: Sehemu katika ukurasa wa tahadhari na XML inayolingana

source: The overall Document Object Model of an alert is as below:
fr: Le modèle d'objet de document global d'une alerte est le comme ci-dessous:
sw: Mfano wa jumla wa hati ya tahadhari ni kama ilivyo hapo chini:

source: ![Alert DOM](../../_static/images/cap/dom.jpg "CAP Document Object Model")
fr: ! [Alert Dom] (../../_ statique / images / cap / dom.jpg "Modèle d'objet de document CAP")
sw: ! [Alert DOM] (../../_ tuli/picha/cap/dom.jpg "mfano wa hati ya cap")))

source: Alert DOM
fr: Alerte Dom
sw: DOM ya tahadhari

source: Alert Identification
fr: Identification d'alerte
sw: Kitambulisho cha tahadhari

source: It contains the following entities required for a valid CAP message:
fr: Il contient les entités suivantes requises pour un message CAP valide:
sw: Inayo vyombo vifuatavyo vinavyohitajika kwa ujumbe halali wa cap:

source: Sender ID(sender),
fr: ID de l'expéditeur (expéditeur),
sw: Kitambulisho cha mtumaji (mtumaji),

source: Sent Dat/Time (sent),
fr: Envoyé dat / heure (envoyé),
sw: Imetumwa/wakati (imetumwa),

source: Message Status (status),
fr: État du message (statut),
sw: Hali ya Ujumbe (Hali),

source: Message Type (msgType),
fr: Type de message (msgtype),
sw: Aina ya ujumbe (msgtype),

source: Scope(scope),
fr: Portée (portée),
sw: Wigo (wigo),

source: Addresses (addresses),
fr: Adresses (adresses),
sw: Anwani (anwani),

source: Note (note),
fr: Remarque (note),
sw: Kumbuka (kumbuka),

source: Reference IDs (references) and
fr: ID de référence (références) et
sw: Vitambulisho vya kumbukumbu (marejeleo) na

source: Incident ids (incidents).
fr: ID incident (incidents).
sw: IDS ya tukio (matukio).

source: The alert identifier is generated automatically and is not editable.
fr: L'identifiant d'alerte est généré automatiquement et n'est pas modifiable.
sw: Kitambulisho cha tahadhari hutolewa kiatomati na hakiwezi kuhaririwa.

source: Some fields are visible based on selection of different parameters.
fr: Certains champs sont visibles en fonction de la sélection de différents paramètres.
sw: Sehemu zingine zinaonekana kulingana na uteuzi wa vigezo tofauti.

source: ![Alert Identification](../../_static/images/cap/alert_identification.png "Alert Identification section")
fr: ! [Identification d'alerte] (../../_ statique / images / cap / alert_identification.png "Section d'identification d'alerte")
sw: ! [Kitambulisho cha tahadhari] (../../_ tuli/picha/cap/alert_dentification.png "Sehemu ya kitambulisho cha tahadhari"))

source: Alert Information
fr: Alerte
sw: Habari ya tahadhari

source: Corresponds to the `<info>` element in the CAP message. The <info> entity specifies the alert's details. At least one <info> block is required for an alert. If you support multiple languages, it is recommended that you use one <info> block for each language for the same <alert> entity.:
fr: Correspond à l'élément `<oft>` dans le message CAP. L'entité <fo> spécifie les détails de l'alerte. Au moins un bloc <fo> est requis pour une alerte. Si vous prends en charge plusieurs langues, il est recommandé d'utiliser un bloc <fo> pour chaque langue pour la même entité <laler>.:
sw: Inalingana na kipengee cha `<fo>` katika ujumbe wa cap. Taasisi ya <fo> inataja maelezo ya tahadhari. Angalau block moja ya <fo> inahitajika kwa tahadhari. Ikiwa unaunga mkono lugha nyingi, inashauriwa utumie block moja ya <fo info> kwa kila lugha kwa chombo kimoja cha <alevel>.:

source: A CAP message expects at least one `<info>` element to be present. Multiple `<info>` blocks should all have the same `<category>` and `<event>` element values.
fr: Un message CAP attend au moins un élément `<info> 'qu'il soit présent. Plusieurs blocs `<fo info>` devraient tous avoir les mêmes valeurs d'élément `<catégories>` et `<events>`.
sw: Ujumbe wa cap unatarajia angalau `<fo info>` kipengee kuwa kipo. Vizuizi vingi vya `<fo>` Zote zinapaswa kuwa na viwango sawa vya `<categont>` na `` `` `.

source: Each `Information` block contains the following elements:
fr: Chaque bloc «Information» contient les éléments suivants:
sw: Kila block `habari` ina vitu vifuatavyo:

source: Event Category/Categories (category)
fr: Catégorie / catégories d'événements (catégorie)
sw: Jamii ya Tukio/Jamii (Jamii)

source: Event Type (event)
fr: Type d'événement (événement)
sw: Aina ya Tukio (Tukio)

source: Response Type/Types (responseType)
fr: Type / type de réponse (ResponseType)
sw: Aina ya majibu/aina (majibu ya majibu)

source: Urgency (urgency)
fr: Urgence (urgence)
sw: Uharaka (uharaka)

source: Severity (severity)
fr: Gravité (gravité)
sw: Ukali (ukali)

source: Certainty (certainty)
fr: Certitude (certitude)
sw: Uhakikisho (hakika)

source: Audience (audience)
fr: Public (public)
sw: Watazamaji (watazamaji)

source: Event Code/Codes (eventCode)
fr: Code d'événements / codes (EventCode)
sw: Nambari ya Tukio/Nambari (TukioCode)

source: Effective Date/Time (effective)
fr: Date d'entrée en vigueur / heure (efficace)
sw: Tarehe/wakati unaofaa (ufanisi)

source: Onset Date/Time (onset)
fr: Date / heure de début (début)
sw: Tarehe ya kuanza/wakati (mwanzo)

source: Expiration Date/Time (expires)
fr: Date / heure d'expiration (expire)
sw: Tarehe ya kumalizika muda/wakati (kumalizika)

source: Sender Name (senderName)
fr: Nom de l'expéditeur (Sendername)
sw: Jina la mtumaji (jina la mtumaji)

source: Headline(headline)
fr: Titre (titre)
sw: Kichwa cha habari (kichwa cha habari)

source: Event description (description)
fr: Description de l'événement (Description)
sw: Maelezo ya Tukio (Maelezo)

source: Information URL (web),
fr: URL d'information (Web),
sw: URL ya habari (wavuti),

source: Contact Info (contact) and
fr: Coordonnées (contact) et
sw: Maelezo ya mawasiliano (mawasiliano) na

source: Parameter/Parameters(parameter)
fr: Paramètre / paramètres (paramètre)
sw: Parameta/vigezo (parameta)

source: ![Alert Info](../../_static/images/cap/alert_info.png "Alert Info")
fr: ! [Info alerte] (../../_ statique / images / cap / alert_info.png "alerte info")
sw: ! [Maelezo ya tahadhari] (../../_ tuli/picha/cap/tahadhari_info.png "INFO ya tahadhari"))

source: Alert Info
fr: Alerte
sw: Maelezo ya tahadhari

source: Alert Area
fr: Zone d'alerte
sw: Eneo la tahadhari

source: Information Entity that defines the geographic area to be notified. Multiple areas can be defined in the alert. Each area contains the following elements:
fr: Entité d'information qui définit la zone géographique à notifier. Plusieurs zones peuvent être définies dans l'alerte. Chaque zone contient les éléments suivants:
sw: Chombo cha habari ambacho kinafafanua eneo la kijiografia kuarifiwa. Maeneo mengi yanaweza kufafanuliwa katika tahadhari. Kila eneo lina vitu vifuatavyo:

source: Area Description (areaDesc),
fr: Description de la zone (areadesc),
sw: Maelezo ya eneo (Areadesc),

source: Area Polygon/Polygons (polygon),
fr: Zone polygone / polygones (polygone),
sw: Polygon ya eneo/polygons (polygon),

source: Area Circle/Circles (circle),
fr: Cercle de zone / cercles (cercle),
sw: Mzunguko wa eneo/miduara (mduara),

source: Area Geocode/Geocodes (geocode),
fr: Zone géocode / geocodes (géocode),
sw: Eneo la geocode/geocode (geocode),

source: Ceiling (ceiling)
fr: Plafond (plafond)
sw: Dari (dari)

source: ![Alert Area](../../_static/images/cap/alert_area_options.png "Alert Area section")
fr: ! [Zone d'alerte] (../../_ statique / images / cap / alert_area_options.png "Section de zone d'alerte")
sw: ! [Eneo la tahadhari] (../../_ tuli/picha/cap/tahadhari_area_options.png "Sehemu ya eneo la tahadhari"))

source: The Alert area input has 4 selector options:
fr: L'entrée de la zone d'alerte a 4 options de sélecteur:
sw: Uingizaji wa eneo la tahadhari una chaguzi 4 za kuchagua:

source: Admin Boundary (area is picked from predefined boundaries). To use this option, ensure that admin boundaries are initially loaded. Refer to [Setting up boundaries](./Setting-Boundaries.md) section.
fr: Limite administrative (la zone est choisie à partir de limites prédéfinies). Pour utiliser cette option, assurez-vous que les limites d'administration sont initialement chargées. Reportez-vous à la section [configuration des limites] (./ setting-boundaires.md).
sw: Mpaka wa admin (eneo huchukuliwa kutoka kwa mipaka iliyofafanuliwa). Kutumia chaguo hili, hakikisha kwamba mipaka ya admin hapo awali imejaa. Rejea [Kuweka mipaka] (./ kuweka-mipaka.md) sehemu.

source: ![Alert Area boundary](../../_static/images/cap/alert_area_boundary.png "Alert Area section")
fr: ! [Boundaire de la zone d'alerte] (../../_ statique / images / cap / alert_area_boundary.png "Section de zone d'alerte")

source: Alert Area boundary
fr: Limite d'alerte
sw: Mpaka wa eneo la tahadhari

source: Polygon (drawing a polygon). If you have not yet uploaded boundaries refer to [Setting boundaries Section](./Setting-Boundaries.md#setting-boundaries)
fr: Polygone (dessin un polygone). Si vous n'avez pas encore téléchargé les limites, référez-vous à [Section des limites de réglage] (./ setting-bendaries.md # setting-bendaires)
sw: Polygon (kuchora polygon). Ikiwa bado haujapakia mipaka rejea [sehemu ya mipaka] (./ kuweka-mipaka.md#kuweka-mipaka)

source: ![Alert Area polygon](../../_static/images/cap/alert_area_polygon.png "Alert Area section")
fr: ! [Alerte Zone Polygon] (../../_ statique / images / cap / alert_area_polygon.png "Section de zone d'alerte")
sw: ! [Alert Area Polygon] (../../_ tuli/picha/cap/alert_area_polygon.png "Sehemu ya eneo la tahadhari"))

source: Alert Area polygon
fr: Polygone d'alerte

source: Circle (drawing a circle which specifies the latitude, longitude and radius)
fr: Cercle (dessiner un cercle qui spécifie la latitude, la longitude et le rayon)
sw: Mduara (kuchora mduara ambao unataja latitudo, longitudo na radius)

source: ![Alert Area circle](../../_static/images/cap/alert_area_circle.png "Alert Area section")
fr: ! [Cercle d'alerte d'alerte] (../../_ statique / images / cap / alert_area_circle.png "Section de zone d'alerte")

source: Alert Area circle
fr: Cercle d'alerte
sw: Mzunguko wa eneo la tahadhari

source: Geocode (specifying area geocode name and value). Using this option presumes knowleged of the coding system
fr: Geocode (spécifiant le nom et la valeur de la zone de géocode). L'utilisation de cette option suppose que le système de codage
sw: Geocode (kutaja jina la eneo la geocode na thamani). Kutumia chaguo hili kudhani kuwa na mfumo wa kuweka coding

source: ![Alert Area geocode](../../_static/images/cap/alert_area_geocode.png "Alert Area section")
fr: ! [Alerte Zone Geocode] (../../_ statique / images / cap / alert_area_geocode.png "Section de zone d'alerte")

source: Alert Area geocode
fr: Géocode d'alerte
sw: Eneo la tahadhari geocode

source: Alert Resource
fr: Ressource alerte
sw: Rasilimali ya tahadhari

source: Entity that defines supplemental information related to an <info> object Multiple instances of this section are allowed. It contains:
fr: L'entité qui définit les informations supplémentaires liées à un <fo> objet, plusieurs instances de cette section sont autorisées. Il contient:
sw: Chombo ambacho hufafanua habari ya ziada inayohusiana na hali ya <info> mifano mingi ya sehemu hii inaruhusiwa. Inayo:

source: Description (resourceDesc), MIME Type (mimeType), File Size (size), URI (uri), Dereferenced URI (derefUri) and Digest (digest)**
fr: Description (ressourcedesc), type mime (mimetype), taille de fichier (taille), uri (uri), uri déréférencé (derefuri) et digest (digest) **
sw: Maelezo (rasilimali), aina ya mime (mimetype), saizi ya faili (saizi), uri (uri), uri iliyotengwa (derefuri) na digest (digest) **

source: The Alert resource input has 2 selector options:
fr: L'entrée de ressources d'alerte a 2 options de sélecteur:
sw: Uingizaji wa Rasilimali ya Alert una chaguzi 2 za kuchagua:

source: File resource (takes in a file and description)
fr: Ressource de fichier (prend un fichier et une description)
sw: Rasilimali ya Faili (inachukua faili na maelezo)

source: ![Alert Resource](../../_static/images/cap/alert_resource_file.png "Alert Resource section")
fr: ! [Ressource d'alerte] (../../_ statique / images / cap / alert_resource_file.png "Section de ressources d'alerte")
sw: ! [Rasilimali ya tahadhari] (../../_ tuli/picha/cap/tahadhari_resource_file.png "Sehemu ya Rasilimali ya Alert"))

source: External resource
fr: Ressource externe
sw: Rasilimali ya nje

source: ![Alert Resource](../../_static/images/cap/alert_resource_external.png "Alert Resource section")
fr: ! [Ressource d'alerte] (../../_ statique / images / cap / alert_resource_external.png "Section de ressources d'alerte")
sw: ! [Rasilimali ya tahadhari] (../../_ tuli/picha/cap/tahadhari_resource_external.png "Sehemu ya rasilimali ya tahadhari"))

source: Additional CAP Inputs
fr: Entrées de plafond supplémentaires
sw: Pembejeo za ziada za cap

source: Addition alert information elements include parameters and event codes
fr: Les éléments d'information d'alerte supplémentaires incluent les paramètres et les codes d'événements
sw: Vipengee vya habari vya tahadhari ni pamoja na vigezo na nambari za hafla

source: This defines the reference incident to the current alert, if any.
fr: Cela définit l'incident de référence à l'alerte actuelle, le cas échéant.
sw: Hii inafafanua tukio la kumbukumbu kwa tahadhari ya sasa, ikiwa ipo.

source: ![Alert Incidents](../../_static/images/cap/alert_incidents.png "Alert Incidents section")
fr: ! [Incidents d'alerte] (../../_ statique / images / cap / alert_incidents.png "Section des incidents d'alerte")
sw: ! [Matukio ya tahadhari] (../../_ tuli/picha/cap/tahadhari

source: Alert Incidents
fr: Incidents alertes
sw: Matukio ya tahadhari

source: Setting Boundaries
fr: Fixer des limites
sw: Kuweka mipaka

source: This section guides you on how to set up boundaries which are useful in the creating an [Alert Area by polygon](Creating-Alerts.md#alert-area) .
fr: Cette section vous guide sur la façon de configurer les limites qui sont utiles dans la création d'une [zone d'alerte par polygone] (création-alerts.md # alert-alera).
sw: Sehemu hii inakuongoza juu ya jinsi ya kuweka mipaka ambayo ni muhimu katika kuunda [eneo la tahadhari na Polygon] (kuunda-alerts.md#tahadhari-eneo).

source: The Geo Manager allows for the addition of boundaries to be used in the creation of an alert area using the admin boundary option.
fr: Le Geo Manager permet d'utiliser l'ajout de limites dans la création d'une zone d'alerte à l'aide de l'option de limite d'administration.
sw: Meneja wa GEO huruhusu kuongezwa kwa mipaka kutumiwa katika uundaji wa eneo la tahadhari kwa kutumia chaguo la mipaka ya admin.

source: ![Boundary Settings](../../_static/images/cap/geomanager_boundary.png "Boundary Settings")
fr: ! [Paramètres limites] (../../_ statique / images / cap / geomanager_boundary.png "Paramètres limites")
sw: ! [Mipangilio ya mipaka] (../../_ tuli/picha/cap/geoManager_boundary.png "Mipangilio ya mipaka"))

source: Boundary Settings
fr: Paramètres de limite
sw: Mipangilio ya mipaka

source: To access it, click on the geomanager in the explorer menu as below and select 'Boundary settings' to select the boundary data source and country/countries of interest. You will then need to add boundary data for the countries selected:
fr: Pour y accéder, cliquez sur le géomomager dans le menu Explorer comme ci-dessous et sélectionnez les «paramètres de limite» pour sélectionner la source de données limites et le pays / les pays d'intérêt. Vous devrez alors ajouter des données limites pour les pays sélectionnés:
sw: Ili kuipata, bonyeza kwenye GeoManager kwenye menyu ya Explorer kama ilivyo hapo chini na uchague 'Mipangilio ya mipaka' kuchagua chanzo cha data ya mipaka na nchi/nchi za riba. Utahitaji kuongeza data ya mipaka kwa nchi zilizochaguliwa:

source: ![Boundary Settings](../../_static/images/cap/geomanager_boundary_settings.png "Boundary Settings")
fr: ! [Paramètres limites] (../../_ statique / images / cap / geomanager_boundary_settings.png "Paramètres limites")
sw: ! [Mipangilio ya mipaka] (../../_ tuli/picha/cap/geomager_boundary_settings.png "Mipangilio ya mipaka"))

source: Select the 'boundary data source' where you will download the boundaries. The current options are:
fr: Sélectionnez la «source de données des limites» où vous téléchargerez les limites. Les options actuelles sont:
sw: Chagua 'chanzo cha data ya mipaka' ambapo utapakua mipaka. Chaguzi za sasa ni:

source: Global Administrative Areas 4.1 (GADM) https://gadm.org/download_country.html
fr: Zones administratives mondiales 4.1 (GADM) https://gadm.org/download_country.html
sw: Maeneo ya Utawala wa Ulimwenguni 4.1 (GADM) https://gadm.org/download_country.html

source: ![Boundary Settings](../../_static/images/cap/geomanager_country_select.png "Boundary Settings")
fr: ! [Paramètres limites] (../../_ statique / images / cap / geomanager_country_select.png "Paramètres limites")
sw: ! [Mipangilio ya mipaka] (../../_ tuli/picha/cap/geoManager_country_select.png "Mipangilio ya mipaka"))

source: Add one or more countries
fr: Ajouter un ou plusieurs pays
sw: Ongeza nchi moja au zaidi

source: To add boundary data, access the menu as below and click on 'Country Boundary Loader' and click 'Add boundary' button:
fr: Pour ajouter des données de limite, accédez au menu comme ci-dessous et cliquez sur «Country Boundary Loader» et cliquez sur le bouton «Ajouter la limite»:
sw: Ili kuongeza data ya mipaka, fikia menyu kama ilivyo hapo chini na ubonyeze kwenye 'Boundary Loader' na bonyeza kitufe cha 'Ongeza Boundary':

source: ![Boundary Settings](../../_static/images/cap/add_admin_boundary.png "Boundary Settings")
fr: ! [Paramètres limites] (../../_ statique / images / cap / add_admin_boundary.png "Paramètres limites")
sw: ! [Mipangilio ya mipaka] (../../_ tuli/picha/cap/add_admin_boundary.png "Mipangilio ya mipaka"))

source: Load country boundaries at each of different levels (level 0 to 4) in zipped shapefile format
fr: Chargez les limites du pays à chacun des différents niveaux (niveau 0 à 4) au format de fichier de forme zippé
sw: Pakia mipaka ya nchi katika kila ngazi tofauti (kiwango 0 hadi 4) katika muundo wa umbo la umbo

source: ![Boundary Loader](../../_static/images/cap/upload_boundary_file.png "Boundary Loader")
fr: ! [Boundary Loder] (../../_ statique / images / cap / upload_boundary_file.png "Boundary Loder")
sw: ! [Loader ya mipaka] (../../_ tuli/picha/cap/upload_boundary_file.png "Loader ya mipaka")

source: Boundary Loader
fr: Chargeur de limite
sw: Loader ya mipaka

source: Zip shapefiles seperately by Admin levels before upload.
fr: Zip de forme de fichiers séparément par les niveaux d'administration avant le téléchargement.
sw: Zip ShapeFiles Seper kwa viwango vya admin kabla ya kupakia.

source: Alertwise (CAP Alerts)
fr: Alerte (alertes de capuchon)
sw: AlertWise (Arifa za CAP)

source: The **Common Alerting Protocol (CAP)** provides an open, non-proprietary digital message format for all types of alerts and notifications. It does not address any particular application or telecommunications method. The CAP format is compatible with emerging techniques, such as Web services, as well as existing formats including the Specific Area Message Encoding (SAME) used for the United States' National Oceanic and Atmospheric Administration (NOAA) Weather Radio and the Emergency Alert System (EAS)
fr: Le ** Protocole d'alerte commun (CAP) ** fournit un format de message numérique ouvert et non propriétaire pour tous les types d'alertes et de notifications. Il ne traite aucune application ou méthode de télécommunications particulière. Le format CAP est compatible avec les techniques émergentes, telles que les services Web, ainsi que les formats existants, y compris le codage de messages de zone spécifique (même) utilisé pour la radio météorologique des États-Unis Océanique et atmosphérique (NOAA) et le système d'alerte d'urgence (EAS) des États-Unis.
sw: Itifaki ya kawaida ya kuarifu (CAP) ** hutoa muundo wazi wa ujumbe wa dijiti wa dijiti kwa kila aina ya arifu na arifa. Haishughulikii programu yoyote au njia ya mawasiliano. Fomati ya CAP inaambatana na mbinu zinazoibuka, kama vile huduma za wavuti, na vile vile fomati zilizopo ikiwa ni pamoja na encoding ya ujumbe maalum wa eneo (sawa) inayotumika kwa Redio ya hali ya hewa

source: The CAP xml response follows the structure of the schema provided at http://docs.oasis-open.org/emergency/cap/v1.2/CAP-v1.2-os.html
fr: La réponse CAP XML suit la structure du schéma fourni à http://docs.oasis-open.org/emergency/cap/v1.2/cap-v1.2-os.html
sw: Jibu la XML linafuata muundo wa schema iliyotolewa katika http://docs.oasis-open.org/emergency/cap/v1.2/cap-v1.2-os.html
