Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: When adding a new bulletin, you will only need to begin from Step 5: [Creation of one or more product items for a product page](Manage-Products#step-5-creation-of-one-or-more-product-items-for-a-product-page) section above to upload the document or any related text and images about a new period.
fr: Lors de l'ajout d'un nouveau bulletin, vous n'aurez besoin que de commencer à partir de l'étape 5: [Création d'un ou plusieurs articles de produit pour une page de produit] (Manager-Products # Étape-5-Création d'un ou moi-même-produit-Items pour une nouvelle période.
sw: Wakati wa kuongeza taarifa mpya, utahitaji tu kuanza kutoka kwa hatua ya 5: [Uundaji wa bidhaa moja au zaidi ya bidhaa kwa ukurasa wa bidhaa] (kusimamia bidhaa#hatua-5-uundaji-wa-mmoja-au-bidhaa-bidhaa-kwa-kwa-bidhaa-ukurasa) hapo juu kupakia hati au maandishi yoyote yanayohusiana na picha kuhusu kipindi kipya.

source: Creation of Publications
fr: Création de publications
sw: Uundaji wa machapisho

source: The creation of publications follows the steps below:
fr: La création de publications suit les étapes ci-dessous:
sw: Uundaji wa machapisho hufuata hatua hapa chini:

source: Create a publication type
fr: Créer un type de publication
sw: Unda aina ya uchapishaji

source: Create a publication listing page
fr: Créer une page de liste de publication
sw: Unda ukurasa wa orodha ya uchapishaji

source: Create a publication page
fr: Créer une page de publication
sw: Unda ukurasa wa uchapishaji

source: Publication Creation Example Scenario
fr: Exemple de création de publication Scénario
sw: Mfano wa Uumbaji wa Uchapishaji

source: Assume you would like to have publication relating to Agrometeorology on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous aimeriez avoir une publication relative à l'agrométéorologie sur le site Web, la façon pratique de le faire en utilisant les étapes ci-dessus serait:
sw: Fikiria ungependa kuwa na uchapishaji unaohusiana na agrometeorology kwenye wavuti, njia ya vitendo ya kuifanya kwa kutumia hatua hapo juu itakuwa:

source: Step 1: Create an publication type
fr: Étape 1: Créez un type de publication
sw: Hatua ya 1: Unda aina ya uchapishaji

source: To create a publication type, navigate to the 'Snippets' section on the explorer menu and select 'Publication Types' as below:
fr: Pour créer un type de publication, accédez à la section «extraits» du menu Explorer et sélectionnez «Types de publication» comme ci-dessous:
sw: Ili kuunda aina ya uchapishaji, nenda kwa sehemu ya 'Snippets' kwenye menyu ya Explorer na uchague 'Aina za Uchapishaji' kama ilivyo hapo chini:

source: ![Publications Explorer](../../_static/images/publications/publications_explorer.png "Publications Explorer")
fr: ! [Publications Explorer] (../../_ statique / images / publications / publications_explorer.png "Publications Explorer")
sw: ! [Machapisho ya Explorer] (../ ..

source: Publications Explorer
fr: Explorateur des publications
sw: Machapisho Explorer

source: Click on 'Add Publication Type' to create a new publication type.
fr: Cliquez sur «Ajouter un type de publication» pour créer un nouveau type de publication.
sw: Bonyeza kwenye 'Ongeza Aina ya Uchapishaji' kuunda aina mpya ya uchapishaji.

source: ![Publications Type](../../_static/images/publications/add_publication_type.png "Publications Type")
fr: ! [Type de publications] (../../_ statique / images / publications / add_publication_type.png "Type de publications")
sw: ! [Aina ya machapisho] (../../_ tuli/picha/machapisho/add_publication_type.png "aina ya machapisho"))

source: Publications Type
fr: Type de publications
sw: Aina ya machapisho

source: Provide publication type name and choose an icon and save.
fr: Fournissez le nom du type de publication et choisissez une icône et enregistrez.
sw: Toa jina la aina ya uchapishaji na uchague ikoni na uhifadhi.

source: ![Publications Type](../../_static/images/publications/publication_type.png "Publications Type")
fr: ! [Type de publications] (../../_ statique / images / publications / publication_type.png "Type de publications")
sw: ! [Aina ya machapisho] (../../_ tuli/picha/machapisho/uchapishaji_type.png "Aina ya Machapisho"))

source: Step 2: Create a publication listing page
fr: Étape 2: Créez une page de liste de publication
sw: Hatua ya 2: Unda ukurasa wa orodha ya uchapishaji

source: A listing page is a page that holds a list of pages. For example, a Publication Listing page would hold one or more publications. It lists the banner, latest 3 featured publications and all other publications.
fr: Une page d'inscription est une page qui contient une liste de pages. Par exemple, une page d'inscription de publication contiendrait une ou plusieurs publications. Il répertorie la bannière, les 3 dernières publications en vedette et toutes les autres publications.
sw: Ukurasa wa orodha ni ukurasa ambao una orodha ya kurasa. Kwa mfano, ukurasa wa orodha ya uchapishaji ungeshikilia machapisho moja au zaidi. Inaorodhesha bendera, machapisho 3 ya hivi karibuni yaliyoonyeshwa na machapisho mengine yote.

source: ![Publication List Preview](../../_static/images/publications/publication_list_preview.png "Publication List Preview")
fr: ! [Publication List Preview] (../../_ statique / images / publications / publication_list_preview.png "Publication List Preview")

source: Publication List Preview
fr: Aperçu de la liste des publications
sw: Hakikisho la orodha ya uchapishaji

source: This option will only appear if no publication listing page already exists as there can only be on instance/occurrrence of a publication listing page.
fr: Cette option n'apparaîtra que si aucune page de liste de publication n'existe déjà car il ne peut y avoir que sur l'instance / l'occurrence d'une page de liste de publication.
sw: Chaguo hili litaonekana tu ikiwa hakuna ukurasa wa orodha ya uchapishaji tayari upo kwani kunaweza kuwa na mfano/tukio la ukurasa wa orodha ya uchapishaji.

source: Select Publication List Page from the type of pages provided.
fr: Sélectionnez la page de la liste de publication dans le type de pages fournies.
sw: Chagua Ukurasa wa Orodha ya Uchapishaji kutoka kwa aina ya kurasa zilizotolewa.

source: ![Add Publication List Page](../../_static/images/publications/add_publication_list.png "Add Publication List Page")
fr: ! [Ajouter une page de liste de publication] (../../_ statique / images / publications / add_publication_list.png "Ajouter la page de liste de publication")

source: Add Publication List Page
fr: Ajouter la page de la liste des publications
sw: Ongeza ukurasa wa Orodha ya Uchapishaji

source: ![Add Publication List Page](../../_static/images/publications/publication_list_page.png "Add Publication List Page")
fr: ! [Ajouter une page de liste de publication] (../../_ statique / images / publications / publication_list_page.png "Ajouter la page de liste de publication")
sw: ! [Ongeza ukurasa wa Orodha ya Uchapishaji] (..

source: Step 3: Create a publication page
fr: Étape 3: Créez une page de publication
sw: Hatua ya 3: Unda ukurasa wa uchapishaji

source: This will navigate to the list of pages under the home page including the publication list page you just created. Hover over the the publication listing page and click on 'add child page'.
fr: Cela accédera à la liste des pages sous la page d'accueil, y compris la page de liste de publication que vous venez de créer. Survolez la page de liste de publication et cliquez sur «Ajouter une page enfant».
sw: Hii itaenda kwenye orodha ya kurasa zilizo chini ya ukurasa wa nyumbani pamoja na ukurasa wa orodha ya uchapishaji uliyounda tu. Hover juu ya ukurasa wa orodha ya uchapishaji na ubonyeze kwenye 'Ongeza Ukurasa wa Mtoto'.

source: ![Add Publication Page](../../_static/images/publications/add_publication.png "Add Publication Page")
fr: ! [Ajouter une page de publication] (../../_ statique / images / publications / add_publication.png "Ajouter la page de publication")
sw: ! [Ongeza ukurasa wa uchapishaji] (../../_ tuli/picha/machapisho/add_publication.png "Ongeza ukurasa wa Uchapishaji"))

source: Add Publication Page
fr: Ajouter la page de publication
sw: Ongeza Ukurasa wa Uchapishaji

source: ![Publication Page Sections](../../_static/images/publications/publication_sections.png "Publication Page Sections")
fr: ! [Sections de page de publication] (../../_ statique / images / publications / publication_sections.png "Sections de page de publication")
sw: ! [Sehemu za Ukurasa wa Uchapishaji] (../../_ tuli/Picha/Machapisho/Uchapishaji

source: Publication Page Sections
fr: Sections de page de publication
sw: Sehemu za Ukurasa wa Uchapishaji

source: **Publication Type** - selected from previously prepared service category in step 1
fr: ** Type de publication ** - Sélectionné dans la catégorie de service précédemment préparée à l'étape 1
sw: ** Aina ya Uchapishaji ** - Iliyochaguliwa kutoka kwa Jamii ya Huduma iliyotayarishwa hapo awali katika Hatua ya 1

source: **Service Category** - selected from previously prepared service category. Refer to [Create Services Categories Section](./Manage-Services#step-1-create-an-agromet-service-category) to create service categories.
fr: ** Catégorie de service ** - Sélectionné dans la catégorie de service précédemment préparée. Reportez-vous à la section [Créer des catégories de services] (./ Manage-Services # Step-1-Create-An-Agromet-Service-Category) pour créer des catégories de services.
sw: ** Jamii ya Huduma ** - Iliyochaguliwa kutoka kwa Jamii ya Huduma iliyotayarishwa hapo awali. Rejea [Unda Sehemu za Huduma] (.

source: **Projects Section** - select from previously prepared projects. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects.
fr: ** Section des projets ** - Sélectionnez parmi les projets précédemment préparés. Veuillez référer [Gérer les projets] (./ Manage-Projects) pour guider la création de projets.
sw: ** Sehemu ya Miradi ** - Chagua kutoka kwa miradi iliyoandaliwa hapo awali. Tafadhali rejelea [Dhibiti miradi] (.

source: **Publication Image** - This can be a screenshot of the front page of the publication
fr: ** Image de publication ** - Cela peut être une capture d'écran de la première page de la publication
sw: ** Picha ya Uchapishaji ** - Hii inaweza kuwa picha ya ukurasa wa mbele wa uchapishaji

source: **Date of Publish** - the date the publication was published
fr: ** Date de publication ** - La date de publication de la publication
sw: ** Tarehe ya kuchapisha ** - Tarehe ambayo uchapishaji ulichapishwa

source: **Document or File** - Here you can upload pdfs, word documents, powerpoints, zip files or any other file of the publication
fr: ** Document ou fichier ** - Ici, vous pouvez télécharger des PDF, des documents Word, PowerPoints, des fichiers ZIP ou tout autre fichier de la publication
sw: ** Hati au Faili ** - Hapa unaweza kupakia PDF, hati za maneno, PowerPoints, faili za ZIP au faili nyingine yoyote ya uchapishaji

source: **External Url** - Only If published/hosted somewhere else, provide a link to published resource if external
fr: ** URL externe ** - Seulement si elle est publiée / hébergée ailleurs, fournir un lien vers la ressource publiée si externe
sw: ** URL ya nje ** - tu ikiwa imechapishwa/kukaribishwa mahali pengine, toa kiunga cha rasilimali iliyochapishwa ikiwa nje

source: **Summary** - Brief Summary of the publication
fr: ** Résumé ** - bref résumé de la publication
sw: ** Muhtasari ** - Muhtasari mfupi wa uchapishaji

source: **Mark as featured** - If enabled, the publication will appear as Featured publications on the publications listing page
fr: ** Marquez comme en vedette ** - Si c'est activé, la publication apparaîtra comme des publications en vedette sur la page des publications
sw: ** Alama Kama ilivyoonyeshwa ** - Ikiwa imewezeshwa, uchapishaji utaonekana kama machapisho yaliyoonyeshwa kwenye ukurasa wa orodha ya machapisho

source: **Is visible on homepage** - If enabled, the publication will appear in the homepage as an alert/latest update
fr: ** est visible sur la page d'accueil ** - Si c'est activé, la publication apparaîtra dans la page d'accueil comme une mise à jour d'alerte / dernière mise à jour
sw: ** Inaonekana kwenye ukurasa wa nyumbani ** - ikiwa imewezeshwa, uchapishaji utaonekana kwenye ukurasa wa nyumbani kama sasisho la tahadhari/mpya

source: **Peer reviewed** - enable this option if the publication has been peer reviewed
fr: ** Examiné par des pairs ** - Activer cette option si la publication a été examinée par des pairs
sw: ** rika iliyokaguliwa ** - Wezesha chaguo hili ikiwa uchapishaji umepitiwa rika

source: **Additional Details** - this include an optional start and end date for which the publication is considered relevant.
fr: ** Détails supplémentaires ** - Ceci comprend une date de début et de fin facultative pour laquelle la publication est considérée comme pertinente.
sw: ** Maelezo ya ziada ** - Hii ni pamoja na kuanza kwa hiari na tarehe ya mwisho ambayo uchapishaji unachukuliwa kuwa muhimu.

source: To create additional publications in the future you would need to begin from [Step 3: Create a publication page](./Manage-Publications#step-3-create-a-publication-page).
fr: Pour créer des publications supplémentaires à l'avenir, vous devez commencer à partir de [Étape 3: Créer une page de publication] (./ Manage-Publications # Étape-3-Create-A-Publication-Page).
sw: Ili kuunda machapisho ya ziada katika siku zijazo utahitaji kuanza kutoka [Hatua ya 3: Unda ukurasa wa uchapishaji] (.

source: Creation of Services
fr: Création de services
sw: Uumbaji wa huduma

source: The creation of services follows the steps below:
fr: La création de services suit les étapes ci-dessous:
sw: Uundaji wa huduma hufuata hatua hapa chini:

source: Create a service category
fr: Créer une catégorie de service
sw: Unda kitengo cha huduma

source: Create a service listing page
fr: Créer une page de liste de services
sw: Unda ukurasa wa orodha ya huduma

source: Create a service page
fr: Créer une page de service
sw: Unda ukurasa wa huduma

source: Service Creation Example Scenario
fr: Exemple de création de services Scénario
sw: Mfano wa uundaji wa huduma

source: Assume you would like to have Agrometeorology Service on the website, the practical way to do it using the steps above would be:
fr: Supposons que vous aimeriez avoir un service d'agrométéorologie sur le site Web, la façon pratique de le faire en utilisant les étapes ci-dessus serait:
sw: Fikiria ungependa kuwa na huduma ya agrometeorology kwenye wavuti, njia ya vitendo ya kuifanya kwa kutumia hatua hapo juu itakuwa:

source: Step 1: Create an 'Agromet Service Category'
fr: Étape 1: Créez une «catégorie de service Agromet»
sw: Hatua ya 1: Unda 'Jamii ya Huduma ya Agromet'

source: To create a service, navigate to the 'Snippets' section on the explorer menu and select 'Servies Categories' as below:
fr: Pour créer un service, accédez à la section «Extraits» du menu Explorer et sélectionnez «Catégories Services» comme ci-dessous:
sw: Ili kuunda huduma, nenda kwa sehemu ya 'Snippets' kwenye menyu ya Explorer na uchague 'Aina za Huduma' kama ilivyo hapo chini:

source: Click on 'Add service category' to create a new service.
fr: Cliquez sur «Ajouter une catégorie de service» pour créer un nouveau service.
sw: Bonyeza kwenye 'Ongeza Jamii ya Huduma' kuunda huduma mpya.

source: Step 2: Create a Service Listing page
fr: Étape 2: Créez une page de liste de services
sw: Hatua ya 2: Unda ukurasa wa orodha ya huduma

source: A listing page is a page that holds a list of pages. For example, a Service Listing page would hold an agrometeorology service page, weather forecasting page, etc.
fr: Une page d'inscription est une page qui contient une liste de pages. Par exemple, une page de listing de services contiendrait une page de service agrométéorologie, une page de prévision météorologique, etc.
sw: Ukurasa wa orodha ni ukurasa ambao una orodha ya kurasa. Kwa mfano, ukurasa wa orodha ya huduma ungeshikilia ukurasa wa huduma ya agrometeorology, ukurasa wa utabiri wa hali ya hewa, nk.

source: ![Services List Preview](../../_static/images/services/service_list_preview.png "Services List Preview")
fr: ! [Aperçu des services de services] (../../_ statique / images / services / service_list_preview.png "Aperçu de la liste des services")
sw: ! [Hakikisho la orodha ya huduma] (../../_ tuli/picha/huduma/huduma

source: Services List Preview
fr: Aperçu de la liste des services
sw: Hakikisho la orodha ya huduma

source: This option will only appear if no service listing page already exists as there can only be on instance/occurrrence of a service listing page.
fr: Cette option n'apparaîtra que si aucune page de liste de services n'existe déjà car il ne peut y avoir que sur l'instance / l'occurrence d'une page de liste de services.
sw: Chaguo hili litaonekana tu ikiwa hakuna ukurasa wa orodha ya huduma tayari upo kwani kunaweza kuwa na mfano/tukio la ukurasa wa orodha ya huduma.

source: Select Service List Page from the type of pages provided.
fr: Sélectionnez la page de liste des services dans le type de pages fournies.
sw: Chagua ukurasa wa Orodha ya Huduma kutoka kwa aina ya kurasa zilizotolewa.

source: ![Add Service List Page](../../_static/images/services/add_service_list.png "Add Service List Page")
fr: ! [Ajouter la page de liste des services] (../../_ statique / images / services / add_service_list.png "Ajouter la page de liste des services")
sw: ! [Ongeza ukurasa wa Orodha ya Huduma] (../../_ tuli/picha/huduma/add_service_list.png "Ongeza ukurasa wa Orodha ya Huduma"))

source: Add Service List Page
fr: Ajouter la page de la liste des services
sw: Ongeza ukurasa wa Orodha ya Huduma

source: Provide a the page title and Heading and either save draft, publish or submit to moderation depending on your previlleges.
fr: Fournissez un titre et un titre de page et enregistrez-vous, publiez ou soumettez-vous à la modération en fonction de vos previlleges.
sw: Toa kichwa cha ukurasa na kichwa na ama uhifadhi rasimu, kuchapisha au kuwasilisha kwa wastani kulingana na viboreshaji vyako.

source: ![Add Service List Page](../../_static/images/services/service_list_page.png "Add Service List Page")
fr: ! [Ajouter une page de liste de services] (../../_ statique / images / services / service_list_page.png "Ajouter la page de liste des services")
sw: ! [Ongeza ukurasa wa Orodha ya Huduma] (../../_ tuli/picha/huduma/huduma_list_page.png "Ongeza ukurasa wa Orodha ya Huduma"))

source: Step 3: Create a service page
fr: Étape 3: Créez une page de service
sw: Hatua ya 3: Unda ukurasa wa huduma

source: This will navigate to the list of pages under the home page including the service list page you just created. Hover over the the services listing page and click on 'add child page'.
fr: Cela accédera à la liste des pages sous la page d'accueil, y compris la page de liste des services que vous venez de créer. Survolez la page de liste des services et cliquez sur «Ajouter une page enfant».
sw: Hii itaenda kwenye orodha ya kurasa zilizo chini ya ukurasa wa nyumbani pamoja na ukurasa wa orodha ya huduma uliyounda tu. Hover juu ya ukurasa wa orodha ya Huduma na ubonyeze kwenye 'Ongeza Ukurasa wa Mtoto'.

source: ![Add Service Page](../../_static/images/services/add_service.png "Add Service Page")
fr: ! [Ajouter une page de service] (../../_ statique / images / services / add_service.png "Ajouter une page de service")
sw: ! [Ongeza ukurasa wa huduma] (../../_ tuli/picha/huduma/add_service.png "Ongeza ukurasa wa huduma")

source: Add Service Page
fr: Ajouter la page de service
sw: Ongeza ukurasa wa huduma

source: ![Service Page Sections](../../_static/images/services/service_page_sections.png "Service Page Sections")
fr: ! [Sections de page de service] (../../_ statique / images / services / service_page_sections.png "Sections de page de service")
sw: ! [Sehemu za Ukurasa wa Huduma] (../../_ tuli/picha/huduma/huduma_page_sections.png "Sehemu za Huduma"))

source: Service Page Sections
fr: Sections de page de service
sw: Sehemu za Ukurasa wa Huduma

source: **Service Category** - selected from previously prepared service category in step 2.
fr: ** Catégorie de service ** - Sélectionné dans la catégorie de service précédemment préparée à l'étape 2.
sw: ** Jamii ya Huduma ** - Iliyochaguliwa kutoka kwa Jamii ya Huduma iliyotayarishwa hapo awali katika Hatua ya 2.

source: **Banner Section** - this contains the banner image, title, subtitle and call to action button.
fr: ** Section de bannières ** - Cela contient l'image de la bannière, le titre, le sous-titre et le bouton d'appel à l'action.
sw: ** Sehemu ya mabango ** - Hii ina picha ya mabango, kichwa, subtitle na wito kwa kitufe cha hatua.

source: ![Banner Sections](../../_static/images/services/banner_section.png "Banner Sections")
fr: ! [Sections de bannières] (../../_ statique / images / services / bannière_section.png "sections de bannières")
sw: ! [Sehemu za mabango] (../../_ tuli/picha/huduma/banner_section.png "sehemu za mabango"))

source: Banner Sections
fr: Sections de bannière
sw: Sehemu za mabango

source: **Introduction Section** - this contains the introduction title, introduction image, introduction text and button.
fr: ** Section d'introduction ** - Ceci contient le titre d'introduction, l'image d'introduction, le texte d'introduction et le bouton.
sw: ** Sehemu ya Utangulizi ** - Hii ina kichwa cha utangulizi, picha ya utangulizi, maandishi ya utangulizi na kitufe.

source: ![Introduction Sections](../../_static/images/services/introduction_section.png "Introduction Sections")
fr: ! [Sections d'introduction] (../../_ statique / images / services / introduction_section.png "Sections d'introduction")
sw: ! [Sehemu za utangulizi] (../../_ tuli/picha/huduma/utangulizi_section.png "sehemu za utangulizi"))

source: Introduction Sections
fr: Sections d'introduction
sw: Sehemu za Utangulizi

source: **What we do in this Service section** - entails the 'what we do' items and what we do button.
fr: ** Ce que nous faisons dans cette section de service ** - implique les éléments «ce que nous faisons» et ce que nous faisons.
sw: ** Tunachofanya katika sehemu hii ya huduma ** - inajumuisha vitu vya 'tunachofanya' na kitufe tunachofanya.

source: ![What we do Sections](../../_static/images/services/what_we_do_section.png "What we do Sections")
fr: ! [Ce que nous faisons sections] (../../_ statique / images / services / what_we_do_section.png "What We Do Sections")

source: What we do Sections
fr: Ce que nous faisons sections
sw: Tunachofanya sehemu

source: **Projects Section** - This contains a description of the projects linked to the service being edited. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects and linking them to services.
fr: ** Section des projets ** - Ceci contient une description des projets liés au service édité. Veuillez référer [Gérer les projets] (./ Manage-Projects) pour guider la création de projets et les lier aux services.
sw: ** Sehemu ya Miradi ** - Hii ina maelezo ya miradi iliyounganishwa na huduma inayohaririwa. Tafadhali rejelea [Dhibiti miradi] (.

source: ![Projects Sections](../../_static/images/services/projects_section.png "Projects Sections")
fr: ! [Projets sections] (../../_ statique / images / services / projets_section.png "sections projets")
sw: ! [Sehemu za miradi] (../../_ tuli/picha/huduma/miradi_section.png "Sehemu za miradi"))

source: Projects Sections
fr: Project sections
sw: Sehemu za miradi
