Repository: wmo-raf/climweb-docs
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: fr, sw

source: The technical support provided to NMHSs at the WMO Regional Office for Africa include:
fr: Le soutien technique fourni à NMHSS au bureau régional de l'OMM pour l'Afrique comprend:
sw: Msaada wa kiufundi uliotolewa kwa NMHSS katika Ofisi ya Mkoa wa WMO kwa Afrika ni pamoja na:

source: Focal Points verification and updates for different WMO Programmes including OSCAR Surface, WIGOS, WDQMS and CAP
fr: Vérification des points focaux et mises à jour pour différents programmes WMO, notamment Oscar Surface, Wigos, WDQMS et CAP
sw: Uthibitishaji wa vidokezo vya kuzingatia na sasisho za programu tofauti za WMO pamoja na uso wa Oscar, Wigis, WDQMS na CAP

source: [OSCAR Surface](https://oscar.wmo.int/surface/#/about) verification and updates Station Metadata Update
fr: [Surface des Oscars] (https://oscar.wmo.int/surface/#/about) Vérification et mise à jour de la mise à jour des métadonnées de la station
sw: [Oscar uso] (https://oscar.wmo.int/surface/#/about) Uthibitishaji na sasisho za kituo cha metadata

source: Data transmission challenges identification, troubleshooting and resolution
fr: Défis de transmission des données Identification, dépannage et résolution
sw: Changamoto za maambukizi ya data, utatuzi na utatuzi

source: WMO Country Profile Database updates
fr: Mises à jour de la base de données du profil du pays WMO
sw: Sasisho za Hifadhidata ya Profaili ya WMO

source: Website and Content Management System (ClimWeb) development and support
fr: Développement et soutien du système de gestion de contenu et de contenu)
sw: Mfumo wa Usimamizi wa Wavuti na Yaliyomo (CLIMWEB) na msaada

source: CAP Activation and Dissemination
fr: Activation et dissémination du CAP
sw: Uanzishaji wa cap na usambazaji

source: Social Media Management and communication, Email Marketing and User Data Management
fr: Gestion des médias sociaux et communication, marketing par e-mail et gestion des données des utilisateurs
sw: Usimamizi wa media ya kijamii na mawasiliano, uuzaji wa barua pepe na usimamizi wa data ya watumiaji

source: ![Stepwise Approach](../_static/images/home/stepwise_approach.jpg "Stepwise Approach")
fr: ! [Approche pas à pas] (../_ Static / Images / Home / Stepwed_Approach.jpg "Approche étapes")

source: Stepwise Approach
fr: Approche pas à pas
sw: Njia ya hatua kwa hatua

source: This document provides an overview of the Content Management System (ClimWeb) and its features, the delivery and support.
fr: Ce document donne un aperçu du système de gestion de contenu (Clipweb) et de ses fonctionnalités, de la livraison et de la prise en charge.
sw: Hati hii hutoa muhtasari wa Mfumo wa Usimamizi wa Yaliyomo (ClimWeb) na huduma zake, utoaji na msaada.

source: This new ClimWeb template offers:
fr: Ce nouveau modèle de montée propose:
sw: Kiolezo hiki kipya cha Clipweb kinatoa:

source: Customisable and modern design
fr: Design personnalisable et moderne
sw: Ubunifu wa kisasa na wa kisasa

source: Seamless marketing integrations
fr: Intégrations marketing sans couture
sw: Ujumuishaji wa uuzaji usio na mshono

source: User-friendly CAP Warnings Composer
fr: Compositeur des avertissements de capuchon convivial
sw: Mtunzi wa Maonyo ya Utumiaji wa Matumizi

source: Interactive georeferenced data visualisation for NMHSs weather and climate products, as well as data from external sources.
fr: Visualisation des données géoréférencées interactives pour les produits météorologiques et climatiques NMHSS, ainsi que les données provenant de sources externes.
sw: Maingiliano ya data inayoingiliana ya hali ya hewa ya hali ya hewa ya NMHSS na bidhaa za hali ya hewa, na pia data kutoka kwa vyanzo vya nje.

source: It adopts **best practices in data visualization and hydro meteorological department and climate communications**. All components of the website are built on free and open-source standards allowing for collaboration and contribution.
fr: Il adopte ** les meilleures pratiques dans la visualisation des données et le département météorologique hydroélectrique et les communications climatiques **. Tous les composants du site Web sont construits selon les normes gratuites et open source permettant la collaboration et la contribution.
sw: Inachukua ** mazoea bora katika taswira ya data na idara ya hali ya hewa ya hydro na mawasiliano ya hali ya hewa **. Vipengele vyote vya wavuti vimejengwa kwa viwango vya bure na vya wazi vya chanzo vinavyoruhusu kushirikiana na mchango.

source: The CAP Warnings Composer is expected to **increase the adoption of the Common Alerting Protocol in Africa**, key to increasing the reach of alerts, and their connectivity to broadcast, web and mobile networks. Africa remains one of the world's most vulnerable regions to climate change and increasing extremes. Increasing the protection of the population through improved climate and early warning communications is crucial.
fr: Le compositeur des avertissements CAP devrait ** augmenter l'adoption du protocole d'alerte commun en Afrique **, clé pour augmenter la portée des alertes et leur connectivité à la diffusion, aux réseaux Web et mobiles. L'Afrique reste l'une des régions les plus vulnérables au monde au changement climatique et à l'augmentation des extrêmes. L'augmentation de la protection de la population grâce à l'amélioration des communications climatiques et d'alerte précoce est cruciale.
sw: Mtunzi wa maonyo ya cap anatarajiwa kuongeza*Kuongeza kupitishwa kwa itifaki ya kawaida ya kuarifu barani Afrika **, ufunguo wa kuongeza ufikiaji wa arifu, na kuunganishwa kwao kwa matangazo, mitandao ya wavuti na ya rununu. Afrika inabaki kuwa moja ya maeneo yaliyo hatarini zaidi ulimwenguni kwa mabadiliko ya hali ya hewa na kuongezeka kwa hali ya juu. Kuongeza ulinzi wa idadi ya watu kupitia hali ya hewa iliyoboreshwa na mawasiliano ya tahadhari mapema ni muhimu.

source: Considerations during the design & development phase
fr: Considérations pendant la phase de conception et de développement
sw: Mawazo wakati wa awamu ya kubuni na maendeleo

source: During the design and development phase, fundamental factors were taken into consideration to ensure the delivery of a Content Management System that would improve the efficiency of management.
fr: Au cours de la phase de conception et de développement, des facteurs fondamentaux ont été pris en considération pour assurer la livraison d'un système de gestion de contenu qui améliorerait l'efficacité de la gestion.
sw: Wakati wa awamu ya kubuni na maendeleo, sababu za msingi zilizingatiwa ili kuhakikisha utoaji wa mfumo wa usimamizi wa yaliyomo ambao utaboresha ufanisi wa usimamizi.

source: ![ClimWeb Features](../_static/images/home/features.jpg "ClimWeb Features")
fr: ! [Fonctionnalités de l'entraînement] (../_ statique / images / home / fonctionnalités.jpg "fonctionnalités de climatise")

source: ClimWeb Features
fr: Fonctionnalités de l'entraînement
sw: Vipengele vya Clipweb

source: It factored in:
fr: Il a pris en compte:
sw: Ilijitokeza katika:

source: Well **defined content structure** and pages management,
fr: Bien ** Structure de contenu définie ** et gestion des pages,
sw: Vizuri ** muundo wa yaliyomo yaliyofafanuliwa ** na usimamizi wa kurasa,

source: **User-friendly interface** with a modern look and feel
fr: ** Interface conviviale ** avec un aspect moderne
sw: ** Maingiliano ya kirafiki ya watumiaji ** na sura ya kisasa na kuhisi

source: Great **user experience and ease** in locating content
fr: Excellente ** expérience utilisateur et facilité ** pour localiser le contenu
sw: Uzoefu mzuri wa mtumiaji na urahisi ** katika kupata yaliyomo

source: A **decentralized ClimWeb architecture** was adopted to allow management of departmental sections by different user roles and allow for content moderation and publishing **workflows**
fr: Une ** Architecture de montée décentralisée ** a été adoptée pour permettre la gestion des sections départementales par différents rôles utilisateur et permettre la modération et la publication du contenu ** Workflows **
sw: Usanifu wa ClipWeb wa ** ulipitishwa ili kuruhusu usimamizi wa sehemu za idara kwa majukumu tofauti ya watumiaji na kuruhusu wastani wa maudhui na kuchapisha ** kazi za kazi **

source: Currently, most of the NMHSs website's management is not decentralized. This means that the website is managed by one staff, usually from the IT department. This is not very efficient as every department has its own content, but the content management systems are not user-friendly to allow for easy management of content by different departments. The new ClimWeb template allows for the management of different sections of the website by different staff, thus removing the load from the IT department and allowing for more efficient management of the website.
fr: Actuellement, la majeure partie de la direction du site Web du NMHSS n'est pas décentralisée. Cela signifie que le site Web est géré par un seul personnel, généralement du service informatique. Ce n'est pas très efficace car chaque département a son propre contenu, mais les systèmes de gestion de contenu ne sont pas conviviaux pour permettre une gestion facile du contenu par différents départements. Le nouveau modèle de montée permet la gestion de différentes sections du site Web par différents membres du personnel, supprimant ainsi la charge du service informatique et permettant une gestion plus efficace du site Web.
sw: Hivi sasa, usimamizi mwingi wa wavuti ya NMHSS haujadhibitiwa. Hii inamaanisha kuwa wavuti inasimamiwa na wafanyikazi mmoja, kawaida kutoka kwa idara ya IT. Hii haifai sana kwani kila idara ina maudhui yake mwenyewe, lakini mifumo ya usimamizi wa yaliyomo sio ya urahisi kuruhusu usimamizi rahisi wa yaliyomo na idara tofauti. Kiolezo kipya cha Clipweb kinaruhusu usimamizi wa sehemu tofauti za wavuti na wafanyikazi tofauti, na hivyo kuondoa mzigo kutoka kwa idara ya IT na kuruhusu usimamizi bora wa wavuti.

source: . ![centralization](../_static/images/home/centralization.jpg "centralization")
fr: . ! [Centralisation] (../_ statique / images / home / centralisation.jpg "Centralisation")

source: centralization
fr: centralisation
sw: ujumuishaji

source: Delivery and support
fr: Livraison et soutien
sw: Utoaji na msaada

source: For a smooth and efficient delivery of the ClimWeb and customization of the website template to the NMHS, a step by step process is adopted. The quality and interactivity of the website is first assessed followed by approaching and presenting the ClimWeb and integrating feedback. Thereafter, willing/potential members for support are identified together with a focal point for coordination. The ClimWeb is then installed and training on the configuration of ClimWeb and customization of the website conducted. Additionally, learning materials, documentations and guides are provided alongside follow-up support in troubleshooting
fr: Pour une livraison fluide et efficace de l'escalade et la personnalisation du modèle de site Web au NMHS, un processus étape par étape est adopté. La qualité et l'interactivité du site Web sont d'abord évaluées, suivis par l'approche et la présentation de l'ascension et l'intégration des commentaires. Par la suite, les membres volontaires / potentiels pour le soutien sont identifiés avec un point focal pour la coordination. Le montée est ensuite installée et une formation sur la configuration de l'ascension et la personnalisation du site Web mené. De plus, des documents d'apprentissage, des documentations et des guides sont fournis parallèlement au support de suivi dans le dépannage
sw: Kwa uwasilishaji laini na mzuri wa kupanda na ubinafsishaji wa template ya wavuti kwa NMHS, hatua kwa hatua hupitishwa. Ubora na maingiliano ya wavuti hupimwa kwanza ikifuatiwa na kukaribia na kuwasilisha Clipweb na kuunganisha maoni. Baada ya hapo, wanachama walio tayari/wanaowezekana kwa msaada hugunduliwa pamoja na mahali pa kuzingatia kwa uratibu. Clipweb basi imewekwa na mafunzo juu ya usanidi wa Clipweb na ubinafsishaji wa wavuti uliofanywa. Kwa kuongeza, vifaa vya kujifunza, nyaraka na miongozo hutolewa pamoja na msaada wa kufuata katika utatuzi wa shida

source: ![ClimWeb Support](../_static/images/home/support.jpg "ClimWeb Support")
fr: ! [Support Climweb] (../_ statique / images / home / support.jpg "Support de climatisation")

source: ClimWeb Support
fr: Support de montée
sw: Msaada wa kupanda

source: Core Components and Integrations
fr: Composants et intégrations de base
sw: Vipengele vya msingi na viunganisho

source: ![ClimWeb Support](../_static/images/home/cms_banner_types.png "ClimWeb")
fr: ! [Support de l'entraînement] (../_ statique / images / home / cms_banner_types.png "climweb")

source: **User friendly website Content Management System**
fr: ** Système de gestion de contenu du site Web convivial **
sw: ** Mfumo wa Usimamizi wa Wavuti wa Wavuti wa Wavuti **

source: Modern look and design, mobile friendly.
fr: Look and Design moderne, convivial.
sw: Muonekano wa kisasa na muundo, wa kirafiki wa rununu.

source: Adopts best practices and designs benchmarked for weather and climate information dissemination for NMHSs in Africa.
fr: Adopte les meilleures pratiques et les conceptions comparées pour les intempéries et la diffusion des informations climatiques pour le NMHSS en Afrique.
sw: Inachukua mazoea bora na miundo iliyowekwa alama ya hali ya hewa na usambazaji wa habari ya hali ya hewa kwa NMHSS barani Afrika.

source: Easy to use and customise without technical skills.
fr: Facile à utiliser et à personnaliser sans compétences techniques.
sw: Rahisi kutumia na kubinafsisha bila ujuzi wa kiufundi.

source: Decentralised content management. Different staff can be assigned and manage different sections of the website.
fr: Gestion de contenu décentralisée. Différents membres du personnel peuvent être attribués et gérer différentes sections du site Web.
sw: Usimamizi wa Yaliyomo. Wafanyikazi tofauti wanaweza kupewa na kusimamia sehemu tofauti za wavuti.

source: Defined content publishing workflows. Editors and moderators can be defined for every section of the website.
fr: Des workflows de publication de contenu défini. Les éditeurs et les modérateurs peuvent être définis pour chaque section du site Web.
sw: Marekebisho yaliyofafanuliwa ya kuchapisha yaliyomo. Wahariri na wasimamizi wanaweza kufafanuliwa kwa kila sehemu ya wavuti.

source: Embedding Multimedia Content - Youtube etc.
fr: Incorporer le contenu multimédia - YouTube etc.
sw: Kuingiza Multimedia Yaliyomo - YouTube nk.

source: Modern Cap Warnings Composer with simple user friendly and mobile friendly CAP alert creation and management.
fr: Compositeur des avertissements modernes avec une création et une gestion des alertes CAP conviviales et adaptées à un mobile simples.
sw: Maonyo ya kisasa ya cap na mtunzi rahisi wa kirafiki na wa kirafiki wa tahadhari na usimamizi.

source: Moderated Publishing Workflow from CAP composer to approver, including commenting and email notification support.
fr: Le flux de travail de publication modérée de CAP Composer à l'approbateur, y compris les commentaires et le support de notification par e-mail.
sw: Utaratibu wa kuchapisha uliodhibitiwa kutoka kwa mtunzi wa CAP hadi idhini, pamoja na kutoa maoni na msaada wa arifa ya barua pepe.

source: Conforms to CAP Version 1.2 Standards.
fr: Conforme aux normes CAP version 1.2.
sw: Inalingana na viwango vya CAP toleo la 1.2.

source: Search Engine Optimisation support to increase visibility and attract targeted traffic to an alert.
fr: Support d'optimisation des moteurs de recherche pour augmenter la visibilité et attirer le trafic ciblé vers une alerte.
sw: Msaada wa utaftaji wa injini za utaftaji ili kuongeza mwonekano na kuvutia trafiki inayolenga kwa tahadhari.

source: Support for Approval Workflow from composer to approver, including commenting and email notification support.
fr: Prise en charge du flux de travail d'approbation du compositeur à l'approbateur, y compris les commentaires et le support de notification par e-mail.
sw: Msaada wa utaftaji wa idhini kutoka kwa mtunzi hadi kibali, pamoja na kutoa maoni na msaada wa arifa ya barua pepe.

source: Interoperable XML API of Alert List and Detail for integration with CAP Aggregators
fr: API XML interopérable de la liste des alertes et des détails pour l'intégration avec les agrégateurs CAP
sw: API inayoweza kushirikiana ya XML ya orodha ya tahadhari na undani wa kujumuishwa na wakusanyaji wa cap

source: Live CAP creation and editing preview.
fr: Création de plafond en direct et édition de prévisualisation.
sw: Uundaji wa kofia ya moja kwa moja na hakiki ya kuhariri.

source: Draw / Upload Polygon Functionality for Alert Area/Areas.
fr: Dessinez / téléchargez la fonctionnalité des polygones pour les zones d'alerte / zones.
sw: Chora / pakia utendaji wa polygon kwa eneo la tahadhari / maeneo.

source: Alert to Alert/Alerts Reference Linkage.
fr: Alerte sur la liaison de référence alerte / alerte.
sw: Tahadhari kwa uhusiano wa kumbukumbu/tahadhari.

source: **Events registrations and Integration with Online Meeting Platforms (Zoom)**
fr: ** Les enregistrements d'événements et l'intégration avec les plates-formes de réunion en ligne (Zoom) **
sw: ** Usajili wa Matukio na Ushirikiano na Jukwaa la Mkutano Mkondoni (Zoom) **

source: Create event registration forms hosted on the website.
fr: Créez des formulaires d'inscription d'événements organisés sur le site Web.
sw: Unda fomu za usajili wa hafla iliyokaribishwa kwenye wavuti.

source: Automatically send invitation emails to users as they register to events from the website.
fr: Envoyez automatiquement les e-mails d'invitation aux utilisateurs lorsqu'ils s'inscrivent aux événements du site Web.
sw: Tuma barua pepe za mwaliko kiatomati kwa watumiaji wanapojiandikisha kwa hafla kutoka kwa wavuti.

source: Keep record of all your registrants for internal analysis.
fr: Gardez la trace de tous vos inscrits pour l'analyse interne.
sw: Weka rekodi ya wasajili wako wote kwa uchambuzi wa ndani.

source: Allow users registering to events to also subscribe to your products.
fr: Permettez aux utilisateurs qui s'inscrivent aux événements pour s'abonner également à vos produits.
sw: Ruhusu watumiaji wanaojiandikisha kwa hafla ili kujisajili pia kwa bidhaa zako.

source: **Interactive Georeferenced data visualisation**
fr: ** Visualisation des données géoréférencées interactives **
sw: ** Maingiliano ya data ya maingiliano ya Georefered **

source: Upload and visualise own gridded data (forecasts, advisories, climate data products) on a map.
fr: Téléchargez et visualisez les propres données grillées (prévisions, avis, produits climatiques) sur une carte.
sw: Pakia na kuibua data mwenyewe (utabiri, ushauri, bidhaa za data ya hali ya hewa) kwenye ramani.

source: Upload and visualise vector data (Point, areas) on a map.
fr: Téléchargez et visualisez les données vectorielles (point, zones) sur une carte.
sw: Pakia na kuibua data ya vector (uhakika, maeneo) kwenye ramani.

source: Visualise own CAP alerts.
fr: Visualisez les propres alertes CAP.
sw: Fikiria arifu za cap mwenyewe.

source: Visualise thematic/sectorial data products interactively.
fr: Visualisez les produits de données thématiques / sectorielles de manière interactive.
sw: Fikiria bidhaa za data za kiserikali/za kisekta kwa maingiliano.

source: Integrate external data sources ( from Regional Centers, Global Producing Centers, Satellite, Google Earth Engine etc).
fr: Intégrez les sources de données externes (des centres régionaux, des centres de production mondiale, du satellite, du moteur Google Earth, etc.).
sw: Unganisha vyanzo vya data vya nje (kutoka vituo vya mkoa, vituo vya kutengeneza ulimwenguni, satelaiti, injini ya Google Earth nk).

source: Provide a platform to support impact based forecasts, analysis and advisories.
fr: Fournir une plate-forme pour soutenir les prévisions, l'analyse et les avis basés sur l'impact.
sw: Toa jukwaa la kusaidia utabiri wa msingi wa athari, uchambuzi na ushauri.

source: **Email Marketing integration and user analytics**
fr: ** Intégration du marketing par e-mail et analyse des utilisateurs **
sw: ** Ushirikiano wa Uuzaji wa Barua pepe na Uchambuzi wa Mtumiaji **

source: Sign Up forms for users to subscribe to NMHSs products (using Mautic or Mailchimp).
fr: Inscrivez-vous les formulaires pour que les utilisateurs s'abonnent aux produits NMHSS (en utilisant Mautic ou MailChimp).
sw: Jisajili Fomu za Watumiaji Kujiandikisha kwa Bidhaa za NMHSS (kwa kutumia Mautic au MailChimp).

source: Analyse your email marketing users data.
fr: Analysez les données de vos utilisateurs de marketing par e-mail.
sw: Chambua data yako ya watumiaji wa uuzaji wa barua pepe.

source: **Survey creation and results analysis**
fr: ** Analyse de la création de l'enquête et des résultats **
sw: ** Uundaji wa Utafiti na Uchambuzi wa Matokeo **

source: Create custom surveys hosted on own website.
fr: Créez des enquêtes personnalisées hébergées sur son propre site Web.
sw: Unda uchunguzi wa kawaida uliokaribishwa kwenye wavuti yako mwenyewe.

source: Analyse results on interactive dashboards.
fr: Analyser les résultats sur les tableaux de bord interactifs.
sw: Chambua matokeo kwenye dashibodi zinazoingiliana.

source: **User analytics**
fr: ** Analyse des utilisateurs **
sw: ** Uchambuzi wa Mtumiaji **

source: User base breakdown (eg. by sectors, gender, geographic area, etc, from user database - email marketing software).
fr: Réflexion de la base d'utilisateurs (par exemple par les secteurs, le sexe, la zone géographique, etc., à partir de la base de données des utilisateurs - logiciel de marketing par e-mail).
sw: Kuvunja kwa msingi wa watumiaji (kwa mfano na sekta, jinsia, eneo la kijiografia, nk, kutoka kwa hifadhidata ya watumiaji - programu ya uuzaji wa barua pepe).

source: User satisfaction (from surveys) data and trends .
fr: Données et tendances de la satisfaction des utilisateurs (des enquêtes).
sw: Kuridhika kwa watumiaji (kutoka kwa tafiti) data na mwenendo.

source: Website traffic analytics (eg. google analytics) .
fr: Analyse du trafic de site Web (par exemple Google Analytics).
sw: Uchambuzi wa Trafiki ya Tovuti (kwa mfano. Google Analytics).

source: System traffic analytics (eg. hazards watch) .
fr: Analyse du trafic système (par exemple, Hazards Watch).
sw: Mchanganuo wa trafiki wa mfumo (kwa mfano. Hazina za saa).

source: Social media analytics
fr: Analyse des médias sociaux
sw: Mchanganuo wa media ya kijamii

source: Twitter
fr: Gazouillement

source: Mailing Integrations
fr: Intégrations envoyées par la poste
sw: Ujumuishaji wa barua

source: Mautic
fr: Muutique

source: Mautic is an open-source alternative to Mailchimp.
fr: Mautic est une alternative open source à MailChimp.
sw: Mautic ni mbadala wa chanzo wazi kwa MailChimp.

source: The aim of this package is to render a given Mautic Form on a Wagtail page, and send the submitted data to Mautic. Other Mautic functionalities might be added later as need arises.
fr: Le but de ce package est de rendre un formulaire Mautic donné sur une page de bergeronnette et d'envoyer les données soumises à Mautic. D'autres fonctionnalités mautiques pourraient être ajoutées plus tard au besoin.
sw: Kusudi la kifurushi hiki ni kutoa fomu ya Mautic kwenye ukurasa wa Wagtail, na kutuma data iliyowasilishwa kwa Mautic. Kazi zingine za Mautic zinaweza kuongezwa baadaye kama hitaji linavyotokea.

source: For package developer guide visit [Wagtail Mautic Developer Guide](https://github.com/wmo-raf/wagtailmautic)
fr: Pour les développeurs de colis, visitez [Guide du développeur Mautic Wagtail] (https://github.com/wmo-raf/wagtailmautic)
sw: Kwa Mwongozo wa Mwongozo wa Msanidi programu [Mwongozo wa Wasanidi Programu wa Wagtail Mautic] (https://github.com/wmo-raf/wagtailmautic)
